Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x7aa (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x3cb40): ../Core/Src/ANALOG.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4a233): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 4 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4c39b): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2be2d): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 4 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><44>: Abbrev Number: 4 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x7278d): short int
 <1><4b>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x7d80f): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 4 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x93163): short unsigned int
 <1><5e>: Abbrev Number: 4 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x60d58): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 4 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><78>: Abbrev Number: 4 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x44c89): long long int
 <1><7f>: Abbrev Number: 4 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><86>: Abbrev Number: 16 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 4 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><94>: Abbrev Number: 2 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x2be2f): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x6fb41): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 2 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x6f2a1): uint32_t
    <b6>   DW_AT_decl_file   : 3
    <b7>   DW_AT_decl_line   : 48
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x65>
 <1><bd>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 17 (DW_TAG_array_type)
    <c3>   DW_AT_type        : <0xac>
    <c7>   DW_AT_sibling     : <0xd2>
 <2><cb>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <cc>   DW_AT_type        : <0x8d>
    <d0>   DW_AT_upper_bound : 3
 <2><d1>: Abbrev Number: 0
 <1><d2>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d3>   DW_AT_type        : <0xc2>
 <1><d7>: Abbrev Number: 13 (DW_TAG_variable)
    <d8>   DW_AT_name        : (indirect string, offset: 0x9971a): adc_raw_readings
    <dc>   DW_AT_decl_file   : 4
    <dd>   DW_AT_decl_line   : 13
    <de>   DW_AT_decl_column : 26
    <df>   DW_AT_type        : <0xd2>
    <e3>   DW_AT_external    : 1
    <e3>   DW_AT_declaration : 1
 <1><e3>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e4>   DW_AT_byte_size   : 16
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 15
    <e7>   DW_AT_decl_column : 9
    <e7>   DW_AT_sibling     : <0x120>
 <2><eb>: Abbrev Number: 1 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x8a68b): windDirection
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 16
    <f2>   DW_AT_decl_column : 8
    <f3>   DW_AT_type        : <0x120>
    <f7>   DW_AT_data_member_location: 0
 <2><f8>: Abbrev Number: 1 (DW_TAG_member)
    <f9>   DW_AT_name        : (indirect string, offset: 0x288c2): batteryVoltage
    <fd>   DW_AT_decl_file   : 4
    <fe>   DW_AT_decl_line   : 17
    <ff>   DW_AT_decl_column : 8
    <100>   DW_AT_type        : <0x120>
    <104>   DW_AT_data_member_location: 4
 <2><105>: Abbrev Number: 1 (DW_TAG_member)
    <106>   DW_AT_name        : (indirect string, offset: 0x61163): extra1
    <10a>   DW_AT_decl_file   : 4
    <10b>   DW_AT_decl_line   : 18
    <10c>   DW_AT_decl_column : 8
    <10d>   DW_AT_type        : <0x120>
    <111>   DW_AT_data_member_location: 8
 <2><112>: Abbrev Number: 1 (DW_TAG_member)
    <113>   DW_AT_name        : (indirect string, offset: 0x6116a): extra2
    <117>   DW_AT_decl_file   : 4
    <118>   DW_AT_decl_line   : 19
    <119>   DW_AT_decl_column : 8
    <11a>   DW_AT_type        : <0x120>
    <11e>   DW_AT_data_member_location: 12
 <2><11f>: Abbrev Number: 0
 <1><120>: Abbrev Number: 4 (DW_TAG_base_type)
    <121>   DW_AT_byte_size   : 4
    <122>   DW_AT_encoding    : 4	(float)
    <123>   DW_AT_name        : (indirect string, offset: 0x83cdc): float
 <1><127>: Abbrev Number: 2 (DW_TAG_typedef)
    <128>   DW_AT_name        : (indirect string, offset: 0x5dceb): AdcData_t
    <12c>   DW_AT_decl_file   : 4
    <12d>   DW_AT_decl_line   : 20
    <12e>   DW_AT_decl_column : 3
    <12f>   DW_AT_type        : <0xe3>
 <1><133>: Abbrev Number: 9 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 80
    <135>   DW_AT_decl_file   : 5
    <136>   DW_AT_decl_line   : 151
    <137>   DW_AT_decl_column : 9
    <137>   DW_AT_sibling     : <0x232>
 <2><13b>: Abbrev Number: 5 (DW_TAG_member)
    <13c>   DW_AT_name        : SR
    <13f>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 153
    <140>   DW_AT_decl_column : 17
    <140>   DW_AT_type        : <0xbd>
    <144>   DW_AT_data_member_location: 0
 <2><145>: Abbrev Number: 5 (DW_TAG_member)
    <146>   DW_AT_name        : CR1
    <14a>   DW_AT_decl_file   : 5
    <14a>   DW_AT_decl_line   : 154
    <14b>   DW_AT_decl_column : 17
    <14b>   DW_AT_type        : <0xbd>
    <14f>   DW_AT_data_member_location: 4
 <2><150>: Abbrev Number: 5 (DW_TAG_member)
    <151>   DW_AT_name        : CR2
    <155>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 155
    <156>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0xbd>
    <15a>   DW_AT_data_member_location: 8
 <2><15b>: Abbrev Number: 1 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0x89efb): SMPR1
    <160>   DW_AT_decl_file   : 5
    <161>   DW_AT_decl_line   : 156
    <162>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xbd>
    <167>   DW_AT_data_member_location: 12
 <2><168>: Abbrev Number: 1 (DW_TAG_member)
    <169>   DW_AT_name        : (indirect string, offset: 0x35f3f): SMPR2
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 157
    <16f>   DW_AT_decl_column : 17
    <170>   DW_AT_type        : <0xbd>
    <174>   DW_AT_data_member_location: 16
 <2><175>: Abbrev Number: 1 (DW_TAG_member)
    <176>   DW_AT_name        : (indirect string, offset: 0x343e8): JOFR1
    <17a>   DW_AT_decl_file   : 5
    <17b>   DW_AT_decl_line   : 158
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xbd>
    <181>   DW_AT_data_member_location: 20
 <2><182>: Abbrev Number: 1 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x343ee): JOFR2
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 159
    <189>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xbd>
    <18e>   DW_AT_data_member_location: 24
 <2><18f>: Abbrev Number: 1 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x343f4): JOFR3
    <194>   DW_AT_decl_file   : 5
    <195>   DW_AT_decl_line   : 160
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xbd>
    <19b>   DW_AT_data_member_location: 28
 <2><19c>: Abbrev Number: 1 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0x343fa): JOFR4
    <1a1>   DW_AT_decl_file   : 5
    <1a2>   DW_AT_decl_line   : 161
    <1a3>   DW_AT_decl_column : 17
    <1a4>   DW_AT_type        : <0xbd>
    <1a8>   DW_AT_data_member_location: 32
 <2><1a9>: Abbrev Number: 5 (DW_TAG_member)
    <1aa>   DW_AT_name        : HTR
    <1ae>   DW_AT_decl_file   : 5
    <1ae>   DW_AT_decl_line   : 162
    <1af>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xbd>
    <1b3>   DW_AT_data_member_location: 36
 <2><1b4>: Abbrev Number: 5 (DW_TAG_member)
    <1b5>   DW_AT_name        : LTR
    <1b9>   DW_AT_decl_file   : 5
    <1b9>   DW_AT_decl_line   : 163
    <1ba>   DW_AT_decl_column : 17
    <1ba>   DW_AT_type        : <0xbd>
    <1be>   DW_AT_data_member_location: 40
 <2><1bf>: Abbrev Number: 1 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xc960): SQR1
    <1c4>   DW_AT_decl_file   : 5
    <1c5>   DW_AT_decl_line   : 164
    <1c6>   DW_AT_decl_column : 17
    <1c7>   DW_AT_type        : <0xbd>
    <1cb>   DW_AT_data_member_location: 44
 <2><1cc>: Abbrev Number: 1 (DW_TAG_member)
    <1cd>   DW_AT_name        : (indirect string, offset: 0xb49e): SQR2
    <1d1>   DW_AT_decl_file   : 5
    <1d2>   DW_AT_decl_line   : 165
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0xbd>
    <1d8>   DW_AT_data_member_location: 48
 <2><1d9>: Abbrev Number: 1 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0xb4a3): SQR3
    <1de>   DW_AT_decl_file   : 5
    <1df>   DW_AT_decl_line   : 166
    <1e0>   DW_AT_decl_column : 17
    <1e1>   DW_AT_type        : <0xbd>
    <1e5>   DW_AT_data_member_location: 52
 <2><1e6>: Abbrev Number: 1 (DW_TAG_member)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x75f13): JSQR
    <1eb>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 167
    <1ed>   DW_AT_decl_column : 17
    <1ee>   DW_AT_type        : <0xbd>
    <1f2>   DW_AT_data_member_location: 56
 <2><1f3>: Abbrev Number: 1 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x61658): JDR1
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 168
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0xbd>
    <1ff>   DW_AT_data_member_location: 60
 <2><200>: Abbrev Number: 1 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x6165d): JDR2
    <205>   DW_AT_decl_file   : 5
    <206>   DW_AT_decl_line   : 169
    <207>   DW_AT_decl_column : 17
    <208>   DW_AT_type        : <0xbd>
    <20c>   DW_AT_data_member_location: 64
 <2><20d>: Abbrev Number: 1 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x61662): JDR3
    <212>   DW_AT_decl_file   : 5
    <213>   DW_AT_decl_line   : 170
    <214>   DW_AT_decl_column : 17
    <215>   DW_AT_type        : <0xbd>
    <219>   DW_AT_data_member_location: 68
 <2><21a>: Abbrev Number: 1 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x284f9): JDR4
    <21f>   DW_AT_decl_file   : 5
    <220>   DW_AT_decl_line   : 171
    <221>   DW_AT_decl_column : 17
    <222>   DW_AT_type        : <0xbd>
    <226>   DW_AT_data_member_location: 72
 <2><227>: Abbrev Number: 5 (DW_TAG_member)
    <228>   DW_AT_name        : DR
    <22b>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 172
    <22c>   DW_AT_decl_column : 17
    <22c>   DW_AT_type        : <0xbd>
    <230>   DW_AT_data_member_location: 76
 <2><231>: Abbrev Number: 0
 <1><232>: Abbrev Number: 2 (DW_TAG_typedef)
    <233>   DW_AT_name        : (indirect string, offset: 0x75e12): ADC_TypeDef
    <237>   DW_AT_decl_file   : 5
    <238>   DW_AT_decl_line   : 173
    <239>   DW_AT_decl_column : 3
    <23a>   DW_AT_type        : <0x133>
 <1><23e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <23f>   DW_AT_byte_size   : 24
    <240>   DW_AT_decl_file   : 5
    <241>   DW_AT_decl_line   : 213
    <242>   DW_AT_decl_column : 9
    <242>   DW_AT_sibling     : <0x28e>
 <2><246>: Abbrev Number: 5 (DW_TAG_member)
    <247>   DW_AT_name        : CR
    <24a>   DW_AT_decl_file   : 5
    <24a>   DW_AT_decl_line   : 215
    <24b>   DW_AT_decl_column : 17
    <24b>   DW_AT_type        : <0xbd>
    <24f>   DW_AT_data_member_location: 0
 <2><250>: Abbrev Number: 1 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0x4a59e): NDTR
    <255>   DW_AT_decl_file   : 5
    <256>   DW_AT_decl_line   : 216
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xbd>
    <25c>   DW_AT_data_member_location: 4
 <2><25d>: Abbrev Number: 5 (DW_TAG_member)
    <25e>   DW_AT_name        : PAR
    <262>   DW_AT_decl_file   : 5
    <262>   DW_AT_decl_line   : 217
    <263>   DW_AT_decl_column : 17
    <263>   DW_AT_type        : <0xbd>
    <267>   DW_AT_data_member_location: 8
 <2><268>: Abbrev Number: 1 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x3e899): M0AR
    <26d>   DW_AT_decl_file   : 5
    <26e>   DW_AT_decl_line   : 218
    <26f>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xbd>
    <274>   DW_AT_data_member_location: 12
 <2><275>: Abbrev Number: 1 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0xddb2): M1AR
    <27a>   DW_AT_decl_file   : 5
    <27b>   DW_AT_decl_line   : 219
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xbd>
    <281>   DW_AT_data_member_location: 16
 <2><282>: Abbrev Number: 5 (DW_TAG_member)
    <283>   DW_AT_name        : FCR
    <287>   DW_AT_decl_file   : 5
    <287>   DW_AT_decl_line   : 220
    <288>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xbd>
    <28c>   DW_AT_data_member_location: 20
 <2><28d>: Abbrev Number: 0
 <1><28e>: Abbrev Number: 2 (DW_TAG_typedef)
    <28f>   DW_AT_name        : (indirect string, offset: 0x8ba8b): DMA_Stream_TypeDef
    <293>   DW_AT_decl_file   : 5
    <294>   DW_AT_decl_line   : 221
    <295>   DW_AT_decl_column : 3
    <296>   DW_AT_type        : <0x23e>
 <1><29a>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <29b>   DW_AT_encoding    : 7	(unsigned)
    <29c>   DW_AT_byte_size   : 1
    <29d>   DW_AT_type        : <0x3d>
    <2a1>   DW_AT_decl_file   : 6
    <2a2>   DW_AT_decl_line   : 191
    <2a3>   DW_AT_decl_column : 1
    <2a4>   DW_AT_sibling     : <0x2b5>
 <2><2a8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x47f1a): DISABLE
    <2ad>   DW_AT_const_value : 0
 <2><2ae>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2af>   DW_AT_name        : (indirect string, offset: 0x8bf85): ENABLE
    <2b3>   DW_AT_const_value : 1
 <2><2b4>: Abbrev Number: 0
 <1><2b5>: Abbrev Number: 2 (DW_TAG_typedef)
    <2b6>   DW_AT_name        : (indirect string, offset: 0x98971): FunctionalState
    <2ba>   DW_AT_decl_file   : 6
    <2bb>   DW_AT_decl_line   : 194
    <2bc>   DW_AT_decl_column : 3
    <2bd>   DW_AT_type        : <0x29a>
 <1><2c1>: Abbrev Number: 4 (DW_TAG_base_type)
    <2c2>   DW_AT_byte_size   : 8
    <2c3>   DW_AT_encoding    : 4	(float)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x7e29e): long double
 <1><2c8>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <2c9>   DW_AT_encoding    : 7	(unsigned)
    <2ca>   DW_AT_byte_size   : 1
    <2cb>   DW_AT_type        : <0x3d>
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 39
    <2d1>   DW_AT_decl_column : 1
    <2d2>   DW_AT_sibling     : <0x2ef>
 <2><2d6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x3300e): HAL_OK
    <2db>   DW_AT_const_value : 0
 <2><2dc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2dd>   DW_AT_name        : (indirect string, offset: 0x5ef2a): HAL_ERROR
    <2e1>   DW_AT_const_value : 1
 <2><2e2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x80724): HAL_BUSY
    <2e7>   DW_AT_const_value : 2
 <2><2e8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x2c349): HAL_TIMEOUT
    <2ed>   DW_AT_const_value : 3
 <2><2ee>: Abbrev Number: 0
 <1><2ef>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x89dc3): HAL_StatusTypeDef
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 44
    <2f6>   DW_AT_decl_column : 3
    <2f7>   DW_AT_type        : <0x2c8>
 <1><2fb>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <2fc>   DW_AT_encoding    : 7	(unsigned)
    <2fd>   DW_AT_byte_size   : 1
    <2fe>   DW_AT_type        : <0x3d>
    <302>   DW_AT_decl_file   : 7
    <303>   DW_AT_decl_line   : 50
    <304>   DW_AT_decl_column : 1
    <305>   DW_AT_sibling     : <0x316>
 <2><309>: Abbrev Number: 3 (DW_TAG_enumerator)
    <30a>   DW_AT_name        : (indirect string, offset: 0x718bb): HAL_UNLOCKED
    <30e>   DW_AT_const_value : 0
 <2><30f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <310>   DW_AT_name        : (indirect string, offset: 0x992e3): HAL_LOCKED
    <314>   DW_AT_const_value : 1
 <2><315>: Abbrev Number: 0
 <1><316>: Abbrev Number: 2 (DW_TAG_typedef)
    <317>   DW_AT_name        : (indirect string, offset: 0x5c7e2): HAL_LockTypeDef
    <31b>   DW_AT_decl_file   : 7
    <31c>   DW_AT_decl_line   : 53
    <31d>   DW_AT_decl_column : 3
    <31e>   DW_AT_type        : <0x2fb>
 <1><322>: Abbrev Number: 9 (DW_TAG_structure_type)
    <323>   DW_AT_byte_size   : 48
    <324>   DW_AT_decl_file   : 8
    <325>   DW_AT_decl_line   : 48
    <326>   DW_AT_decl_column : 9
    <326>   DW_AT_sibling     : <0x3c7>
 <2><32a>: Abbrev Number: 1 (DW_TAG_member)
    <32b>   DW_AT_name        : (indirect string, offset: 0x9a04a): Channel
    <32f>   DW_AT_decl_file   : 8
    <330>   DW_AT_decl_line   : 50
    <331>   DW_AT_decl_column : 12
    <332>   DW_AT_type        : <0xb1>
    <336>   DW_AT_data_member_location: 0
 <2><337>: Abbrev Number: 1 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0x8a68f): Direction
    <33c>   DW_AT_decl_file   : 8
    <33d>   DW_AT_decl_line   : 53
    <33e>   DW_AT_decl_column : 12
    <33f>   DW_AT_type        : <0xb1>
    <343>   DW_AT_data_member_location: 4
 <2><344>: Abbrev Number: 1 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0xa018): PeriphInc
    <349>   DW_AT_decl_file   : 8
    <34a>   DW_AT_decl_line   : 57
    <34b>   DW_AT_decl_column : 12
    <34c>   DW_AT_type        : <0xb1>
    <350>   DW_AT_data_member_location: 8
 <2><351>: Abbrev Number: 1 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0x178d8): MemInc
    <356>   DW_AT_decl_file   : 8
    <357>   DW_AT_decl_line   : 60
    <358>   DW_AT_decl_column : 12
    <359>   DW_AT_type        : <0xb1>
    <35d>   DW_AT_data_member_location: 12
 <2><35e>: Abbrev Number: 1 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x4baba): PeriphDataAlignment
    <363>   DW_AT_decl_file   : 8
    <364>   DW_AT_decl_line   : 63
    <365>   DW_AT_decl_column : 12
    <366>   DW_AT_type        : <0xb1>
    <36a>   DW_AT_data_member_location: 16
 <2><36b>: Abbrev Number: 1 (DW_TAG_member)
    <36c>   DW_AT_name        : (indirect string, offset: 0x8ae8c): MemDataAlignment
    <370>   DW_AT_decl_file   : 8
    <371>   DW_AT_decl_line   : 66
    <372>   DW_AT_decl_column : 12
    <373>   DW_AT_type        : <0xb1>
    <377>   DW_AT_data_member_location: 20
 <2><378>: Abbrev Number: 1 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0xa1564): Mode
    <37d>   DW_AT_decl_file   : 8
    <37e>   DW_AT_decl_line   : 69
    <37f>   DW_AT_decl_column : 12
    <380>   DW_AT_type        : <0xb1>
    <384>   DW_AT_data_member_location: 24
 <2><385>: Abbrev Number: 1 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0xa2191): Priority
    <38a>   DW_AT_decl_file   : 8
    <38b>   DW_AT_decl_line   : 74
    <38c>   DW_AT_decl_column : 12
    <38d>   DW_AT_type        : <0xb1>
    <391>   DW_AT_data_member_location: 28
 <2><392>: Abbrev Number: 1 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0x40e92): FIFOMode
    <397>   DW_AT_decl_file   : 8
    <398>   DW_AT_decl_line   : 77
    <399>   DW_AT_decl_column : 12
    <39a>   DW_AT_type        : <0xb1>
    <39e>   DW_AT_data_member_location: 32
 <2><39f>: Abbrev Number: 1 (DW_TAG_member)
    <3a0>   DW_AT_name        : (indirect string, offset: 0x74db8): FIFOThreshold
    <3a4>   DW_AT_decl_file   : 8
    <3a5>   DW_AT_decl_line   : 82
    <3a6>   DW_AT_decl_column : 12
    <3a7>   DW_AT_type        : <0xb1>
    <3ab>   DW_AT_data_member_location: 36
 <2><3ac>: Abbrev Number: 1 (DW_TAG_member)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x3bc69): MemBurst
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 85
    <3b3>   DW_AT_decl_column : 12
    <3b4>   DW_AT_type        : <0xb1>
    <3b8>   DW_AT_data_member_location: 40
 <2><3b9>: Abbrev Number: 1 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x33c81): PeriphBurst
    <3be>   DW_AT_decl_file   : 8
    <3bf>   DW_AT_decl_line   : 91
    <3c0>   DW_AT_decl_column : 12
    <3c1>   DW_AT_type        : <0xb1>
    <3c5>   DW_AT_data_member_location: 44
 <2><3c6>: Abbrev Number: 0
 <1><3c7>: Abbrev Number: 2 (DW_TAG_typedef)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x28c05): DMA_InitTypeDef
    <3cc>   DW_AT_decl_file   : 8
    <3cd>   DW_AT_decl_line   : 96
    <3ce>   DW_AT_decl_column : 2
    <3cf>   DW_AT_type        : <0x322>
 <1><3d3>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <3d4>   DW_AT_encoding    : 7	(unsigned)
    <3d5>   DW_AT_byte_size   : 1
    <3d6>   DW_AT_type        : <0x3d>
    <3da>   DW_AT_decl_file   : 8
    <3db>   DW_AT_decl_line   : 103
    <3dc>   DW_AT_decl_column : 1
    <3dd>   DW_AT_sibling     : <0x406>
 <2><3e1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x72a46): HAL_DMA_STATE_RESET
    <3e6>   DW_AT_const_value : 0
 <2><3e7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x29b4e): HAL_DMA_STATE_READY
    <3ec>   DW_AT_const_value : 1
 <2><3ed>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x69709): HAL_DMA_STATE_BUSY
    <3f2>   DW_AT_const_value : 2
 <2><3f3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x970a3): HAL_DMA_STATE_TIMEOUT
    <3f8>   DW_AT_const_value : 3
 <2><3f9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x83773): HAL_DMA_STATE_ERROR
    <3fe>   DW_AT_const_value : 4
 <2><3ff>: Abbrev Number: 3 (DW_TAG_enumerator)
    <400>   DW_AT_name        : (indirect string, offset: 0x227f7): HAL_DMA_STATE_ABORT
    <404>   DW_AT_const_value : 5
 <2><405>: Abbrev Number: 0
 <1><406>: Abbrev Number: 2 (DW_TAG_typedef)
    <407>   DW_AT_name        : (indirect string, offset: 0x5425d): HAL_DMA_StateTypeDef
    <40b>   DW_AT_decl_file   : 8
    <40c>   DW_AT_decl_line   : 110
    <40d>   DW_AT_decl_column : 2
    <40e>   DW_AT_type        : <0x3d3>
 <1><412>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <413>   DW_AT_type        : <0x406>
 <1><417>: Abbrev Number: 19 (DW_TAG_structure_type)
    <418>   DW_AT_name        : (indirect string, offset: 0x82ba6): __DMA_HandleTypeDef
    <41c>   DW_AT_byte_size   : 96
    <41d>   DW_AT_decl_file   : 8
    <41e>   DW_AT_decl_line   : 138
    <41f>   DW_AT_decl_column : 16
    <420>   DW_AT_sibling     : <0x4db>
 <2><424>: Abbrev Number: 1 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <429>   DW_AT_decl_file   : 8
    <42a>   DW_AT_decl_line   : 140
    <42b>   DW_AT_decl_column : 31
    <42c>   DW_AT_type        : <0x4db>
    <430>   DW_AT_data_member_location: 0
 <2><431>: Abbrev Number: 1 (DW_TAG_member)
    <432>   DW_AT_name        : (indirect string, offset: 0x9ef99): Init
    <436>   DW_AT_decl_file   : 8
    <437>   DW_AT_decl_line   : 142
    <438>   DW_AT_decl_column : 30
    <439>   DW_AT_type        : <0x3c7>
    <43d>   DW_AT_data_member_location: 4
 <2><43e>: Abbrev Number: 1 (DW_TAG_member)
    <43f>   DW_AT_name        : (indirect string, offset: 0x6ce85): Lock
    <443>   DW_AT_decl_file   : 8
    <444>   DW_AT_decl_line   : 144
    <445>   DW_AT_decl_column : 30
    <446>   DW_AT_type        : <0x316>
    <44a>   DW_AT_data_member_location: 52
 <2><44b>: Abbrev Number: 1 (DW_TAG_member)
    <44c>   DW_AT_name        : (indirect string, offset: 0x9f07e): State
    <450>   DW_AT_decl_file   : 8
    <451>   DW_AT_decl_line   : 146
    <452>   DW_AT_decl_column : 30
    <453>   DW_AT_type        : <0x412>
    <457>   DW_AT_data_member_location: 53
 <2><458>: Abbrev Number: 1 (DW_TAG_member)
    <459>   DW_AT_name        : (indirect string, offset: 0x920e1): Parent
    <45d>   DW_AT_decl_file   : 8
    <45e>   DW_AT_decl_line   : 148
    <45f>   DW_AT_decl_column : 31
    <460>   DW_AT_type        : <0x4e0>
    <464>   DW_AT_data_member_location: 56
 <2><465>: Abbrev Number: 1 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0x98b66): XferCpltCallback
    <46a>   DW_AT_decl_file   : 8
    <46b>   DW_AT_decl_line   : 150
    <46c>   DW_AT_decl_column : 33
    <46d>   DW_AT_type        : <0x4f2>
    <471>   DW_AT_data_member_location: 60
 <2><472>: Abbrev Number: 1 (DW_TAG_member)
    <473>   DW_AT_name        : (indirect string, offset: 0x77583): XferHalfCpltCallback
    <477>   DW_AT_decl_file   : 8
    <478>   DW_AT_decl_line   : 152
    <479>   DW_AT_decl_column : 33
    <47a>   DW_AT_type        : <0x4f2>
    <47e>   DW_AT_data_member_location: 64
 <2><47f>: Abbrev Number: 1 (DW_TAG_member)
    <480>   DW_AT_name        : (indirect string, offset: 0x2421b): XferM1CpltCallback
    <484>   DW_AT_decl_file   : 8
    <485>   DW_AT_decl_line   : 154
    <486>   DW_AT_decl_column : 33
    <487>   DW_AT_type        : <0x4f2>
    <48b>   DW_AT_data_member_location: 68
 <2><48c>: Abbrev Number: 1 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0x5443e): XferM1HalfCpltCallback
    <491>   DW_AT_decl_file   : 8
    <492>   DW_AT_decl_line   : 156
    <493>   DW_AT_decl_column : 33
    <494>   DW_AT_type        : <0x4f2>
    <498>   DW_AT_data_member_location: 72
 <2><499>: Abbrev Number: 1 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x15c13): XferErrorCallback
    <49e>   DW_AT_decl_file   : 8
    <49f>   DW_AT_decl_line   : 158
    <4a0>   DW_AT_decl_column : 33
    <4a1>   DW_AT_type        : <0x4f2>
    <4a5>   DW_AT_data_member_location: 76
 <2><4a6>: Abbrev Number: 1 (DW_TAG_member)
    <4a7>   DW_AT_name        : (indirect string, offset: 0x8f71e): XferAbortCallback
    <4ab>   DW_AT_decl_file   : 8
    <4ac>   DW_AT_decl_line   : 160
    <4ad>   DW_AT_decl_column : 33
    <4ae>   DW_AT_type        : <0x4f2>
    <4b2>   DW_AT_data_member_location: 80
 <2><4b3>: Abbrev Number: 1 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x96268): ErrorCode
    <4b8>   DW_AT_decl_file   : 8
    <4b9>   DW_AT_decl_line   : 162
    <4ba>   DW_AT_decl_column : 30
    <4bb>   DW_AT_type        : <0xbd>
    <4bf>   DW_AT_data_member_location: 84
 <2><4c0>: Abbrev Number: 1 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x74143): StreamBaseAddress
    <4c5>   DW_AT_decl_file   : 8
    <4c6>   DW_AT_decl_line   : 164
    <4c7>   DW_AT_decl_column : 30
    <4c8>   DW_AT_type        : <0xb1>
    <4cc>   DW_AT_data_member_location: 88
 <2><4cd>: Abbrev Number: 1 (DW_TAG_member)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x813dd): StreamIndex
    <4d2>   DW_AT_decl_file   : 8
    <4d3>   DW_AT_decl_line   : 166
    <4d4>   DW_AT_decl_column : 30
    <4d5>   DW_AT_type        : <0xb1>
    <4d9>   DW_AT_data_member_location: 92
 <2><4da>: Abbrev Number: 0
 <1><4db>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4dc>   DW_AT_byte_size   : 4
    <4dc>   DW_AT_type        : <0x28e>
 <1><4e0>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <4e1>   DW_AT_byte_size   : 4
 <1><4e2>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <4e3>   DW_AT_prototyped  : 1
    <4e3>   DW_AT_sibling     : <0x4ed>
 <2><4e7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <4e8>   DW_AT_type        : <0x4ed>
 <2><4ec>: Abbrev Number: 0
 <1><4ed>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4ee>   DW_AT_byte_size   : 4
    <4ee>   DW_AT_type        : <0x417>
 <1><4f2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4f3>   DW_AT_byte_size   : 4
    <4f3>   DW_AT_type        : <0x4e2>
 <1><4f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x82ba8): DMA_HandleTypeDef
    <4fc>   DW_AT_decl_file   : 8
    <4fd>   DW_AT_decl_line   : 168
    <4fe>   DW_AT_decl_column : 2
    <4ff>   DW_AT_type        : <0x417>
 <1><503>: Abbrev Number: 9 (DW_TAG_structure_type)
    <504>   DW_AT_byte_size   : 48
    <505>   DW_AT_decl_file   : 9
    <506>   DW_AT_decl_line   : 59
    <507>   DW_AT_decl_column : 9
    <507>   DW_AT_sibling     : <0x5a8>
 <2><50b>: Abbrev Number: 1 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x87ab6): ClockPrescaler
    <510>   DW_AT_decl_file   : 9
    <511>   DW_AT_decl_line   : 61
    <512>   DW_AT_decl_column : 12
    <513>   DW_AT_type        : <0xb1>
    <517>   DW_AT_data_member_location: 0
 <2><518>: Abbrev Number: 1 (DW_TAG_member)
    <519>   DW_AT_name        : (indirect string, offset: 0xbfc6): Resolution
    <51d>   DW_AT_decl_file   : 9
    <51e>   DW_AT_decl_line   : 64
    <51f>   DW_AT_decl_column : 12
    <520>   DW_AT_type        : <0xb1>
    <524>   DW_AT_data_member_location: 4
 <2><525>: Abbrev Number: 1 (DW_TAG_member)
    <526>   DW_AT_name        : (indirect string, offset: 0x20ed8): DataAlign
    <52a>   DW_AT_decl_file   : 9
    <52b>   DW_AT_decl_line   : 66
    <52c>   DW_AT_decl_column : 12
    <52d>   DW_AT_type        : <0xb1>
    <531>   DW_AT_data_member_location: 8
 <2><532>: Abbrev Number: 1 (DW_TAG_member)
    <533>   DW_AT_name        : (indirect string, offset: 0x5b681): ScanConvMode
    <537>   DW_AT_decl_file   : 9
    <538>   DW_AT_decl_line   : 69
    <539>   DW_AT_decl_column : 12
    <53a>   DW_AT_type        : <0xb1>
    <53e>   DW_AT_data_member_location: 12
 <2><53f>: Abbrev Number: 1 (DW_TAG_member)
    <540>   DW_AT_name        : (indirect string, offset: 0x65580): EOCSelection
    <544>   DW_AT_decl_file   : 9
    <545>   DW_AT_decl_line   : 76
    <546>   DW_AT_decl_column : 12
    <547>   DW_AT_type        : <0xb1>
    <54b>   DW_AT_data_member_location: 16
 <2><54c>: Abbrev Number: 1 (DW_TAG_member)
    <54d>   DW_AT_name        : (indirect string, offset: 0x3f0e4): ContinuousConvMode
    <551>   DW_AT_decl_file   : 9
    <552>   DW_AT_decl_line   : 83
    <553>   DW_AT_decl_column : 19
    <554>   DW_AT_type        : <0x2b5>
    <558>   DW_AT_data_member_location: 20
 <2><559>: Abbrev Number: 1 (DW_TAG_member)
    <55a>   DW_AT_name        : (indirect string, offset: 0x5af71): NbrOfConversion
    <55e>   DW_AT_decl_file   : 9
    <55f>   DW_AT_decl_line   : 86
    <560>   DW_AT_decl_column : 12
    <561>   DW_AT_type        : <0xb1>
    <565>   DW_AT_data_member_location: 24
 <2><566>: Abbrev Number: 1 (DW_TAG_member)
    <567>   DW_AT_name        : (indirect string, offset: 0x39d1b): DiscontinuousConvMode
    <56b>   DW_AT_decl_file   : 9
    <56c>   DW_AT_decl_line   : 89
    <56d>   DW_AT_decl_column : 19
    <56e>   DW_AT_type        : <0x2b5>
    <572>   DW_AT_data_member_location: 28
 <2><573>: Abbrev Number: 1 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0x15ac7): NbrOfDiscConversion
    <578>   DW_AT_decl_file   : 9
    <579>   DW_AT_decl_line   : 93
    <57a>   DW_AT_decl_column : 12
    <57b>   DW_AT_type        : <0xb1>
    <57f>   DW_AT_data_member_location: 32
 <2><580>: Abbrev Number: 1 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0x6e51d): ExternalTrigConv
    <585>   DW_AT_decl_file   : 9
    <586>   DW_AT_decl_line   : 96
    <587>   DW_AT_decl_column : 12
    <588>   DW_AT_type        : <0xb1>
    <58c>   DW_AT_data_member_location: 36
 <2><58d>: Abbrev Number: 1 (DW_TAG_member)
    <58e>   DW_AT_name        : (indirect string, offset: 0x297e3): ExternalTrigConvEdge
    <592>   DW_AT_decl_file   : 9
    <593>   DW_AT_decl_line   : 100
    <594>   DW_AT_decl_column : 12
    <595>   DW_AT_type        : <0xb1>
    <599>   DW_AT_data_member_location: 40
 <2><59a>: Abbrev Number: 1 (DW_TAG_member)
    <59b>   DW_AT_name        : (indirect string, offset: 0x3bf49): DMAContinuousRequests
    <59f>   DW_AT_decl_file   : 9
    <5a0>   DW_AT_decl_line   : 103
    <5a1>   DW_AT_decl_column : 19
    <5a2>   DW_AT_type        : <0x2b5>
    <5a6>   DW_AT_data_member_location: 44
 <2><5a7>: Abbrev Number: 0
 <1><5a8>: Abbrev Number: 2 (DW_TAG_typedef)
    <5a9>   DW_AT_name        : (indirect string, offset: 0x237b6): ADC_InitTypeDef
    <5ad>   DW_AT_decl_file   : 9
    <5ae>   DW_AT_decl_line   : 108
    <5af>   DW_AT_decl_column : 3
    <5b0>   DW_AT_type        : <0x503>
 <1><5b4>: Abbrev Number: 9 (DW_TAG_structure_type)
    <5b5>   DW_AT_byte_size   : 72
    <5b6>   DW_AT_decl_file   : 9
    <5b7>   DW_AT_decl_line   : 195
    <5b8>   DW_AT_decl_column : 9
    <5b8>   DW_AT_sibling     : <0x618>
 <2><5bc>: Abbrev Number: 1 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <5c1>   DW_AT_decl_file   : 9
    <5c2>   DW_AT_decl_line   : 198
    <5c3>   DW_AT_decl_column : 34
    <5c4>   DW_AT_type        : <0x618>
    <5c8>   DW_AT_data_member_location: 0
 <2><5c9>: Abbrev Number: 1 (DW_TAG_member)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x9ef99): Init
    <5ce>   DW_AT_decl_file   : 9
    <5cf>   DW_AT_decl_line   : 200
    <5d0>   DW_AT_decl_column : 33
    <5d1>   DW_AT_type        : <0x5a8>
    <5d5>   DW_AT_data_member_location: 4
 <2><5d6>: Abbrev Number: 1 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x2728e): NbrOfCurrentConversionRank
    <5db>   DW_AT_decl_file   : 9
    <5dc>   DW_AT_decl_line   : 202
    <5dd>   DW_AT_decl_column : 33
    <5de>   DW_AT_type        : <0xbd>
    <5e2>   DW_AT_data_member_location: 52
 <2><5e3>: Abbrev Number: 1 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x195b): DMA_Handle
    <5e8>   DW_AT_decl_file   : 9
    <5e9>   DW_AT_decl_line   : 204
    <5ea>   DW_AT_decl_column : 34
    <5eb>   DW_AT_type        : <0x61d>
    <5ef>   DW_AT_data_member_location: 56
 <2><5f0>: Abbrev Number: 1 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x6ce85): Lock
    <5f5>   DW_AT_decl_file   : 9
    <5f6>   DW_AT_decl_line   : 206
    <5f7>   DW_AT_decl_column : 33
    <5f8>   DW_AT_type        : <0x316>
    <5fc>   DW_AT_data_member_location: 60
 <2><5fd>: Abbrev Number: 1 (DW_TAG_member)
    <5fe>   DW_AT_name        : (indirect string, offset: 0x9f07e): State
    <602>   DW_AT_decl_file   : 9
    <603>   DW_AT_decl_line   : 208
    <604>   DW_AT_decl_column : 33
    <605>   DW_AT_type        : <0xbd>
    <609>   DW_AT_data_member_location: 64
 <2><60a>: Abbrev Number: 1 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x96268): ErrorCode
    <60f>   DW_AT_decl_file   : 9
    <610>   DW_AT_decl_line   : 210
    <611>   DW_AT_decl_column : 33
    <612>   DW_AT_type        : <0xbd>
    <616>   DW_AT_data_member_location: 68
 <2><617>: Abbrev Number: 0
 <1><618>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <619>   DW_AT_byte_size   : 4
    <619>   DW_AT_type        : <0x232>
 <1><61d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <61e>   DW_AT_byte_size   : 4
    <61e>   DW_AT_type        : <0x4f7>
 <1><622>: Abbrev Number: 2 (DW_TAG_typedef)
    <623>   DW_AT_name        : (indirect string, offset: 0x1e318): ADC_HandleTypeDef
    <627>   DW_AT_decl_file   : 9
    <628>   DW_AT_decl_line   : 220
    <629>   DW_AT_decl_column : 3
    <62a>   DW_AT_type        : <0x5b4>
 <1><62e>: Abbrev Number: 13 (DW_TAG_variable)
    <62f>   DW_AT_name        : (indirect string, offset: 0x3d723): hadc1
    <633>   DW_AT_decl_file   : 10
    <634>   DW_AT_decl_line   : 35
    <635>   DW_AT_decl_column : 26
    <636>   DW_AT_type        : <0x622>
    <63a>   DW_AT_external    : 1
    <63a>   DW_AT_declaration : 1
 <1><63a>: Abbrev Number: 4 (DW_TAG_base_type)
    <63b>   DW_AT_byte_size   : 1
    <63c>   DW_AT_encoding    : 8	(unsigned char)
    <63d>   DW_AT_name        : (indirect string, offset: 0x30e5f): char
 <1><641>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <642>   DW_AT_encoding    : 5	(signed)
    <643>   DW_AT_byte_size   : 4
    <644>   DW_AT_type        : <0x86>
    <648>   DW_AT_decl_file   : 11
    <649>   DW_AT_decl_line   : 176
    <64a>   DW_AT_decl_column : 14
    <64b>   DW_AT_sibling     : <0x683>
 <2><64f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <650>   DW_AT_name        : (indirect string, offset: 0x87e85): osOK
    <654>   DW_AT_const_value : 0
 <2><655>: Abbrev Number: 10 (DW_TAG_enumerator)
    <656>   DW_AT_name        : (indirect string, offset: 0x45c7a): osError
    <65a>   DW_AT_const_value : -1
 <2><65b>: Abbrev Number: 10 (DW_TAG_enumerator)
    <65c>   DW_AT_name        : (indirect string, offset: 0x15ab8): osErrorTimeout
    <660>   DW_AT_const_value : -2
 <2><661>: Abbrev Number: 10 (DW_TAG_enumerator)
    <662>   DW_AT_name        : (indirect string, offset: 0x631c2): osErrorResource
    <666>   DW_AT_const_value : -3
 <2><667>: Abbrev Number: 10 (DW_TAG_enumerator)
    <668>   DW_AT_name        : (indirect string, offset: 0x276ea): osErrorParameter
    <66c>   DW_AT_const_value : -4
 <2><66d>: Abbrev Number: 10 (DW_TAG_enumerator)
    <66e>   DW_AT_name        : (indirect string, offset: 0x1a2c4): osErrorNoMemory
    <672>   DW_AT_const_value : -5
 <2><673>: Abbrev Number: 10 (DW_TAG_enumerator)
    <674>   DW_AT_name        : (indirect string, offset: 0x28f14): osErrorISR
    <678>   DW_AT_const_value : -6
 <2><679>: Abbrev Number: 22 (DW_TAG_enumerator)
    <67a>   DW_AT_name        : (indirect string, offset: 0x4cc31): osStatusReserved
    <67e>   DW_AT_const_value : 0x7fffffff
 <2><682>: Abbrev Number: 0
 <1><683>: Abbrev Number: 2 (DW_TAG_typedef)
    <684>   DW_AT_name        : (indirect string, offset: 0x33983): osStatus_t
    <688>   DW_AT_decl_file   : 11
    <689>   DW_AT_decl_line   : 185
    <68a>   DW_AT_decl_column : 3
    <68b>   DW_AT_type        : <0x641>
 <1><68f>: Abbrev Number: 2 (DW_TAG_typedef)
    <690>   DW_AT_name        : (indirect string, offset: 0x43e0b): osMessageQueueId_t
    <694>   DW_AT_decl_file   : 11
    <695>   DW_AT_decl_line   : 207
    <696>   DW_AT_decl_column : 15
    <697>   DW_AT_type        : <0x4e0>
 <1><69b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <69c>   DW_AT_byte_size   : 4
    <69c>   DW_AT_type        : <0x6a0>
 <1><6a0>: Abbrev Number: 23 (DW_TAG_const_type)
 <1><6a1>: Abbrev Number: 13 (DW_TAG_variable)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x74458): adcQueueHandle
    <6a6>   DW_AT_decl_file   : 1
    <6a7>   DW_AT_decl_line   : 12
    <6a8>   DW_AT_decl_column : 27
    <6a9>   DW_AT_type        : <0x68f>
    <6ad>   DW_AT_external    : 1
    <6ad>   DW_AT_declaration : 1
 <1><6ad>: Abbrev Number: 24 (DW_TAG_variable)
    <6ae>   DW_AT_specification: <0xd7>
    <6b2>   DW_AT_decl_file   : 1
    <6b3>   DW_AT_decl_column : 19
    <6b4>   DW_AT_location    : 5 byte block: 3 10 2 0 20 	(DW_OP_addr: 20000210)
 <1><6ba>: Abbrev Number: 8 (DW_TAG_variable)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x90876): windDirectionGain
    <6bf>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 15
    <6c0>   DW_AT_decl_column : 7
    <6c0>   DW_AT_type        : <0x120>
    <6c4>   DW_AT_external    : 1
    <6c4>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><6ca>: Abbrev Number: 8 (DW_TAG_variable)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x98b8f): windDirectionOffset
    <6cf>   DW_AT_decl_file   : 1
    <6cf>   DW_AT_decl_line   : 16
    <6d0>   DW_AT_decl_column : 7
    <6d0>   DW_AT_type        : <0x120>
    <6d4>   DW_AT_external    : 1
    <6d4>   DW_AT_location    : 5 byte block: 3 18 2 0 20 	(DW_OP_addr: 20000218)
 <1><6da>: Abbrev Number: 8 (DW_TAG_variable)
    <6db>   DW_AT_name        : (indirect string, offset: 0x76b35): batteryVoltageGain
    <6df>   DW_AT_decl_file   : 1
    <6df>   DW_AT_decl_line   : 18
    <6e0>   DW_AT_decl_column : 7
    <6e0>   DW_AT_type        : <0x120>
    <6e4>   DW_AT_external    : 1
    <6e4>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><6ea>: Abbrev Number: 8 (DW_TAG_variable)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x76ff3): batteryVoltageOffset
    <6ef>   DW_AT_decl_file   : 1
    <6ef>   DW_AT_decl_line   : 19
    <6f0>   DW_AT_decl_column : 7
    <6f0>   DW_AT_type        : <0x120>
    <6f4>   DW_AT_external    : 1
    <6f4>   DW_AT_location    : 5 byte block: 3 1c 2 0 20 	(DW_OP_addr: 2000021c)
 <1><6fa>: Abbrev Number: 8 (DW_TAG_variable)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x614bd): extra1Gain
    <6ff>   DW_AT_decl_file   : 1
    <6ff>   DW_AT_decl_line   : 21
    <700>   DW_AT_decl_column : 7
    <700>   DW_AT_type        : <0x120>
    <704>   DW_AT_external    : 1
    <704>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><70a>: Abbrev Number: 8 (DW_TAG_variable)
    <70b>   DW_AT_name        : (indirect string, offset: 0x4029): extra1Offset
    <70f>   DW_AT_decl_file   : 1
    <70f>   DW_AT_decl_line   : 22
    <710>   DW_AT_decl_column : 7
    <710>   DW_AT_type        : <0x120>
    <714>   DW_AT_external    : 1
    <714>   DW_AT_location    : 5 byte block: 3 20 2 0 20 	(DW_OP_addr: 20000220)
 <1><71a>: Abbrev Number: 8 (DW_TAG_variable)
    <71b>   DW_AT_name        : (indirect string, offset: 0x93a8d): extra2Gain
    <71f>   DW_AT_decl_file   : 1
    <71f>   DW_AT_decl_line   : 24
    <720>   DW_AT_decl_column : 7
    <720>   DW_AT_type        : <0x120>
    <724>   DW_AT_external    : 1
    <724>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <1><72a>: Abbrev Number: 8 (DW_TAG_variable)
    <72b>   DW_AT_name        : (indirect string, offset: 0x5a61f): extra2Offset
    <72f>   DW_AT_decl_file   : 1
    <72f>   DW_AT_decl_line   : 25
    <730>   DW_AT_decl_column : 7
    <730>   DW_AT_type        : <0x120>
    <734>   DW_AT_external    : 1
    <734>   DW_AT_location    : 5 byte block: 3 24 2 0 20 	(DW_OP_addr: 20000224)
 <1><73a>: Abbrev Number: 14 (DW_TAG_subprogram)
    <73b>   DW_AT_external    : 1
    <73b>   DW_AT_name        : (indirect string, offset: 0x6d5cf): osMessageQueuePut
    <73f>   DW_AT_decl_file   : 11
    <740>   DW_AT_decl_line   : 689
    <742>   DW_AT_decl_column : 12
    <743>   DW_AT_prototyped  : 1
    <743>   DW_AT_type        : <0x683>
    <747>   DW_AT_declaration : 1
    <747>   DW_AT_sibling     : <0x760>
 <2><74b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <74c>   DW_AT_type        : <0x68f>
 <2><750>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <751>   DW_AT_type        : <0x69b>
 <2><755>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <756>   DW_AT_type        : <0x94>
 <2><75a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <75b>   DW_AT_type        : <0xb1>
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 14 (DW_TAG_subprogram)
    <761>   DW_AT_external    : 1
    <761>   DW_AT_name        : (indirect string, offset: 0x99f27): HAL_ADC_Start_DMA
    <765>   DW_AT_decl_file   : 9
    <766>   DW_AT_decl_line   : 594
    <768>   DW_AT_decl_column : 19
    <769>   DW_AT_prototyped  : 1
    <769>   DW_AT_type        : <0x2ef>
    <76d>   DW_AT_declaration : 1
    <76d>   DW_AT_sibling     : <0x781>
 <2><771>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <772>   DW_AT_type        : <0x781>
 <2><776>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <777>   DW_AT_type        : <0x786>
 <2><77b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77c>   DW_AT_type        : <0xb1>
 <2><780>: Abbrev Number: 0
 <1><781>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <782>   DW_AT_byte_size   : 4
    <782>   DW_AT_type        : <0x622>
 <1><786>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <787>   DW_AT_byte_size   : 4
    <787>   DW_AT_type        : <0xb1>
 <1><78b>: Abbrev Number: 25 (DW_TAG_subprogram)
    <78c>   DW_AT_external    : 1
    <78c>   DW_AT_name        : (indirect string, offset: 0x4bf5c): adc_read
    <790>   DW_AT_decl_file   : 1
    <791>   DW_AT_decl_line   : 27
    <792>   DW_AT_decl_column : 6
    <793>   DW_AT_prototyped  : 1
    <793>   DW_AT_low_pc      : 0x8000f48
    <797>   DW_AT_high_pc     : 0xec
    <79b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <79d>   DW_AT_call_all_tail_calls: 1
 <2><79d>: Abbrev Number: 26 (DW_TAG_variable)
    <79e>   DW_AT_name        : (indirect string, offset: 0x40bd8): adcDataSent
    <7a2>   DW_AT_decl_file   : 1
    <7a3>   DW_AT_decl_line   : 32
    <7a4>   DW_AT_decl_column : 15
    <7a5>   DW_AT_type        : <0x127>
    <7a9>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><7ac>: Abbrev Number: 0
 <1><7ad>: Abbrev Number: 0
  Compilation Unit @ offset 0x7ae:
   Length:        0x6ee (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x163
   Pointer Size:  4
 <0><7ba>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <7bb>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <7bf>   DW_AT_language    : 29	(C11)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x99f69): ../Core/Src/CONTROL.c
    <7c4>   DW_AT_comp_dir    : (indirect string, offset: 0x4a233): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <7c8>   DW_AT_ranges      : 0x20
    <7cc>   DW_AT_low_pc      : 0
    <7d0>   DW_AT_stmt_list   : 0x9c3
    <7d4>   DW_AT_macros      : 0x16675
 <1><7d8>: Abbrev Number: 5 (DW_TAG_base_type)
    <7d9>   DW_AT_byte_size   : 1
    <7da>   DW_AT_encoding    : 6	(signed char)
    <7db>   DW_AT_name        : (indirect string, offset: 0x4c39b): signed char
 <1><7df>: Abbrev Number: 5 (DW_TAG_base_type)
    <7e0>   DW_AT_byte_size   : 1
    <7e1>   DW_AT_encoding    : 8	(unsigned char)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><7e6>: Abbrev Number: 4 (DW_TAG_typedef)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x9a1ae): __int16_t
    <7eb>   DW_AT_decl_file   : 2
    <7ec>   DW_AT_decl_line   : 55
    <7ed>   DW_AT_decl_column : 24
    <7ee>   DW_AT_type        : <0x7f2>
 <1><7f2>: Abbrev Number: 5 (DW_TAG_base_type)
    <7f3>   DW_AT_byte_size   : 2
    <7f4>   DW_AT_encoding    : 5	(signed)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x7278d): short int
 <1><7f9>: Abbrev Number: 4 (DW_TAG_typedef)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x7d80f): __uint16_t
    <7fe>   DW_AT_decl_file   : 2
    <7ff>   DW_AT_decl_line   : 57
    <800>   DW_AT_decl_column : 25
    <801>   DW_AT_type        : <0x805>
 <1><805>: Abbrev Number: 5 (DW_TAG_base_type)
    <806>   DW_AT_byte_size   : 2
    <807>   DW_AT_encoding    : 7	(unsigned)
    <808>   DW_AT_name        : (indirect string, offset: 0x93163): short unsigned int
 <1><80c>: Abbrev Number: 5 (DW_TAG_base_type)
    <80d>   DW_AT_byte_size   : 4
    <80e>   DW_AT_encoding    : 5	(signed)
    <80f>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><813>: Abbrev Number: 4 (DW_TAG_typedef)
    <814>   DW_AT_name        : (indirect string, offset: 0x60d58): __uint32_t
    <818>   DW_AT_decl_file   : 2
    <819>   DW_AT_decl_line   : 79
    <81a>   DW_AT_decl_column : 25
    <81b>   DW_AT_type        : <0x81f>
 <1><81f>: Abbrev Number: 5 (DW_TAG_base_type)
    <820>   DW_AT_byte_size   : 4
    <821>   DW_AT_encoding    : 7	(unsigned)
    <822>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><826>: Abbrev Number: 5 (DW_TAG_base_type)
    <827>   DW_AT_byte_size   : 8
    <828>   DW_AT_encoding    : 5	(signed)
    <829>   DW_AT_name        : (indirect string, offset: 0x44c89): long long int
 <1><82d>: Abbrev Number: 5 (DW_TAG_base_type)
    <82e>   DW_AT_byte_size   : 8
    <82f>   DW_AT_encoding    : 7	(unsigned)
    <830>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><834>: Abbrev Number: 20 (DW_TAG_base_type)
    <835>   DW_AT_byte_size   : 4
    <836>   DW_AT_encoding    : 5	(signed)
    <837>   DW_AT_name        : int
 <1><83b>: Abbrev Number: 5 (DW_TAG_base_type)
    <83c>   DW_AT_byte_size   : 4
    <83d>   DW_AT_encoding    : 7	(unsigned)
    <83e>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><842>: Abbrev Number: 4 (DW_TAG_typedef)
    <843>   DW_AT_name        : (indirect string, offset: 0x9a1b0): int16_t
    <847>   DW_AT_decl_file   : 3
    <848>   DW_AT_decl_line   : 32
    <849>   DW_AT_decl_column : 19
    <84a>   DW_AT_type        : <0x7e6>
 <1><84e>: Abbrev Number: 4 (DW_TAG_typedef)
    <84f>   DW_AT_name        : (indirect string, offset: 0x6fb41): uint16_t
    <853>   DW_AT_decl_file   : 3
    <854>   DW_AT_decl_line   : 36
    <855>   DW_AT_decl_column : 20
    <856>   DW_AT_type        : <0x7f9>
 <1><85a>: Abbrev Number: 4 (DW_TAG_typedef)
    <85b>   DW_AT_name        : (indirect string, offset: 0x6f2a1): uint32_t
    <85f>   DW_AT_decl_file   : 3
    <860>   DW_AT_decl_line   : 48
    <861>   DW_AT_decl_column : 20
    <862>   DW_AT_type        : <0x813>
 <1><866>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <867>   DW_AT_type        : <0x85a>
 <1><86b>: Abbrev Number: 5 (DW_TAG_base_type)
    <86c>   DW_AT_byte_size   : 4
    <86d>   DW_AT_encoding    : 4	(float)
    <86e>   DW_AT_name        : (indirect string, offset: 0x83cdc): float
 <1><872>: Abbrev Number: 12 (DW_TAG_structure_type)
    <873>   DW_AT_byte_size   : 24
    <874>   DW_AT_decl_file   : 4
    <875>   DW_AT_decl_line   : 213
    <876>   DW_AT_decl_column : 9
    <876>   DW_AT_sibling     : <0x8c2>
 <2><87a>: Abbrev Number: 13 (DW_TAG_member)
    <87b>   DW_AT_name        : CR
    <87e>   DW_AT_decl_file   : 4
    <87e>   DW_AT_decl_line   : 215
    <87f>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x866>
    <883>   DW_AT_data_member_location: 0
 <2><884>: Abbrev Number: 1 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0x4a59e): NDTR
    <889>   DW_AT_decl_file   : 4
    <88a>   DW_AT_decl_line   : 216
    <88b>   DW_AT_decl_column : 17
    <88c>   DW_AT_type        : <0x866>
    <890>   DW_AT_data_member_location: 4
 <2><891>: Abbrev Number: 13 (DW_TAG_member)
    <892>   DW_AT_name        : PAR
    <896>   DW_AT_decl_file   : 4
    <896>   DW_AT_decl_line   : 217
    <897>   DW_AT_decl_column : 17
    <897>   DW_AT_type        : <0x866>
    <89b>   DW_AT_data_member_location: 8
 <2><89c>: Abbrev Number: 1 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0x3e899): M0AR
    <8a1>   DW_AT_decl_file   : 4
    <8a2>   DW_AT_decl_line   : 218
    <8a3>   DW_AT_decl_column : 17
    <8a4>   DW_AT_type        : <0x866>
    <8a8>   DW_AT_data_member_location: 12
 <2><8a9>: Abbrev Number: 1 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xddb2): M1AR
    <8ae>   DW_AT_decl_file   : 4
    <8af>   DW_AT_decl_line   : 219
    <8b0>   DW_AT_decl_column : 17
    <8b1>   DW_AT_type        : <0x866>
    <8b5>   DW_AT_data_member_location: 16
 <2><8b6>: Abbrev Number: 13 (DW_TAG_member)
    <8b7>   DW_AT_name        : FCR
    <8bb>   DW_AT_decl_file   : 4
    <8bb>   DW_AT_decl_line   : 220
    <8bc>   DW_AT_decl_column : 17
    <8bc>   DW_AT_type        : <0x866>
    <8c0>   DW_AT_data_member_location: 20
 <2><8c1>: Abbrev Number: 0
 <1><8c2>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c3>   DW_AT_name        : (indirect string, offset: 0x8ba8b): DMA_Stream_TypeDef
    <8c7>   DW_AT_decl_file   : 4
    <8c8>   DW_AT_decl_line   : 221
    <8c9>   DW_AT_decl_column : 3
    <8ca>   DW_AT_type        : <0x872>
 <1><8ce>: Abbrev Number: 14 (DW_TAG_structure_type)
    <8cf>   DW_AT_byte_size   : 84
    <8d0>   DW_AT_decl_file   : 4
    <8d1>   DW_AT_decl_line   : 469
    <8d3>   DW_AT_decl_column : 9
    <8d3>   DW_AT_sibling     : <0x9e8>
 <2><8d7>: Abbrev Number: 6 (DW_TAG_member)
    <8d8>   DW_AT_name        : CR1
    <8dc>   DW_AT_decl_file   : 4
    <8dc>   DW_AT_decl_line   : 471
    <8de>   DW_AT_decl_column : 17
    <8de>   DW_AT_type        : <0x866>
    <8e2>   DW_AT_data_member_location: 0
 <2><8e3>: Abbrev Number: 6 (DW_TAG_member)
    <8e4>   DW_AT_name        : CR2
    <8e8>   DW_AT_decl_file   : 4
    <8e8>   DW_AT_decl_line   : 472
    <8ea>   DW_AT_decl_column : 17
    <8ea>   DW_AT_type        : <0x866>
    <8ee>   DW_AT_data_member_location: 4
 <2><8ef>: Abbrev Number: 3 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x2c40c): SMCR
    <8f4>   DW_AT_decl_file   : 4
    <8f5>   DW_AT_decl_line   : 473
    <8f7>   DW_AT_decl_column : 17
    <8f8>   DW_AT_type        : <0x866>
    <8fc>   DW_AT_data_member_location: 8
 <2><8fd>: Abbrev Number: 3 (DW_TAG_member)
    <8fe>   DW_AT_name        : (indirect string, offset: 0x30c78): DIER
    <902>   DW_AT_decl_file   : 4
    <903>   DW_AT_decl_line   : 474
    <905>   DW_AT_decl_column : 17
    <906>   DW_AT_type        : <0x866>
    <90a>   DW_AT_data_member_location: 12
 <2><90b>: Abbrev Number: 6 (DW_TAG_member)
    <90c>   DW_AT_name        : SR
    <90f>   DW_AT_decl_file   : 4
    <90f>   DW_AT_decl_line   : 475
    <911>   DW_AT_decl_column : 17
    <911>   DW_AT_type        : <0x866>
    <915>   DW_AT_data_member_location: 16
 <2><916>: Abbrev Number: 6 (DW_TAG_member)
    <917>   DW_AT_name        : EGR
    <91b>   DW_AT_decl_file   : 4
    <91b>   DW_AT_decl_line   : 476
    <91d>   DW_AT_decl_column : 17
    <91d>   DW_AT_type        : <0x866>
    <921>   DW_AT_data_member_location: 20
 <2><922>: Abbrev Number: 3 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0x8c54b): CCMR1
    <927>   DW_AT_decl_file   : 4
    <928>   DW_AT_decl_line   : 477
    <92a>   DW_AT_decl_column : 17
    <92b>   DW_AT_type        : <0x866>
    <92f>   DW_AT_data_member_location: 24
 <2><930>: Abbrev Number: 3 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x3c1c3): CCMR2
    <935>   DW_AT_decl_file   : 4
    <936>   DW_AT_decl_line   : 478
    <938>   DW_AT_decl_column : 17
    <939>   DW_AT_type        : <0x866>
    <93d>   DW_AT_data_member_location: 28
 <2><93e>: Abbrev Number: 3 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0x1faae): CCER
    <943>   DW_AT_decl_file   : 4
    <944>   DW_AT_decl_line   : 479
    <946>   DW_AT_decl_column : 17
    <947>   DW_AT_type        : <0x866>
    <94b>   DW_AT_data_member_location: 32
 <2><94c>: Abbrev Number: 6 (DW_TAG_member)
    <94d>   DW_AT_name        : CNT
    <951>   DW_AT_decl_file   : 4
    <951>   DW_AT_decl_line   : 480
    <953>   DW_AT_decl_column : 17
    <953>   DW_AT_type        : <0x866>
    <957>   DW_AT_data_member_location: 36
 <2><958>: Abbrev Number: 6 (DW_TAG_member)
    <959>   DW_AT_name        : PSC
    <95d>   DW_AT_decl_file   : 4
    <95d>   DW_AT_decl_line   : 481
    <95f>   DW_AT_decl_column : 17
    <95f>   DW_AT_type        : <0x866>
    <963>   DW_AT_data_member_location: 40
 <2><964>: Abbrev Number: 6 (DW_TAG_member)
    <965>   DW_AT_name        : ARR
    <969>   DW_AT_decl_file   : 4
    <969>   DW_AT_decl_line   : 482
    <96b>   DW_AT_decl_column : 17
    <96b>   DW_AT_type        : <0x866>
    <96f>   DW_AT_data_member_location: 44
 <2><970>: Abbrev Number: 6 (DW_TAG_member)
    <971>   DW_AT_name        : RCR
    <975>   DW_AT_decl_file   : 4
    <975>   DW_AT_decl_line   : 483
    <977>   DW_AT_decl_column : 17
    <977>   DW_AT_type        : <0x866>
    <97b>   DW_AT_data_member_location: 48
 <2><97c>: Abbrev Number: 3 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0x118c7): CCR1
    <981>   DW_AT_decl_file   : 4
    <982>   DW_AT_decl_line   : 484
    <984>   DW_AT_decl_column : 17
    <985>   DW_AT_type        : <0x866>
    <989>   DW_AT_data_member_location: 52
 <2><98a>: Abbrev Number: 3 (DW_TAG_member)
    <98b>   DW_AT_name        : (indirect string, offset: 0x3f064): CCR2
    <98f>   DW_AT_decl_file   : 4
    <990>   DW_AT_decl_line   : 485
    <992>   DW_AT_decl_column : 17
    <993>   DW_AT_type        : <0x866>
    <997>   DW_AT_data_member_location: 56
 <2><998>: Abbrev Number: 3 (DW_TAG_member)
    <999>   DW_AT_name        : (indirect string, offset: 0x2b449): CCR3
    <99d>   DW_AT_decl_file   : 4
    <99e>   DW_AT_decl_line   : 486
    <9a0>   DW_AT_decl_column : 17
    <9a1>   DW_AT_type        : <0x866>
    <9a5>   DW_AT_data_member_location: 60
 <2><9a6>: Abbrev Number: 3 (DW_TAG_member)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x97dd): CCR4
    <9ab>   DW_AT_decl_file   : 4
    <9ac>   DW_AT_decl_line   : 487
    <9ae>   DW_AT_decl_column : 17
    <9af>   DW_AT_type        : <0x866>
    <9b3>   DW_AT_data_member_location: 64
 <2><9b4>: Abbrev Number: 3 (DW_TAG_member)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x458ef): BDTR
    <9b9>   DW_AT_decl_file   : 4
    <9ba>   DW_AT_decl_line   : 488
    <9bc>   DW_AT_decl_column : 17
    <9bd>   DW_AT_type        : <0x866>
    <9c1>   DW_AT_data_member_location: 68
 <2><9c2>: Abbrev Number: 6 (DW_TAG_member)
    <9c3>   DW_AT_name        : DCR
    <9c7>   DW_AT_decl_file   : 4
    <9c7>   DW_AT_decl_line   : 489
    <9c9>   DW_AT_decl_column : 17
    <9c9>   DW_AT_type        : <0x866>
    <9cd>   DW_AT_data_member_location: 72
 <2><9ce>: Abbrev Number: 3 (DW_TAG_member)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x83f4d): DMAR
    <9d3>   DW_AT_decl_file   : 4
    <9d4>   DW_AT_decl_line   : 490
    <9d6>   DW_AT_decl_column : 17
    <9d7>   DW_AT_type        : <0x866>
    <9db>   DW_AT_data_member_location: 76
 <2><9dc>: Abbrev Number: 6 (DW_TAG_member)
    <9dd>   DW_AT_name        : OR
    <9e0>   DW_AT_decl_file   : 4
    <9e0>   DW_AT_decl_line   : 491
    <9e2>   DW_AT_decl_column : 17
    <9e2>   DW_AT_type        : <0x866>
    <9e6>   DW_AT_data_member_location: 80
 <2><9e7>: Abbrev Number: 0
 <1><9e8>: Abbrev Number: 8 (DW_TAG_typedef)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x99f49): TIM_TypeDef
    <9ed>   DW_AT_decl_file   : 4
    <9ee>   DW_AT_decl_line   : 492
    <9f0>   DW_AT_decl_column : 3
    <9f0>   DW_AT_type        : <0x8ce>
 <1><9f4>: Abbrev Number: 5 (DW_TAG_base_type)
    <9f5>   DW_AT_byte_size   : 8
    <9f6>   DW_AT_encoding    : 4	(float)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x7e29e): long double
 <1><9fb>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <9fc>   DW_AT_encoding    : 7	(unsigned)
    <9fc>   DW_AT_byte_size   : 1
    <9fc>   DW_AT_type        : <0x7df>
    <a00>   DW_AT_decl_file   : 5
    <a01>   DW_AT_decl_line   : 50
    <a02>   DW_AT_decl_column : 1
    <a02>   DW_AT_sibling     : <0xa13>
 <2><a06>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a07>   DW_AT_name        : (indirect string, offset: 0x718bb): HAL_UNLOCKED
    <a0b>   DW_AT_const_value : 0
 <2><a0c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x992e3): HAL_LOCKED
    <a11>   DW_AT_const_value : 1
 <2><a12>: Abbrev Number: 0
 <1><a13>: Abbrev Number: 4 (DW_TAG_typedef)
    <a14>   DW_AT_name        : (indirect string, offset: 0x5c7e2): HAL_LockTypeDef
    <a18>   DW_AT_decl_file   : 5
    <a19>   DW_AT_decl_line   : 53
    <a1a>   DW_AT_decl_column : 3
    <a1b>   DW_AT_type        : <0x9fb>
 <1><a1f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a20>   DW_AT_byte_size   : 48
    <a21>   DW_AT_decl_file   : 6
    <a22>   DW_AT_decl_line   : 48
    <a23>   DW_AT_decl_column : 9
    <a23>   DW_AT_sibling     : <0xac4>
 <2><a27>: Abbrev Number: 1 (DW_TAG_member)
    <a28>   DW_AT_name        : (indirect string, offset: 0x9a04a): Channel
    <a2c>   DW_AT_decl_file   : 6
    <a2d>   DW_AT_decl_line   : 50
    <a2e>   DW_AT_decl_column : 12
    <a2f>   DW_AT_type        : <0x85a>
    <a33>   DW_AT_data_member_location: 0
 <2><a34>: Abbrev Number: 1 (DW_TAG_member)
    <a35>   DW_AT_name        : (indirect string, offset: 0x8a68f): Direction
    <a39>   DW_AT_decl_file   : 6
    <a3a>   DW_AT_decl_line   : 53
    <a3b>   DW_AT_decl_column : 12
    <a3c>   DW_AT_type        : <0x85a>
    <a40>   DW_AT_data_member_location: 4
 <2><a41>: Abbrev Number: 1 (DW_TAG_member)
    <a42>   DW_AT_name        : (indirect string, offset: 0xa018): PeriphInc
    <a46>   DW_AT_decl_file   : 6
    <a47>   DW_AT_decl_line   : 57
    <a48>   DW_AT_decl_column : 12
    <a49>   DW_AT_type        : <0x85a>
    <a4d>   DW_AT_data_member_location: 8
 <2><a4e>: Abbrev Number: 1 (DW_TAG_member)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x178d8): MemInc
    <a53>   DW_AT_decl_file   : 6
    <a54>   DW_AT_decl_line   : 60
    <a55>   DW_AT_decl_column : 12
    <a56>   DW_AT_type        : <0x85a>
    <a5a>   DW_AT_data_member_location: 12
 <2><a5b>: Abbrev Number: 1 (DW_TAG_member)
    <a5c>   DW_AT_name        : (indirect string, offset: 0x4baba): PeriphDataAlignment
    <a60>   DW_AT_decl_file   : 6
    <a61>   DW_AT_decl_line   : 63
    <a62>   DW_AT_decl_column : 12
    <a63>   DW_AT_type        : <0x85a>
    <a67>   DW_AT_data_member_location: 16
 <2><a68>: Abbrev Number: 1 (DW_TAG_member)
    <a69>   DW_AT_name        : (indirect string, offset: 0x8ae8c): MemDataAlignment
    <a6d>   DW_AT_decl_file   : 6
    <a6e>   DW_AT_decl_line   : 66
    <a6f>   DW_AT_decl_column : 12
    <a70>   DW_AT_type        : <0x85a>
    <a74>   DW_AT_data_member_location: 20
 <2><a75>: Abbrev Number: 1 (DW_TAG_member)
    <a76>   DW_AT_name        : (indirect string, offset: 0xa1564): Mode
    <a7a>   DW_AT_decl_file   : 6
    <a7b>   DW_AT_decl_line   : 69
    <a7c>   DW_AT_decl_column : 12
    <a7d>   DW_AT_type        : <0x85a>
    <a81>   DW_AT_data_member_location: 24
 <2><a82>: Abbrev Number: 1 (DW_TAG_member)
    <a83>   DW_AT_name        : (indirect string, offset: 0xa2191): Priority
    <a87>   DW_AT_decl_file   : 6
    <a88>   DW_AT_decl_line   : 74
    <a89>   DW_AT_decl_column : 12
    <a8a>   DW_AT_type        : <0x85a>
    <a8e>   DW_AT_data_member_location: 28
 <2><a8f>: Abbrev Number: 1 (DW_TAG_member)
    <a90>   DW_AT_name        : (indirect string, offset: 0x40e92): FIFOMode
    <a94>   DW_AT_decl_file   : 6
    <a95>   DW_AT_decl_line   : 77
    <a96>   DW_AT_decl_column : 12
    <a97>   DW_AT_type        : <0x85a>
    <a9b>   DW_AT_data_member_location: 32
 <2><a9c>: Abbrev Number: 1 (DW_TAG_member)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x74db8): FIFOThreshold
    <aa1>   DW_AT_decl_file   : 6
    <aa2>   DW_AT_decl_line   : 82
    <aa3>   DW_AT_decl_column : 12
    <aa4>   DW_AT_type        : <0x85a>
    <aa8>   DW_AT_data_member_location: 36
 <2><aa9>: Abbrev Number: 1 (DW_TAG_member)
    <aaa>   DW_AT_name        : (indirect string, offset: 0x3bc69): MemBurst
    <aae>   DW_AT_decl_file   : 6
    <aaf>   DW_AT_decl_line   : 85
    <ab0>   DW_AT_decl_column : 12
    <ab1>   DW_AT_type        : <0x85a>
    <ab5>   DW_AT_data_member_location: 40
 <2><ab6>: Abbrev Number: 1 (DW_TAG_member)
    <ab7>   DW_AT_name        : (indirect string, offset: 0x33c81): PeriphBurst
    <abb>   DW_AT_decl_file   : 6
    <abc>   DW_AT_decl_line   : 91
    <abd>   DW_AT_decl_column : 12
    <abe>   DW_AT_type        : <0x85a>
    <ac2>   DW_AT_data_member_location: 44
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 4 (DW_TAG_typedef)
    <ac5>   DW_AT_name        : (indirect string, offset: 0x28c05): DMA_InitTypeDef
    <ac9>   DW_AT_decl_file   : 6
    <aca>   DW_AT_decl_line   : 96
    <acb>   DW_AT_decl_column : 2
    <acc>   DW_AT_type        : <0xa1f>
 <1><ad0>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <ad1>   DW_AT_encoding    : 7	(unsigned)
    <ad1>   DW_AT_byte_size   : 1
    <ad1>   DW_AT_type        : <0x7df>
    <ad5>   DW_AT_decl_file   : 6
    <ad6>   DW_AT_decl_line   : 103
    <ad7>   DW_AT_decl_column : 1
    <ad7>   DW_AT_sibling     : <0xb00>
 <2><adb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <adc>   DW_AT_name        : (indirect string, offset: 0x72a46): HAL_DMA_STATE_RESET
    <ae0>   DW_AT_const_value : 0
 <2><ae1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x29b4e): HAL_DMA_STATE_READY
    <ae6>   DW_AT_const_value : 1
 <2><ae7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae8>   DW_AT_name        : (indirect string, offset: 0x69709): HAL_DMA_STATE_BUSY
    <aec>   DW_AT_const_value : 2
 <2><aed>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aee>   DW_AT_name        : (indirect string, offset: 0x970a3): HAL_DMA_STATE_TIMEOUT
    <af2>   DW_AT_const_value : 3
 <2><af3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <af4>   DW_AT_name        : (indirect string, offset: 0x83773): HAL_DMA_STATE_ERROR
    <af8>   DW_AT_const_value : 4
 <2><af9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <afa>   DW_AT_name        : (indirect string, offset: 0x227f7): HAL_DMA_STATE_ABORT
    <afe>   DW_AT_const_value : 5
 <2><aff>: Abbrev Number: 0
 <1><b00>: Abbrev Number: 4 (DW_TAG_typedef)
    <b01>   DW_AT_name        : (indirect string, offset: 0x5425d): HAL_DMA_StateTypeDef
    <b05>   DW_AT_decl_file   : 6
    <b06>   DW_AT_decl_line   : 110
    <b07>   DW_AT_decl_column : 2
    <b08>   DW_AT_type        : <0xad0>
 <1><b0c>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <b0d>   DW_AT_type        : <0xb00>
 <1><b11>: Abbrev Number: 21 (DW_TAG_structure_type)
    <b12>   DW_AT_name        : (indirect string, offset: 0x82ba6): __DMA_HandleTypeDef
    <b16>   DW_AT_byte_size   : 96
    <b17>   DW_AT_decl_file   : 6
    <b18>   DW_AT_decl_line   : 138
    <b19>   DW_AT_decl_column : 16
    <b1a>   DW_AT_sibling     : <0xbd5>
 <2><b1e>: Abbrev Number: 1 (DW_TAG_member)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <b23>   DW_AT_decl_file   : 6
    <b24>   DW_AT_decl_line   : 140
    <b25>   DW_AT_decl_column : 31
    <b26>   DW_AT_type        : <0xbd5>
    <b2a>   DW_AT_data_member_location: 0
 <2><b2b>: Abbrev Number: 1 (DW_TAG_member)
    <b2c>   DW_AT_name        : (indirect string, offset: 0x9ef99): Init
    <b30>   DW_AT_decl_file   : 6
    <b31>   DW_AT_decl_line   : 142
    <b32>   DW_AT_decl_column : 30
    <b33>   DW_AT_type        : <0xac4>
    <b37>   DW_AT_data_member_location: 4
 <2><b38>: Abbrev Number: 1 (DW_TAG_member)
    <b39>   DW_AT_name        : (indirect string, offset: 0x6ce85): Lock
    <b3d>   DW_AT_decl_file   : 6
    <b3e>   DW_AT_decl_line   : 144
    <b3f>   DW_AT_decl_column : 30
    <b40>   DW_AT_type        : <0xa13>
    <b44>   DW_AT_data_member_location: 52
 <2><b45>: Abbrev Number: 1 (DW_TAG_member)
    <b46>   DW_AT_name        : (indirect string, offset: 0x9f07e): State
    <b4a>   DW_AT_decl_file   : 6
    <b4b>   DW_AT_decl_line   : 146
    <b4c>   DW_AT_decl_column : 30
    <b4d>   DW_AT_type        : <0xb0c>
    <b51>   DW_AT_data_member_location: 53
 <2><b52>: Abbrev Number: 1 (DW_TAG_member)
    <b53>   DW_AT_name        : (indirect string, offset: 0x920e1): Parent
    <b57>   DW_AT_decl_file   : 6
    <b58>   DW_AT_decl_line   : 148
    <b59>   DW_AT_decl_column : 31
    <b5a>   DW_AT_type        : <0xbda>
    <b5e>   DW_AT_data_member_location: 56
 <2><b5f>: Abbrev Number: 1 (DW_TAG_member)
    <b60>   DW_AT_name        : (indirect string, offset: 0x98b66): XferCpltCallback
    <b64>   DW_AT_decl_file   : 6
    <b65>   DW_AT_decl_line   : 150
    <b66>   DW_AT_decl_column : 33
    <b67>   DW_AT_type        : <0xbec>
    <b6b>   DW_AT_data_member_location: 60
 <2><b6c>: Abbrev Number: 1 (DW_TAG_member)
    <b6d>   DW_AT_name        : (indirect string, offset: 0x77583): XferHalfCpltCallback
    <b71>   DW_AT_decl_file   : 6
    <b72>   DW_AT_decl_line   : 152
    <b73>   DW_AT_decl_column : 33
    <b74>   DW_AT_type        : <0xbec>
    <b78>   DW_AT_data_member_location: 64
 <2><b79>: Abbrev Number: 1 (DW_TAG_member)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x2421b): XferM1CpltCallback
    <b7e>   DW_AT_decl_file   : 6
    <b7f>   DW_AT_decl_line   : 154
    <b80>   DW_AT_decl_column : 33
    <b81>   DW_AT_type        : <0xbec>
    <b85>   DW_AT_data_member_location: 68
 <2><b86>: Abbrev Number: 1 (DW_TAG_member)
    <b87>   DW_AT_name        : (indirect string, offset: 0x5443e): XferM1HalfCpltCallback
    <b8b>   DW_AT_decl_file   : 6
    <b8c>   DW_AT_decl_line   : 156
    <b8d>   DW_AT_decl_column : 33
    <b8e>   DW_AT_type        : <0xbec>
    <b92>   DW_AT_data_member_location: 72
 <2><b93>: Abbrev Number: 1 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0x15c13): XferErrorCallback
    <b98>   DW_AT_decl_file   : 6
    <b99>   DW_AT_decl_line   : 158
    <b9a>   DW_AT_decl_column : 33
    <b9b>   DW_AT_type        : <0xbec>
    <b9f>   DW_AT_data_member_location: 76
 <2><ba0>: Abbrev Number: 1 (DW_TAG_member)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x8f71e): XferAbortCallback
    <ba5>   DW_AT_decl_file   : 6
    <ba6>   DW_AT_decl_line   : 160
    <ba7>   DW_AT_decl_column : 33
    <ba8>   DW_AT_type        : <0xbec>
    <bac>   DW_AT_data_member_location: 80
 <2><bad>: Abbrev Number: 1 (DW_TAG_member)
    <bae>   DW_AT_name        : (indirect string, offset: 0x96268): ErrorCode
    <bb2>   DW_AT_decl_file   : 6
    <bb3>   DW_AT_decl_line   : 162
    <bb4>   DW_AT_decl_column : 30
    <bb5>   DW_AT_type        : <0x866>
    <bb9>   DW_AT_data_member_location: 84
 <2><bba>: Abbrev Number: 1 (DW_TAG_member)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x74143): StreamBaseAddress
    <bbf>   DW_AT_decl_file   : 6
    <bc0>   DW_AT_decl_line   : 164
    <bc1>   DW_AT_decl_column : 30
    <bc2>   DW_AT_type        : <0x85a>
    <bc6>   DW_AT_data_member_location: 88
 <2><bc7>: Abbrev Number: 1 (DW_TAG_member)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x813dd): StreamIndex
    <bcc>   DW_AT_decl_file   : 6
    <bcd>   DW_AT_decl_line   : 166
    <bce>   DW_AT_decl_column : 30
    <bcf>   DW_AT_type        : <0x85a>
    <bd3>   DW_AT_data_member_location: 92
 <2><bd4>: Abbrev Number: 0
 <1><bd5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <bd6>   DW_AT_byte_size   : 4
    <bd6>   DW_AT_type        : <0x8c2>
 <1><bda>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <bdb>   DW_AT_byte_size   : 4
 <1><bdc>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <bdd>   DW_AT_prototyped  : 1
    <bdd>   DW_AT_sibling     : <0xbe7>
 <2><be1>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <be2>   DW_AT_type        : <0xbe7>
 <2><be6>: Abbrev Number: 0
 <1><be7>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <be8>   DW_AT_byte_size   : 4
    <be8>   DW_AT_type        : <0xb11>
 <1><bec>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <bed>   DW_AT_byte_size   : 4
    <bed>   DW_AT_type        : <0xbdc>
 <1><bf1>: Abbrev Number: 4 (DW_TAG_typedef)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x82ba8): DMA_HandleTypeDef
    <bf6>   DW_AT_decl_file   : 6
    <bf7>   DW_AT_decl_line   : 168
    <bf8>   DW_AT_decl_column : 2
    <bf9>   DW_AT_type        : <0xb11>
 <1><bfd>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <bfe>   DW_AT_byte_size   : 4
    <bfe>   DW_AT_type        : <0xbf1>
 <1><c02>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c03>   DW_AT_byte_size   : 24
    <c04>   DW_AT_decl_file   : 7
    <c05>   DW_AT_decl_line   : 46
    <c06>   DW_AT_decl_column : 9
    <c06>   DW_AT_sibling     : <0xc59>
 <2><c0a>: Abbrev Number: 1 (DW_TAG_member)
    <c0b>   DW_AT_name        : (indirect string, offset: 0xa383f): Prescaler
    <c0f>   DW_AT_decl_file   : 7
    <c10>   DW_AT_decl_line   : 48
    <c11>   DW_AT_decl_column : 12
    <c12>   DW_AT_type        : <0x85a>
    <c16>   DW_AT_data_member_location: 0
 <2><c17>: Abbrev Number: 1 (DW_TAG_member)
    <c18>   DW_AT_name        : (indirect string, offset: 0x9a003): CounterMode
    <c1c>   DW_AT_decl_file   : 7
    <c1d>   DW_AT_decl_line   : 51
    <c1e>   DW_AT_decl_column : 12
    <c1f>   DW_AT_type        : <0x85a>
    <c23>   DW_AT_data_member_location: 4
 <2><c24>: Abbrev Number: 1 (DW_TAG_member)
    <c25>   DW_AT_name        : (indirect string, offset: 0xa928a): Period
    <c29>   DW_AT_decl_file   : 7
    <c2a>   DW_AT_decl_line   : 54
    <c2b>   DW_AT_decl_column : 12
    <c2c>   DW_AT_type        : <0x85a>
    <c30>   DW_AT_data_member_location: 8
 <2><c31>: Abbrev Number: 1 (DW_TAG_member)
    <c32>   DW_AT_name        : (indirect string, offset: 0x9a00f): ClockDivision
    <c36>   DW_AT_decl_file   : 7
    <c37>   DW_AT_decl_line   : 58
    <c38>   DW_AT_decl_column : 12
    <c39>   DW_AT_type        : <0x85a>
    <c3d>   DW_AT_data_member_location: 12
 <2><c3e>: Abbrev Number: 1 (DW_TAG_member)
    <c3f>   DW_AT_name        : (indirect string, offset: 0x9a14f): RepetitionCounter
    <c43>   DW_AT_decl_file   : 7
    <c44>   DW_AT_decl_line   : 61
    <c45>   DW_AT_decl_column : 12
    <c46>   DW_AT_type        : <0x85a>
    <c4a>   DW_AT_data_member_location: 16
 <2><c4b>: Abbrev Number: 1 (DW_TAG_member)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x9a1e3): AutoReloadPreload
    <c50>   DW_AT_decl_file   : 7
    <c51>   DW_AT_decl_line   : 72
    <c52>   DW_AT_decl_column : 12
    <c53>   DW_AT_type        : <0x85a>
    <c57>   DW_AT_data_member_location: 20
 <2><c58>: Abbrev Number: 0
 <1><c59>: Abbrev Number: 4 (DW_TAG_typedef)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x9a1ce): TIM_Base_InitTypeDef
    <c5e>   DW_AT_decl_file   : 7
    <c5f>   DW_AT_decl_line   : 74
    <c60>   DW_AT_decl_column : 3
    <c61>   DW_AT_type        : <0xc02>
 <1><c65>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <c66>   DW_AT_encoding    : 7	(unsigned)
    <c66>   DW_AT_byte_size   : 1
    <c66>   DW_AT_type        : <0x7df>
    <c6a>   DW_AT_decl_file   : 7
    <c6a>   DW_AT_decl_line   : 291
    <c6c>   DW_AT_decl_column : 1
    <c6c>   DW_AT_sibling     : <0xc8f>
 <2><c70>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c71>   DW_AT_name        : (indirect string, offset: 0x9a0f7): HAL_TIM_STATE_RESET
    <c75>   DW_AT_const_value : 0
 <2><c76>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c77>   DW_AT_name        : (indirect string, offset: 0x99f55): HAL_TIM_STATE_READY
    <c7b>   DW_AT_const_value : 1
 <2><c7c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x99fc5): HAL_TIM_STATE_BUSY
    <c81>   DW_AT_const_value : 2
 <2><c82>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c83>   DW_AT_name        : (indirect string, offset: 0x9a1b8): HAL_TIM_STATE_TIMEOUT
    <c87>   DW_AT_const_value : 3
 <2><c88>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c89>   DW_AT_name        : (indirect string, offset: 0x9a0e3): HAL_TIM_STATE_ERROR
    <c8d>   DW_AT_const_value : 4
 <2><c8e>: Abbrev Number: 0
 <1><c8f>: Abbrev Number: 8 (DW_TAG_typedef)
    <c90>   DW_AT_name        : (indirect string, offset: 0x9a199): HAL_TIM_StateTypeDef
    <c94>   DW_AT_decl_file   : 7
    <c95>   DW_AT_decl_line   : 297
    <c97>   DW_AT_decl_column : 3
    <c97>   DW_AT_type        : <0xc65>
 <1><c9b>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <c9c>   DW_AT_type        : <0xc8f>
 <1><ca0>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <ca1>   DW_AT_encoding    : 7	(unsigned)
    <ca1>   DW_AT_byte_size   : 1
    <ca1>   DW_AT_type        : <0x7df>
    <ca5>   DW_AT_decl_file   : 7
    <ca5>   DW_AT_decl_line   : 303
    <ca7>   DW_AT_decl_column : 1
    <ca7>   DW_AT_sibling     : <0xcbe>
 <2><cab>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cac>   DW_AT_name        : (indirect string, offset: 0x9a161): HAL_TIM_CHANNEL_STATE_RESET
    <cb0>   DW_AT_const_value : 0
 <2><cb1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x9a17d): HAL_TIM_CHANNEL_STATE_READY
    <cb6>   DW_AT_const_value : 1
 <2><cb7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x9a1f5): HAL_TIM_CHANNEL_STATE_BUSY
    <cbc>   DW_AT_const_value : 2
 <2><cbd>: Abbrev Number: 0
 <1><cbe>: Abbrev Number: 8 (DW_TAG_typedef)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x99fa9): HAL_TIM_ChannelStateTypeDef
    <cc3>   DW_AT_decl_file   : 7
    <cc4>   DW_AT_decl_line   : 307
    <cc6>   DW_AT_decl_column : 3
    <cc6>   DW_AT_type        : <0xca0>
 <1><cca>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <ccb>   DW_AT_type        : <0xcbe>
 <1><ccf>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <cd0>   DW_AT_encoding    : 7	(unsigned)
    <cd0>   DW_AT_byte_size   : 1
    <cd0>   DW_AT_type        : <0x7df>
    <cd4>   DW_AT_decl_file   : 7
    <cd4>   DW_AT_decl_line   : 313
    <cd6>   DW_AT_decl_column : 1
    <cd6>   DW_AT_sibling     : <0xced>
 <2><cda>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x9a135): HAL_DMA_BURST_STATE_RESET
    <cdf>   DW_AT_const_value : 0
 <2><ce0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x9a060): HAL_DMA_BURST_STATE_READY
    <ce5>   DW_AT_const_value : 1
 <2><ce6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x99fd8): HAL_DMA_BURST_STATE_BUSY
    <ceb>   DW_AT_const_value : 2
 <2><cec>: Abbrev Number: 0
 <1><ced>: Abbrev Number: 8 (DW_TAG_typedef)
    <cee>   DW_AT_name        : (indirect string, offset: 0x99f86): HAL_TIM_DMABurstStateTypeDef
    <cf2>   DW_AT_decl_file   : 7
    <cf3>   DW_AT_decl_line   : 317
    <cf5>   DW_AT_decl_column : 3
    <cf5>   DW_AT_type        : <0xccf>
 <1><cf9>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <cfa>   DW_AT_type        : <0xced>
 <1><cfe>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <cff>   DW_AT_encoding    : 7	(unsigned)
    <cff>   DW_AT_byte_size   : 1
    <cff>   DW_AT_type        : <0x7df>
    <d03>   DW_AT_decl_file   : 7
    <d03>   DW_AT_decl_line   : 323
    <d05>   DW_AT_decl_column : 1
    <d05>   DW_AT_sibling     : <0xd28>
 <2><d09>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x9a07a): HAL_TIM_ACTIVE_CHANNEL_1
    <d0e>   DW_AT_const_value : 1
 <2><d0f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d10>   DW_AT_name        : (indirect string, offset: 0x9a093): HAL_TIM_ACTIVE_CHANNEL_2
    <d14>   DW_AT_const_value : 2
 <2><d15>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d16>   DW_AT_name        : (indirect string, offset: 0x9a0ac): HAL_TIM_ACTIVE_CHANNEL_3
    <d1a>   DW_AT_const_value : 4
 <2><d1b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x9a0c5): HAL_TIM_ACTIVE_CHANNEL_4
    <d20>   DW_AT_const_value : 8
 <2><d21>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d22>   DW_AT_name        : (indirect string, offset: 0x9a01d): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <d26>   DW_AT_const_value : 0
 <2><d27>: Abbrev Number: 0
 <1><d28>: Abbrev Number: 8 (DW_TAG_typedef)
    <d29>   DW_AT_name        : (indirect string, offset: 0x9a03c): HAL_TIM_ActiveChannel
    <d2d>   DW_AT_decl_file   : 7
    <d2e>   DW_AT_decl_line   : 329
    <d30>   DW_AT_decl_column : 3
    <d30>   DW_AT_type        : <0xcfe>
 <1><d34>: Abbrev Number: 14 (DW_TAG_structure_type)
    <d35>   DW_AT_byte_size   : 72
    <d36>   DW_AT_decl_file   : 7
    <d37>   DW_AT_decl_line   : 337
    <d39>   DW_AT_decl_column : 9
    <d39>   DW_AT_sibling     : <0xdbc>
 <2><d3d>: Abbrev Number: 3 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <d42>   DW_AT_decl_file   : 7
    <d43>   DW_AT_decl_line   : 340
    <d45>   DW_AT_decl_column : 39
    <d46>   DW_AT_type        : <0xdbc>
    <d4a>   DW_AT_data_member_location: 0
 <2><d4b>: Abbrev Number: 3 (DW_TAG_member)
    <d4c>   DW_AT_name        : (indirect string, offset: 0x9ef99): Init
    <d50>   DW_AT_decl_file   : 7
    <d51>   DW_AT_decl_line   : 341
    <d53>   DW_AT_decl_column : 38
    <d54>   DW_AT_type        : <0xc59>
    <d58>   DW_AT_data_member_location: 4
 <2><d59>: Abbrev Number: 3 (DW_TAG_member)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x9a04a): Channel
    <d5e>   DW_AT_decl_file   : 7
    <d5f>   DW_AT_decl_line   : 342
    <d61>   DW_AT_decl_column : 38
    <d62>   DW_AT_type        : <0xd28>
    <d66>   DW_AT_data_member_location: 28
 <2><d67>: Abbrev Number: 3 (DW_TAG_member)
    <d68>   DW_AT_name        : (indirect string, offset: 0x9a0de): hdma
    <d6c>   DW_AT_decl_file   : 7
    <d6d>   DW_AT_decl_line   : 343
    <d6f>   DW_AT_decl_column : 39
    <d70>   DW_AT_type        : <0xdc1>
    <d74>   DW_AT_data_member_location: 32
 <2><d75>: Abbrev Number: 3 (DW_TAG_member)
    <d76>   DW_AT_name        : (indirect string, offset: 0x6ce85): Lock
    <d7a>   DW_AT_decl_file   : 7
    <d7b>   DW_AT_decl_line   : 345
    <d7d>   DW_AT_decl_column : 38
    <d7e>   DW_AT_type        : <0xa13>
    <d82>   DW_AT_data_member_location: 60
 <2><d83>: Abbrev Number: 3 (DW_TAG_member)
    <d84>   DW_AT_name        : (indirect string, offset: 0x9f07e): State
    <d88>   DW_AT_decl_file   : 7
    <d89>   DW_AT_decl_line   : 346
    <d8b>   DW_AT_decl_column : 38
    <d8c>   DW_AT_type        : <0xc9b>
    <d90>   DW_AT_data_member_location: 61
 <2><d91>: Abbrev Number: 3 (DW_TAG_member)
    <d92>   DW_AT_name        : (indirect string, offset: 0xa3e8b): ChannelState
    <d96>   DW_AT_decl_file   : 7
    <d97>   DW_AT_decl_line   : 347
    <d99>   DW_AT_decl_column : 38
    <d9a>   DW_AT_type        : <0xde1>
    <d9e>   DW_AT_data_member_location: 62
 <2><d9f>: Abbrev Number: 3 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0xa443e): ChannelNState
    <da4>   DW_AT_decl_file   : 7
    <da5>   DW_AT_decl_line   : 348
    <da7>   DW_AT_decl_column : 38
    <da8>   DW_AT_type        : <0xde1>
    <dac>   DW_AT_data_member_location: 66
 <2><dad>: Abbrev Number: 3 (DW_TAG_member)
    <dae>   DW_AT_name        : (indirect string, offset: 0xa3ac6): DMABurstState
    <db2>   DW_AT_decl_file   : 7
    <db3>   DW_AT_decl_line   : 349
    <db5>   DW_AT_decl_column : 38
    <db6>   DW_AT_type        : <0xcf9>
    <dba>   DW_AT_data_member_location: 70
 <2><dbb>: Abbrev Number: 0
 <1><dbc>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <dbd>   DW_AT_byte_size   : 4
    <dbd>   DW_AT_type        : <0x9e8>
 <1><dc1>: Abbrev Number: 16 (DW_TAG_array_type)
    <dc2>   DW_AT_type        : <0xbfd>
    <dc6>   DW_AT_sibling     : <0xdd1>
 <2><dca>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <dcb>   DW_AT_type        : <0x83b>
    <dcf>   DW_AT_upper_bound : 6
 <2><dd0>: Abbrev Number: 0
 <1><dd1>: Abbrev Number: 16 (DW_TAG_array_type)
    <dd2>   DW_AT_type        : <0xcca>
    <dd6>   DW_AT_sibling     : <0xde1>
 <2><dda>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ddb>   DW_AT_type        : <0x83b>
    <ddf>   DW_AT_upper_bound : 3
 <2><de0>: Abbrev Number: 0
 <1><de1>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <de2>   DW_AT_type        : <0xdd1>
 <1><de6>: Abbrev Number: 8 (DW_TAG_typedef)
    <de7>   DW_AT_name        : (indirect string, offset: 0x99ff1): TIM_HandleTypeDef
    <deb>   DW_AT_decl_file   : 7
    <dec>   DW_AT_decl_line   : 380
    <dee>   DW_AT_decl_column : 3
    <dee>   DW_AT_type        : <0xd34>
 <1><df2>: Abbrev Number: 25 (DW_TAG_variable)
    <df3>   DW_AT_name        : (indirect string, offset: 0x99fa3): htim4
    <df7>   DW_AT_decl_file   : 8
    <df8>   DW_AT_decl_line   : 37
    <df9>   DW_AT_decl_column : 26
    <dfa>   DW_AT_type        : <0xde6>
    <dfe>   DW_AT_external    : 1
    <dfe>   DW_AT_declaration : 1
 <1><dfe>: Abbrev Number: 18 (DW_TAG_variable)
    <dff>   DW_AT_name        : (indirect string, offset: 0x9a05a): pulse
    <e03>   DW_AT_decl_file   : 1
    <e03>   DW_AT_decl_line   : 11
    <e04>   DW_AT_decl_column : 9
    <e05>   DW_AT_type        : <0x842>
    <e09>   DW_AT_external    : 1
    <e09>   DW_AT_location    : 5 byte block: 3 28 2 0 20 	(DW_OP_addr: 20000228)
 <1><e0f>: Abbrev Number: 18 (DW_TAG_variable)
    <e10>   DW_AT_name        : (indirect string, offset: 0x9a11b): compare
    <e14>   DW_AT_decl_file   : 1
    <e14>   DW_AT_decl_line   : 12
    <e15>   DW_AT_decl_column : 10
    <e16>   DW_AT_type        : <0x84e>
    <e1a>   DW_AT_external    : 1
    <e1a>   DW_AT_location    : 5 byte block: 3 2a 2 0 20 	(DW_OP_addr: 2000022a)
 <1><e20>: Abbrev Number: 26 (DW_TAG_variable)
    <e21>   DW_AT_name        : ms
    <e24>   DW_AT_decl_file   : 1
    <e25>   DW_AT_decl_line   : 13
    <e26>   DW_AT_decl_column : 7
    <e27>   DW_AT_type        : <0x86b>
    <e2b>   DW_AT_external    : 1
    <e2b>   DW_AT_location    : 5 byte block: 3 2c 2 0 20 	(DW_OP_addr: 2000022c)
 <1><e31>: Abbrev Number: 27 (DW_TAG_subprogram)
    <e32>   DW_AT_external    : 1
    <e32>   DW_AT_name        : map
    <e36>   DW_AT_decl_file   : 1
    <e37>   DW_AT_decl_line   : 28
    <e38>   DW_AT_decl_column : 6
    <e39>   DW_AT_prototyped  : 1
    <e39>   DW_AT_type        : <0x80c>
    <e3d>   DW_AT_low_pc      : 0x80010cc
    <e41>   DW_AT_high_pc     : 0x38
    <e45>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e47>   DW_AT_call_all_calls: 1
    <e47>   DW_AT_sibling     : <0xe8d>
 <2><e4b>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <e4c>   DW_AT_name        : x
    <e4e>   DW_AT_decl_file   : 1
    <e4f>   DW_AT_decl_line   : 28
    <e50>   DW_AT_decl_column : 15
    <e51>   DW_AT_type        : <0x80c>
    <e55>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e58>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e59>   DW_AT_name        : (indirect string, offset: 0x99f7f): in_min
    <e5d>   DW_AT_decl_file   : 1
    <e5d>   DW_AT_decl_line   : 28
    <e5d>   DW_AT_decl_column : 23
    <e5e>   DW_AT_type        : <0x80c>
    <e62>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><e65>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e66>   DW_AT_name        : (indirect string, offset: 0x9a123): in_max
    <e6a>   DW_AT_decl_file   : 1
    <e6a>   DW_AT_decl_line   : 28
    <e6a>   DW_AT_decl_column : 36
    <e6b>   DW_AT_type        : <0x80c>
    <e6f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e72>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e73>   DW_AT_name        : (indirect string, offset: 0x99f39): out_min
    <e77>   DW_AT_decl_file   : 1
    <e77>   DW_AT_decl_line   : 28
    <e77>   DW_AT_decl_column : 49
    <e78>   DW_AT_type        : <0x80c>
    <e7c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><e7f>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e80>   DW_AT_name        : (indirect string, offset: 0x9a052): out_max
    <e84>   DW_AT_decl_file   : 1
    <e84>   DW_AT_decl_line   : 28
    <e84>   DW_AT_decl_column : 63
    <e85>   DW_AT_type        : <0x80c>
    <e89>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><e8c>: Abbrev Number: 0
 <1><e8d>: Abbrev Number: 29 (DW_TAG_subprogram)
    <e8e>   DW_AT_external    : 1
    <e8e>   DW_AT_name        : (indirect string, offset: 0x99f41): control
    <e92>   DW_AT_decl_file   : 1
    <e93>   DW_AT_decl_line   : 16
    <e94>   DW_AT_decl_column : 6
    <e95>   DW_AT_prototyped  : 1
    <e95>   DW_AT_low_pc      : 0x8001034
    <e99>   DW_AT_high_pc     : 0x98
    <e9d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e9f>   DW_AT_call_all_tail_calls: 1
 <1><e9f>: Abbrev Number: 0
  Compilation Unit @ offset 0xea0:
   Length:        0xa22 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x32b
   Pointer Size:  4
 <0><eac>: Abbrev Number: 21 (DW_TAG_compile_unit)
    <ead>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <eb1>   DW_AT_language    : 29	(C11)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x9cbb1): ../Core/Src/IMU.c
    <eb6>   DW_AT_comp_dir    : (indirect string, offset: 0x4a233): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <eba>   DW_AT_ranges      : 0x3a
    <ebe>   DW_AT_low_pc      : 0
    <ec2>   DW_AT_stmt_list   : 0x1112
    <ec6>   DW_AT_macros      : 0x168a7
 <1><eca>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ecb>   DW_AT_byte_size   : 48
    <ecc>   DW_AT_decl_file   : 3
    <ecd>   DW_AT_decl_line   : 11
    <ece>   DW_AT_decl_column : 9
    <ece>   DW_AT_sibling     : <0xf6f>
 <2><ed2>: Abbrev Number: 1 (DW_TAG_member)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x9cb0c): roll
    <ed7>   DW_AT_decl_file   : 3
    <ed8>   DW_AT_decl_line   : 12
    <ed9>   DW_AT_decl_column : 11
    <eda>   DW_AT_type        : <0xf6f>
    <ede>   DW_AT_data_member_location: 0
 <2><edf>: Abbrev Number: 1 (DW_TAG_member)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x9bf00): pitch
    <ee4>   DW_AT_decl_file   : 3
    <ee5>   DW_AT_decl_line   : 13
    <ee6>   DW_AT_decl_column : 11
    <ee7>   DW_AT_type        : <0xf6f>
    <eeb>   DW_AT_data_member_location: 4
 <2><eec>: Abbrev Number: 7 (DW_TAG_member)
    <eed>   DW_AT_name        : yaw
    <ef1>   DW_AT_decl_file   : 3
    <ef2>   DW_AT_decl_line   : 14
    <ef3>   DW_AT_decl_column : 11
    <ef4>   DW_AT_type        : <0xf6f>
    <ef8>   DW_AT_data_member_location: 8
 <2><ef9>: Abbrev Number: 1 (DW_TAG_member)
    <efa>   DW_AT_name        : (indirect string, offset: 0x9b005): accelX
    <efe>   DW_AT_decl_file   : 3
    <eff>   DW_AT_decl_line   : 16
    <f00>   DW_AT_decl_column : 11
    <f01>   DW_AT_type        : <0xf6f>
    <f05>   DW_AT_data_member_location: 12
 <2><f06>: Abbrev Number: 1 (DW_TAG_member)
    <f07>   DW_AT_name        : (indirect string, offset: 0x9b00c): accelY
    <f0b>   DW_AT_decl_file   : 3
    <f0c>   DW_AT_decl_line   : 17
    <f0d>   DW_AT_decl_column : 11
    <f0e>   DW_AT_type        : <0xf6f>
    <f12>   DW_AT_data_member_location: 16
 <2><f13>: Abbrev Number: 1 (DW_TAG_member)
    <f14>   DW_AT_name        : (indirect string, offset: 0x9b013): accelZ
    <f18>   DW_AT_decl_file   : 3
    <f19>   DW_AT_decl_line   : 18
    <f1a>   DW_AT_decl_column : 11
    <f1b>   DW_AT_type        : <0xf6f>
    <f1f>   DW_AT_data_member_location: 20
 <2><f20>: Abbrev Number: 1 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0x9b76f): gyroX
    <f25>   DW_AT_decl_file   : 3
    <f26>   DW_AT_decl_line   : 20
    <f27>   DW_AT_decl_column : 11
    <f28>   DW_AT_type        : <0xf6f>
    <f2c>   DW_AT_data_member_location: 24
 <2><f2d>: Abbrev Number: 1 (DW_TAG_member)
    <f2e>   DW_AT_name        : (indirect string, offset: 0x9b775): gyroY
    <f32>   DW_AT_decl_file   : 3
    <f33>   DW_AT_decl_line   : 21
    <f34>   DW_AT_decl_column : 11
    <f35>   DW_AT_type        : <0xf6f>
    <f39>   DW_AT_data_member_location: 28
 <2><f3a>: Abbrev Number: 1 (DW_TAG_member)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x9b77b): gyroZ
    <f3f>   DW_AT_decl_file   : 3
    <f40>   DW_AT_decl_line   : 22
    <f41>   DW_AT_decl_column : 11
    <f42>   DW_AT_type        : <0xf6f>
    <f46>   DW_AT_data_member_location: 32
 <2><f47>: Abbrev Number: 1 (DW_TAG_member)
    <f48>   DW_AT_name        : (indirect string, offset: 0x9a5dd): magX
    <f4c>   DW_AT_decl_file   : 3
    <f4d>   DW_AT_decl_line   : 24
    <f4e>   DW_AT_decl_column : 11
    <f4f>   DW_AT_type        : <0xf6f>
    <f53>   DW_AT_data_member_location: 36
 <2><f54>: Abbrev Number: 1 (DW_TAG_member)
    <f55>   DW_AT_name        : (indirect string, offset: 0x9a5e2): magY
    <f59>   DW_AT_decl_file   : 3
    <f5a>   DW_AT_decl_line   : 25
    <f5b>   DW_AT_decl_column : 11
    <f5c>   DW_AT_type        : <0xf6f>
    <f60>   DW_AT_data_member_location: 40
 <2><f61>: Abbrev Number: 1 (DW_TAG_member)
    <f62>   DW_AT_name        : (indirect string, offset: 0x9a5e7): magZ
    <f66>   DW_AT_decl_file   : 3
    <f67>   DW_AT_decl_line   : 26
    <f68>   DW_AT_decl_column : 11
    <f69>   DW_AT_type        : <0xf6f>
    <f6d>   DW_AT_data_member_location: 44
 <2><f6e>: Abbrev Number: 0
 <1><f6f>: Abbrev Number: 5 (DW_TAG_base_type)
    <f70>   DW_AT_byte_size   : 4
    <f71>   DW_AT_encoding    : 4	(float)
    <f72>   DW_AT_name        : (indirect string, offset: 0x83cdc): float
 <1><f76>: Abbrev Number: 3 (DW_TAG_typedef)
    <f77>   DW_AT_name        : (indirect string, offset: 0x9a98b): ImuData_t
    <f7b>   DW_AT_decl_file   : 3
    <f7c>   DW_AT_decl_line   : 27
    <f7d>   DW_AT_decl_column : 3
    <f7e>   DW_AT_type        : <0xeca>
 <1><f82>: Abbrev Number: 5 (DW_TAG_base_type)
    <f83>   DW_AT_byte_size   : 1
    <f84>   DW_AT_encoding    : 6	(signed char)
    <f85>   DW_AT_name        : (indirect string, offset: 0x4c39b): signed char
 <1><f89>: Abbrev Number: 3 (DW_TAG_typedef)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x2be2d): __uint8_t
    <f8e>   DW_AT_decl_file   : 4
    <f8f>   DW_AT_decl_line   : 43
    <f90>   DW_AT_decl_column : 24
    <f91>   DW_AT_type        : <0xf95>
 <1><f95>: Abbrev Number: 5 (DW_TAG_base_type)
    <f96>   DW_AT_byte_size   : 1
    <f97>   DW_AT_encoding    : 8	(unsigned char)
    <f98>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><f9c>: Abbrev Number: 5 (DW_TAG_base_type)
    <f9d>   DW_AT_byte_size   : 2
    <f9e>   DW_AT_encoding    : 5	(signed)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x7278d): short int
 <1><fa3>: Abbrev Number: 3 (DW_TAG_typedef)
    <fa4>   DW_AT_name        : (indirect string, offset: 0x7d80f): __uint16_t
    <fa8>   DW_AT_decl_file   : 4
    <fa9>   DW_AT_decl_line   : 57
    <faa>   DW_AT_decl_column : 25
    <fab>   DW_AT_type        : <0xfaf>
 <1><faf>: Abbrev Number: 5 (DW_TAG_base_type)
    <fb0>   DW_AT_byte_size   : 2
    <fb1>   DW_AT_encoding    : 7	(unsigned)
    <fb2>   DW_AT_name        : (indirect string, offset: 0x93163): short unsigned int
 <1><fb6>: Abbrev Number: 5 (DW_TAG_base_type)
    <fb7>   DW_AT_byte_size   : 4
    <fb8>   DW_AT_encoding    : 5	(signed)
    <fb9>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><fbd>: Abbrev Number: 3 (DW_TAG_typedef)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x60d58): __uint32_t
    <fc2>   DW_AT_decl_file   : 4
    <fc3>   DW_AT_decl_line   : 79
    <fc4>   DW_AT_decl_column : 25
    <fc5>   DW_AT_type        : <0xfc9>
 <1><fc9>: Abbrev Number: 5 (DW_TAG_base_type)
    <fca>   DW_AT_byte_size   : 4
    <fcb>   DW_AT_encoding    : 7	(unsigned)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><fd0>: Abbrev Number: 5 (DW_TAG_base_type)
    <fd1>   DW_AT_byte_size   : 8
    <fd2>   DW_AT_encoding    : 5	(signed)
    <fd3>   DW_AT_name        : (indirect string, offset: 0x44c89): long long int
 <1><fd7>: Abbrev Number: 5 (DW_TAG_base_type)
    <fd8>   DW_AT_byte_size   : 8
    <fd9>   DW_AT_encoding    : 7	(unsigned)
    <fda>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><fde>: Abbrev Number: 22 (DW_TAG_base_type)
    <fdf>   DW_AT_byte_size   : 4
    <fe0>   DW_AT_encoding    : 5	(signed)
    <fe1>   DW_AT_name        : int
 <1><fe5>: Abbrev Number: 5 (DW_TAG_base_type)
    <fe6>   DW_AT_byte_size   : 4
    <fe7>   DW_AT_encoding    : 7	(unsigned)
    <fe8>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><fec>: Abbrev Number: 3 (DW_TAG_typedef)
    <fed>   DW_AT_name        : (indirect string, offset: 0x2be2f): uint8_t
    <ff1>   DW_AT_decl_file   : 5
    <ff2>   DW_AT_decl_line   : 24
    <ff3>   DW_AT_decl_column : 19
    <ff4>   DW_AT_type        : <0xf89>
 <1><ff8>: Abbrev Number: 3 (DW_TAG_typedef)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x6fb41): uint16_t
    <ffd>   DW_AT_decl_file   : 5
    <ffe>   DW_AT_decl_line   : 36
    <fff>   DW_AT_decl_column : 20
    <1000>   DW_AT_type        : <0xfa3>
 <1><1004>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <1005>   DW_AT_type        : <0xff8>
 <1><1009>: Abbrev Number: 3 (DW_TAG_typedef)
    <100a>   DW_AT_name        : (indirect string, offset: 0x6f2a1): uint32_t
    <100e>   DW_AT_decl_file   : 5
    <100f>   DW_AT_decl_line   : 48
    <1010>   DW_AT_decl_column : 20
    <1011>   DW_AT_type        : <0xfbd>
 <1><1015>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <1016>   DW_AT_type        : <0x1009>
 <1><101a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <101b>   DW_AT_byte_size   : 24
    <101c>   DW_AT_decl_file   : 6
    <101d>   DW_AT_decl_line   : 213
    <101e>   DW_AT_decl_column : 9
    <101e>   DW_AT_sibling     : <0x1070>
 <2><1022>: Abbrev Number: 7 (DW_TAG_member)
    <1023>   DW_AT_name        : CR
    <1026>   DW_AT_decl_file   : 6
    <1027>   DW_AT_decl_line   : 215
    <1028>   DW_AT_decl_column : 17
    <1029>   DW_AT_type        : <0x1015>
    <102d>   DW_AT_data_member_location: 0
 <2><102e>: Abbrev Number: 1 (DW_TAG_member)
