Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x7aa (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x3cb40): ../Core/Src/ANALOG.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4a227): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 4 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4c38f): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2be2d): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 4 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><44>: Abbrev Number: 4 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x72789): short int
 <1><4b>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x7d80b): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 4 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x9315f): short unsigned int
 <1><5e>: Abbrev Number: 4 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x60d4c): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 4 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><78>: Abbrev Number: 4 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x44c7d): long long int
 <1><7f>: Abbrev Number: 4 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><86>: Abbrev Number: 16 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 4 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><94>: Abbrev Number: 2 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x2be2f): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x6fb3d): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 2 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x6f29d): uint32_t
    <b6>   DW_AT_decl_file   : 3
    <b7>   DW_AT_decl_line   : 48
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x65>
 <1><bd>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 17 (DW_TAG_array_type)
    <c3>   DW_AT_type        : <0xac>
    <c7>   DW_AT_sibling     : <0xd2>
 <2><cb>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <cc>   DW_AT_type        : <0x8d>
    <d0>   DW_AT_upper_bound : 3
 <2><d1>: Abbrev Number: 0
 <1><d2>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d3>   DW_AT_type        : <0xc2>
 <1><d7>: Abbrev Number: 13 (DW_TAG_variable)
    <d8>   DW_AT_name        : (indirect string, offset: 0x99716): adc_raw_readings
    <dc>   DW_AT_decl_file   : 4
    <dd>   DW_AT_decl_line   : 13
    <de>   DW_AT_decl_column : 26
    <df>   DW_AT_type        : <0xd2>
    <e3>   DW_AT_external    : 1
    <e3>   DW_AT_declaration : 1
 <1><e3>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e4>   DW_AT_byte_size   : 16
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 15
    <e7>   DW_AT_decl_column : 9
    <e7>   DW_AT_sibling     : <0x120>
 <2><eb>: Abbrev Number: 1 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x8a687): windDirection
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 16
    <f2>   DW_AT_decl_column : 8
    <f3>   DW_AT_type        : <0x120>
    <f7>   DW_AT_data_member_location: 0
 <2><f8>: Abbrev Number: 1 (DW_TAG_member)
    <f9>   DW_AT_name        : (indirect string, offset: 0x288c2): batteryVoltage
    <fd>   DW_AT_decl_file   : 4
    <fe>   DW_AT_decl_line   : 17
    <ff>   DW_AT_decl_column : 8
    <100>   DW_AT_type        : <0x120>
    <104>   DW_AT_data_member_location: 4
 <2><105>: Abbrev Number: 1 (DW_TAG_member)
    <106>   DW_AT_name        : (indirect string, offset: 0x61157): extra1
    <10a>   DW_AT_decl_file   : 4
    <10b>   DW_AT_decl_line   : 18
    <10c>   DW_AT_decl_column : 8
    <10d>   DW_AT_type        : <0x120>
    <111>   DW_AT_data_member_location: 8
 <2><112>: Abbrev Number: 1 (DW_TAG_member)
    <113>   DW_AT_name        : (indirect string, offset: 0x6115e): extra2
    <117>   DW_AT_decl_file   : 4
    <118>   DW_AT_decl_line   : 19
    <119>   DW_AT_decl_column : 8
    <11a>   DW_AT_type        : <0x120>
    <11e>   DW_AT_data_member_location: 12
 <2><11f>: Abbrev Number: 0
 <1><120>: Abbrev Number: 4 (DW_TAG_base_type)
    <121>   DW_AT_byte_size   : 4
    <122>   DW_AT_encoding    : 4	(float)
    <123>   DW_AT_name        : (indirect string, offset: 0x83cd8): float
 <1><127>: Abbrev Number: 2 (DW_TAG_typedef)
    <128>   DW_AT_name        : (indirect string, offset: 0x5dcdf): AdcData_t
    <12c>   DW_AT_decl_file   : 4
    <12d>   DW_AT_decl_line   : 20
    <12e>   DW_AT_decl_column : 3
    <12f>   DW_AT_type        : <0xe3>
 <1><133>: Abbrev Number: 9 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 80
    <135>   DW_AT_decl_file   : 5
    <136>   DW_AT_decl_line   : 151
    <137>   DW_AT_decl_column : 9
    <137>   DW_AT_sibling     : <0x232>
 <2><13b>: Abbrev Number: 5 (DW_TAG_member)
    <13c>   DW_AT_name        : SR
    <13f>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 153
    <140>   DW_AT_decl_column : 17
    <140>   DW_AT_type        : <0xbd>
    <144>   DW_AT_data_member_location: 0
 <2><145>: Abbrev Number: 5 (DW_TAG_member)
    <146>   DW_AT_name        : CR1
    <14a>   DW_AT_decl_file   : 5
    <14a>   DW_AT_decl_line   : 154
    <14b>   DW_AT_decl_column : 17
    <14b>   DW_AT_type        : <0xbd>
    <14f>   DW_AT_data_member_location: 4
 <2><150>: Abbrev Number: 5 (DW_TAG_member)
    <151>   DW_AT_name        : CR2
    <155>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 155
    <156>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0xbd>
    <15a>   DW_AT_data_member_location: 8
 <2><15b>: Abbrev Number: 1 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0x89ef7): SMPR1
    <160>   DW_AT_decl_file   : 5
    <161>   DW_AT_decl_line   : 156
    <162>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xbd>
    <167>   DW_AT_data_member_location: 12
 <2><168>: Abbrev Number: 1 (DW_TAG_member)
    <169>   DW_AT_name        : (indirect string, offset: 0x35f3f): SMPR2
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 157
    <16f>   DW_AT_decl_column : 17
    <170>   DW_AT_type        : <0xbd>
    <174>   DW_AT_data_member_location: 16
 <2><175>: Abbrev Number: 1 (DW_TAG_member)
    <176>   DW_AT_name        : (indirect string, offset: 0x343e8): JOFR1
    <17a>   DW_AT_decl_file   : 5
    <17b>   DW_AT_decl_line   : 158
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xbd>
    <181>   DW_AT_data_member_location: 20
 <2><182>: Abbrev Number: 1 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x343ee): JOFR2
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 159
    <189>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xbd>
    <18e>   DW_AT_data_member_location: 24
 <2><18f>: Abbrev Number: 1 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x343f4): JOFR3
    <194>   DW_AT_decl_file   : 5
    <195>   DW_AT_decl_line   : 160
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xbd>
    <19b>   DW_AT_data_member_location: 28
 <2><19c>: Abbrev Number: 1 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0x343fa): JOFR4
    <1a1>   DW_AT_decl_file   : 5
    <1a2>   DW_AT_decl_line   : 161
    <1a3>   DW_AT_decl_column : 17
    <1a4>   DW_AT_type        : <0xbd>
    <1a8>   DW_AT_data_member_location: 32
 <2><1a9>: Abbrev Number: 5 (DW_TAG_member)
    <1aa>   DW_AT_name        : HTR
    <1ae>   DW_AT_decl_file   : 5
    <1ae>   DW_AT_decl_line   : 162
    <1af>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xbd>
    <1b3>   DW_AT_data_member_location: 36
 <2><1b4>: Abbrev Number: 5 (DW_TAG_member)
    <1b5>   DW_AT_name        : LTR
    <1b9>   DW_AT_decl_file   : 5
    <1b9>   DW_AT_decl_line   : 163
    <1ba>   DW_AT_decl_column : 17
    <1ba>   DW_AT_type        : <0xbd>
    <1be>   DW_AT_data_member_location: 40
 <2><1bf>: Abbrev Number: 1 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xc960): SQR1
    <1c4>   DW_AT_decl_file   : 5
    <1c5>   DW_AT_decl_line   : 164
    <1c6>   DW_AT_decl_column : 17
    <1c7>   DW_AT_type        : <0xbd>
    <1cb>   DW_AT_data_member_location: 44
 <2><1cc>: Abbrev Number: 1 (DW_TAG_member)
    <1cd>   DW_AT_name        : (indirect string, offset: 0xb49e): SQR2
    <1d1>   DW_AT_decl_file   : 5
    <1d2>   DW_AT_decl_line   : 165
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0xbd>
    <1d8>   DW_AT_data_member_location: 48
 <2><1d9>: Abbrev Number: 1 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0xb4a3): SQR3
    <1de>   DW_AT_decl_file   : 5
    <1df>   DW_AT_decl_line   : 166
    <1e0>   DW_AT_decl_column : 17
    <1e1>   DW_AT_type        : <0xbd>
    <1e5>   DW_AT_data_member_location: 52
 <2><1e6>: Abbrev Number: 1 (DW_TAG_member)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x75f0f): JSQR
    <1eb>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 167
    <1ed>   DW_AT_decl_column : 17
    <1ee>   DW_AT_type        : <0xbd>
    <1f2>   DW_AT_data_member_location: 56
 <2><1f3>: Abbrev Number: 1 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x6164c): JDR1
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 168
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0xbd>
    <1ff>   DW_AT_data_member_location: 60
 <2><200>: Abbrev Number: 1 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x61651): JDR2
    <205>   DW_AT_decl_file   : 5
    <206>   DW_AT_decl_line   : 169
    <207>   DW_AT_decl_column : 17
    <208>   DW_AT_type        : <0xbd>
    <20c>   DW_AT_data_member_location: 64
 <2><20d>: Abbrev Number: 1 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x61656): JDR3
    <212>   DW_AT_decl_file   : 5
    <213>   DW_AT_decl_line   : 170
    <214>   DW_AT_decl_column : 17
    <215>   DW_AT_type        : <0xbd>
    <219>   DW_AT_data_member_location: 68
 <2><21a>: Abbrev Number: 1 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x284f9): JDR4
    <21f>   DW_AT_decl_file   : 5
    <220>   DW_AT_decl_line   : 171
    <221>   DW_AT_decl_column : 17
    <222>   DW_AT_type        : <0xbd>
    <226>   DW_AT_data_member_location: 72
 <2><227>: Abbrev Number: 5 (DW_TAG_member)
    <228>   DW_AT_name        : DR
    <22b>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 172
    <22c>   DW_AT_decl_column : 17
    <22c>   DW_AT_type        : <0xbd>
    <230>   DW_AT_data_member_location: 76
 <2><231>: Abbrev Number: 0
 <1><232>: Abbrev Number: 2 (DW_TAG_typedef)
    <233>   DW_AT_name        : (indirect string, offset: 0x75e0e): ADC_TypeDef
    <237>   DW_AT_decl_file   : 5
    <238>   DW_AT_decl_line   : 173
    <239>   DW_AT_decl_column : 3
    <23a>   DW_AT_type        : <0x133>
 <1><23e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <23f>   DW_AT_byte_size   : 24
    <240>   DW_AT_decl_file   : 5
    <241>   DW_AT_decl_line   : 213
    <242>   DW_AT_decl_column : 9
    <242>   DW_AT_sibling     : <0x28e>
 <2><246>: Abbrev Number: 5 (DW_TAG_member)
    <247>   DW_AT_name        : CR
    <24a>   DW_AT_decl_file   : 5
    <24a>   DW_AT_decl_line   : 215
    <24b>   DW_AT_decl_column : 17
    <24b>   DW_AT_type        : <0xbd>
    <24f>   DW_AT_data_member_location: 0
 <2><250>: Abbrev Number: 1 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0x4a592): NDTR
    <255>   DW_AT_decl_file   : 5
    <256>   DW_AT_decl_line   : 216
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xbd>
    <25c>   DW_AT_data_member_location: 4
 <2><25d>: Abbrev Number: 5 (DW_TAG_member)
    <25e>   DW_AT_name        : PAR
    <262>   DW_AT_decl_file   : 5
    <262>   DW_AT_decl_line   : 217
    <263>   DW_AT_decl_column : 17
    <263>   DW_AT_type        : <0xbd>
    <267>   DW_AT_data_member_location: 8
 <2><268>: Abbrev Number: 1 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x3e899): M0AR
    <26d>   DW_AT_decl_file   : 5
    <26e>   DW_AT_decl_line   : 218
    <26f>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xbd>
    <274>   DW_AT_data_member_location: 12
 <2><275>: Abbrev Number: 1 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0xddb2): M1AR
    <27a>   DW_AT_decl_file   : 5
    <27b>   DW_AT_decl_line   : 219
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xbd>
    <281>   DW_AT_data_member_location: 16
 <2><282>: Abbrev Number: 5 (DW_TAG_member)
    <283>   DW_AT_name        : FCR
    <287>   DW_AT_decl_file   : 5
    <287>   DW_AT_decl_line   : 220
    <288>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xbd>
    <28c>   DW_AT_data_member_location: 20
 <2><28d>: Abbrev Number: 0
 <1><28e>: Abbrev Number: 2 (DW_TAG_typedef)
    <28f>   DW_AT_name        : (indirect string, offset: 0x8ba87): DMA_Stream_TypeDef
    <293>   DW_AT_decl_file   : 5
    <294>   DW_AT_decl_line   : 221
    <295>   DW_AT_decl_column : 3
    <296>   DW_AT_type        : <0x23e>
 <1><29a>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <29b>   DW_AT_encoding    : 7	(unsigned)
    <29c>   DW_AT_byte_size   : 1
    <29d>   DW_AT_type        : <0x3d>
    <2a1>   DW_AT_decl_file   : 6
    <2a2>   DW_AT_decl_line   : 191
    <2a3>   DW_AT_decl_column : 1
    <2a4>   DW_AT_sibling     : <0x2b5>
 <2><2a8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x47f0e): DISABLE
    <2ad>   DW_AT_const_value : 0
 <2><2ae>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2af>   DW_AT_name        : (indirect string, offset: 0x8bf81): ENABLE
    <2b3>   DW_AT_const_value : 1
 <2><2b4>: Abbrev Number: 0
 <1><2b5>: Abbrev Number: 2 (DW_TAG_typedef)
    <2b6>   DW_AT_name        : (indirect string, offset: 0x9896d): FunctionalState
    <2ba>   DW_AT_decl_file   : 6
    <2bb>   DW_AT_decl_line   : 194
    <2bc>   DW_AT_decl_column : 3
    <2bd>   DW_AT_type        : <0x29a>
 <1><2c1>: Abbrev Number: 4 (DW_TAG_base_type)
    <2c2>   DW_AT_byte_size   : 8
    <2c3>   DW_AT_encoding    : 4	(float)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x7e29a): long double
 <1><2c8>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <2c9>   DW_AT_encoding    : 7	(unsigned)
    <2ca>   DW_AT_byte_size   : 1
    <2cb>   DW_AT_type        : <0x3d>
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 39
    <2d1>   DW_AT_decl_column : 1
    <2d2>   DW_AT_sibling     : <0x2ef>
 <2><2d6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x3300e): HAL_OK
    <2db>   DW_AT_const_value : 0
 <2><2dc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2dd>   DW_AT_name        : (indirect string, offset: 0x5ef1e): HAL_ERROR
    <2e1>   DW_AT_const_value : 1
 <2><2e2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x80720): HAL_BUSY
    <2e7>   DW_AT_const_value : 2
 <2><2e8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x2c349): HAL_TIMEOUT
    <2ed>   DW_AT_const_value : 3
 <2><2ee>: Abbrev Number: 0
 <1><2ef>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x89dbf): HAL_StatusTypeDef
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 44
    <2f6>   DW_AT_decl_column : 3
    <2f7>   DW_AT_type        : <0x2c8>
 <1><2fb>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <2fc>   DW_AT_encoding    : 7	(unsigned)
    <2fd>   DW_AT_byte_size   : 1
    <2fe>   DW_AT_type        : <0x3d>
    <302>   DW_AT_decl_file   : 7
    <303>   DW_AT_decl_line   : 50
    <304>   DW_AT_decl_column : 1
    <305>   DW_AT_sibling     : <0x316>
 <2><309>: Abbrev Number: 3 (DW_TAG_enumerator)
    <30a>   DW_AT_name        : (indirect string, offset: 0x718b7): HAL_UNLOCKED
    <30e>   DW_AT_const_value : 0
 <2><30f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <310>   DW_AT_name        : (indirect string, offset: 0x992df): HAL_LOCKED
    <314>   DW_AT_const_value : 1
 <2><315>: Abbrev Number: 0
 <1><316>: Abbrev Number: 2 (DW_TAG_typedef)
    <317>   DW_AT_name        : (indirect string, offset: 0x5c7d6): HAL_LockTypeDef
    <31b>   DW_AT_decl_file   : 7
    <31c>   DW_AT_decl_line   : 53
    <31d>   DW_AT_decl_column : 3
    <31e>   DW_AT_type        : <0x2fb>
 <1><322>: Abbrev Number: 9 (DW_TAG_structure_type)
    <323>   DW_AT_byte_size   : 48
    <324>   DW_AT_decl_file   : 8
    <325>   DW_AT_decl_line   : 48
    <326>   DW_AT_decl_column : 9
    <326>   DW_AT_sibling     : <0x3c7>
 <2><32a>: Abbrev Number: 1 (DW_TAG_member)
    <32b>   DW_AT_name        : (indirect string, offset: 0x9c299): Channel
    <32f>   DW_AT_decl_file   : 8
    <330>   DW_AT_decl_line   : 50
    <331>   DW_AT_decl_column : 12
    <332>   DW_AT_type        : <0xb1>
    <336>   DW_AT_data_member_location: 0
 <2><337>: Abbrev Number: 1 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0x8a68b): Direction
    <33c>   DW_AT_decl_file   : 8
    <33d>   DW_AT_decl_line   : 53
    <33e>   DW_AT_decl_column : 12
    <33f>   DW_AT_type        : <0xb1>
    <343>   DW_AT_data_member_location: 4
 <2><344>: Abbrev Number: 1 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0xa018): PeriphInc
    <349>   DW_AT_decl_file   : 8
    <34a>   DW_AT_decl_line   : 57
    <34b>   DW_AT_decl_column : 12
    <34c>   DW_AT_type        : <0xb1>
    <350>   DW_AT_data_member_location: 8
 <2><351>: Abbrev Number: 1 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0x178d8): MemInc
    <356>   DW_AT_decl_file   : 8
    <357>   DW_AT_decl_line   : 60
    <358>   DW_AT_decl_column : 12
    <359>   DW_AT_type        : <0xb1>
    <35d>   DW_AT_data_member_location: 12
 <2><35e>: Abbrev Number: 1 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x4baae): PeriphDataAlignment
    <363>   DW_AT_decl_file   : 8
    <364>   DW_AT_decl_line   : 63
    <365>   DW_AT_decl_column : 12
    <366>   DW_AT_type        : <0xb1>
    <36a>   DW_AT_data_member_location: 16
 <2><36b>: Abbrev Number: 1 (DW_TAG_member)
    <36c>   DW_AT_name        : (indirect string, offset: 0x8ae88): MemDataAlignment
    <370>   DW_AT_decl_file   : 8
    <371>   DW_AT_decl_line   : 66
    <372>   DW_AT_decl_column : 12
    <373>   DW_AT_type        : <0xb1>
    <377>   DW_AT_data_member_location: 20
 <2><378>: Abbrev Number: 1 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0x9d780): Mode
    <37d>   DW_AT_decl_file   : 8
    <37e>   DW_AT_decl_line   : 69
    <37f>   DW_AT_decl_column : 12
    <380>   DW_AT_type        : <0xb1>
    <384>   DW_AT_data_member_location: 24
 <2><385>: Abbrev Number: 1 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x9e589): Priority
    <38a>   DW_AT_decl_file   : 8
    <38b>   DW_AT_decl_line   : 74
    <38c>   DW_AT_decl_column : 12
    <38d>   DW_AT_type        : <0xb1>
    <391>   DW_AT_data_member_location: 28
 <2><392>: Abbrev Number: 1 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0x40e86): FIFOMode
    <397>   DW_AT_decl_file   : 8
    <398>   DW_AT_decl_line   : 77
    <399>   DW_AT_decl_column : 12
    <39a>   DW_AT_type        : <0xb1>
    <39e>   DW_AT_data_member_location: 32
 <2><39f>: Abbrev Number: 1 (DW_TAG_member)
    <3a0>   DW_AT_name        : (indirect string, offset: 0x74db4): FIFOThreshold
    <3a4>   DW_AT_decl_file   : 8
    <3a5>   DW_AT_decl_line   : 82
    <3a6>   DW_AT_decl_column : 12
    <3a7>   DW_AT_type        : <0xb1>
    <3ab>   DW_AT_data_member_location: 36
 <2><3ac>: Abbrev Number: 1 (DW_TAG_member)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x3bc69): MemBurst
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 85
    <3b3>   DW_AT_decl_column : 12
    <3b4>   DW_AT_type        : <0xb1>
    <3b8>   DW_AT_data_member_location: 40
 <2><3b9>: Abbrev Number: 1 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x33c81): PeriphBurst
    <3be>   DW_AT_decl_file   : 8
    <3bf>   DW_AT_decl_line   : 91
    <3c0>   DW_AT_decl_column : 12
    <3c1>   DW_AT_type        : <0xb1>
    <3c5>   DW_AT_data_member_location: 44
 <2><3c6>: Abbrev Number: 0
 <1><3c7>: Abbrev Number: 2 (DW_TAG_typedef)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x28c05): DMA_InitTypeDef
    <3cc>   DW_AT_decl_file   : 8
    <3cd>   DW_AT_decl_line   : 96
    <3ce>   DW_AT_decl_column : 2
    <3cf>   DW_AT_type        : <0x322>
 <1><3d3>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <3d4>   DW_AT_encoding    : 7	(unsigned)
    <3d5>   DW_AT_byte_size   : 1
    <3d6>   DW_AT_type        : <0x3d>
    <3da>   DW_AT_decl_file   : 8
    <3db>   DW_AT_decl_line   : 103
    <3dc>   DW_AT_decl_column : 1
    <3dd>   DW_AT_sibling     : <0x406>
 <2><3e1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x72a42): HAL_DMA_STATE_RESET
    <3e6>   DW_AT_const_value : 0
 <2><3e7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x29b4e): HAL_DMA_STATE_READY
    <3ec>   DW_AT_const_value : 1
 <2><3ed>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x696fd): HAL_DMA_STATE_BUSY
    <3f2>   DW_AT_const_value : 2
 <2><3f3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x9709f): HAL_DMA_STATE_TIMEOUT
    <3f8>   DW_AT_const_value : 3
 <2><3f9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x8376f): HAL_DMA_STATE_ERROR
    <3fe>   DW_AT_const_value : 4
 <2><3ff>: Abbrev Number: 3 (DW_TAG_enumerator)
    <400>   DW_AT_name        : (indirect string, offset: 0x227f7): HAL_DMA_STATE_ABORT
    <404>   DW_AT_const_value : 5
 <2><405>: Abbrev Number: 0
 <1><406>: Abbrev Number: 2 (DW_TAG_typedef)
    <407>   DW_AT_name        : (indirect string, offset: 0x54251): HAL_DMA_StateTypeDef
    <40b>   DW_AT_decl_file   : 8
    <40c>   DW_AT_decl_line   : 110
    <40d>   DW_AT_decl_column : 2
    <40e>   DW_AT_type        : <0x3d3>
 <1><412>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <413>   DW_AT_type        : <0x406>
 <1><417>: Abbrev Number: 19 (DW_TAG_structure_type)
    <418>   DW_AT_name        : (indirect string, offset: 0x82ba2): __DMA_HandleTypeDef
    <41c>   DW_AT_byte_size   : 96
    <41d>   DW_AT_decl_file   : 8
    <41e>   DW_AT_decl_line   : 138
    <41f>   DW_AT_decl_column : 16
    <420>   DW_AT_sibling     : <0x4db>
 <2><424>: Abbrev Number: 1 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <429>   DW_AT_decl_file   : 8
    <42a>   DW_AT_decl_line   : 140
    <42b>   DW_AT_decl_column : 31
    <42c>   DW_AT_type        : <0x4db>
    <430>   DW_AT_data_member_location: 0
 <2><431>: Abbrev Number: 1 (DW_TAG_member)
    <432>   DW_AT_name        : (indirect string, offset: 0x9d12f): Init
    <436>   DW_AT_decl_file   : 8
    <437>   DW_AT_decl_line   : 142
    <438>   DW_AT_decl_column : 30
    <439>   DW_AT_type        : <0x3c7>
    <43d>   DW_AT_data_member_location: 4
 <2><43e>: Abbrev Number: 1 (DW_TAG_member)
    <43f>   DW_AT_name        : (indirect string, offset: 0x6ce81): Lock
    <443>   DW_AT_decl_file   : 8
    <444>   DW_AT_decl_line   : 144
    <445>   DW_AT_decl_column : 30
    <446>   DW_AT_type        : <0x316>
    <44a>   DW_AT_data_member_location: 52
 <2><44b>: Abbrev Number: 1 (DW_TAG_member)
    <44c>   DW_AT_name        : (indirect string, offset: 0x9d214): State
    <450>   DW_AT_decl_file   : 8
    <451>   DW_AT_decl_line   : 146
    <452>   DW_AT_decl_column : 30
    <453>   DW_AT_type        : <0x412>
    <457>   DW_AT_data_member_location: 53
 <2><458>: Abbrev Number: 1 (DW_TAG_member)
    <459>   DW_AT_name        : (indirect string, offset: 0x920dd): Parent
    <45d>   DW_AT_decl_file   : 8
    <45e>   DW_AT_decl_line   : 148
    <45f>   DW_AT_decl_column : 31
    <460>   DW_AT_type        : <0x4e0>
    <464>   DW_AT_data_member_location: 56
 <2><465>: Abbrev Number: 1 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0x98b62): XferCpltCallback
    <46a>   DW_AT_decl_file   : 8
    <46b>   DW_AT_decl_line   : 150
    <46c>   DW_AT_decl_column : 33
    <46d>   DW_AT_type        : <0x4f2>
    <471>   DW_AT_data_member_location: 60
 <2><472>: Abbrev Number: 1 (DW_TAG_member)
    <473>   DW_AT_name        : (indirect string, offset: 0x7757f): XferHalfCpltCallback
    <477>   DW_AT_decl_file   : 8
    <478>   DW_AT_decl_line   : 152
    <479>   DW_AT_decl_column : 33
    <47a>   DW_AT_type        : <0x4f2>
    <47e>   DW_AT_data_member_location: 64
 <2><47f>: Abbrev Number: 1 (DW_TAG_member)
    <480>   DW_AT_name        : (indirect string, offset: 0x2421b): XferM1CpltCallback
    <484>   DW_AT_decl_file   : 8
    <485>   DW_AT_decl_line   : 154
    <486>   DW_AT_decl_column : 33
    <487>   DW_AT_type        : <0x4f2>
    <48b>   DW_AT_data_member_location: 68
 <2><48c>: Abbrev Number: 1 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0x54432): XferM1HalfCpltCallback
    <491>   DW_AT_decl_file   : 8
    <492>   DW_AT_decl_line   : 156
    <493>   DW_AT_decl_column : 33
    <494>   DW_AT_type        : <0x4f2>
    <498>   DW_AT_data_member_location: 72
 <2><499>: Abbrev Number: 1 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x15c13): XferErrorCallback
    <49e>   DW_AT_decl_file   : 8
    <49f>   DW_AT_decl_line   : 158
    <4a0>   DW_AT_decl_column : 33
    <4a1>   DW_AT_type        : <0x4f2>
    <4a5>   DW_AT_data_member_location: 76
 <2><4a6>: Abbrev Number: 1 (DW_TAG_member)
    <4a7>   DW_AT_name        : (indirect string, offset: 0x8f71a): XferAbortCallback
    <4ab>   DW_AT_decl_file   : 8
    <4ac>   DW_AT_decl_line   : 160
    <4ad>   DW_AT_decl_column : 33
    <4ae>   DW_AT_type        : <0x4f2>
    <4b2>   DW_AT_data_member_location: 80
 <2><4b3>: Abbrev Number: 1 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x96264): ErrorCode
    <4b8>   DW_AT_decl_file   : 8
    <4b9>   DW_AT_decl_line   : 162
    <4ba>   DW_AT_decl_column : 30
    <4bb>   DW_AT_type        : <0xbd>
    <4bf>   DW_AT_data_member_location: 84
 <2><4c0>: Abbrev Number: 1 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x7413f): StreamBaseAddress
    <4c5>   DW_AT_decl_file   : 8
    <4c6>   DW_AT_decl_line   : 164
    <4c7>   DW_AT_decl_column : 30
    <4c8>   DW_AT_type        : <0xb1>
    <4cc>   DW_AT_data_member_location: 88
 <2><4cd>: Abbrev Number: 1 (DW_TAG_member)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x813d9): StreamIndex
    <4d2>   DW_AT_decl_file   : 8
    <4d3>   DW_AT_decl_line   : 166
    <4d4>   DW_AT_decl_column : 30
    <4d5>   DW_AT_type        : <0xb1>
    <4d9>   DW_AT_data_member_location: 92
 <2><4da>: Abbrev Number: 0
 <1><4db>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4dc>   DW_AT_byte_size   : 4
    <4dc>   DW_AT_type        : <0x28e>
 <1><4e0>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <4e1>   DW_AT_byte_size   : 4
 <1><4e2>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <4e3>   DW_AT_prototyped  : 1
    <4e3>   DW_AT_sibling     : <0x4ed>
 <2><4e7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <4e8>   DW_AT_type        : <0x4ed>
 <2><4ec>: Abbrev Number: 0
 <1><4ed>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4ee>   DW_AT_byte_size   : 4
    <4ee>   DW_AT_type        : <0x417>
 <1><4f2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4f3>   DW_AT_byte_size   : 4
    <4f3>   DW_AT_type        : <0x4e2>
 <1><4f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x82ba4): DMA_HandleTypeDef
    <4fc>   DW_AT_decl_file   : 8
    <4fd>   DW_AT_decl_line   : 168
    <4fe>   DW_AT_decl_column : 2
    <4ff>   DW_AT_type        : <0x417>
 <1><503>: Abbrev Number: 9 (DW_TAG_structure_type)
    <504>   DW_AT_byte_size   : 48
    <505>   DW_AT_decl_file   : 9
    <506>   DW_AT_decl_line   : 59
    <507>   DW_AT_decl_column : 9
    <507>   DW_AT_sibling     : <0x5a8>
 <2><50b>: Abbrev Number: 1 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x87ab2): ClockPrescaler
    <510>   DW_AT_decl_file   : 9
    <511>   DW_AT_decl_line   : 61
    <512>   DW_AT_decl_column : 12
    <513>   DW_AT_type        : <0xb1>
    <517>   DW_AT_data_member_location: 0
 <2><518>: Abbrev Number: 1 (DW_TAG_member)
    <519>   DW_AT_name        : (indirect string, offset: 0xbfc6): Resolution
    <51d>   DW_AT_decl_file   : 9
    <51e>   DW_AT_decl_line   : 64
    <51f>   DW_AT_decl_column : 12
    <520>   DW_AT_type        : <0xb1>
    <524>   DW_AT_data_member_location: 4
 <2><525>: Abbrev Number: 1 (DW_TAG_member)
    <526>   DW_AT_name        : (indirect string, offset: 0x20ed8): DataAlign
    <52a>   DW_AT_decl_file   : 9
    <52b>   DW_AT_decl_line   : 66
    <52c>   DW_AT_decl_column : 12
    <52d>   DW_AT_type        : <0xb1>
    <531>   DW_AT_data_member_location: 8
 <2><532>: Abbrev Number: 1 (DW_TAG_member)
    <533>   DW_AT_name        : (indirect string, offset: 0x5b675): ScanConvMode
    <537>   DW_AT_decl_file   : 9
    <538>   DW_AT_decl_line   : 69
    <539>   DW_AT_decl_column : 12
    <53a>   DW_AT_type        : <0xb1>
    <53e>   DW_AT_data_member_location: 12
 <2><53f>: Abbrev Number: 1 (DW_TAG_member)
    <540>   DW_AT_name        : (indirect string, offset: 0x65574): EOCSelection
    <544>   DW_AT_decl_file   : 9
    <545>   DW_AT_decl_line   : 76
    <546>   DW_AT_decl_column : 12
    <547>   DW_AT_type        : <0xb1>
    <54b>   DW_AT_data_member_location: 16
 <2><54c>: Abbrev Number: 1 (DW_TAG_member)
    <54d>   DW_AT_name        : (indirect string, offset: 0x3f0e4): ContinuousConvMode
    <551>   DW_AT_decl_file   : 9
    <552>   DW_AT_decl_line   : 83
    <553>   DW_AT_decl_column : 19
    <554>   DW_AT_type        : <0x2b5>
    <558>   DW_AT_data_member_location: 20
 <2><559>: Abbrev Number: 1 (DW_TAG_member)
    <55a>   DW_AT_name        : (indirect string, offset: 0x5af65): NbrOfConversion
    <55e>   DW_AT_decl_file   : 9
    <55f>   DW_AT_decl_line   : 86
    <560>   DW_AT_decl_column : 12
    <561>   DW_AT_type        : <0xb1>
    <565>   DW_AT_data_member_location: 24
 <2><566>: Abbrev Number: 1 (DW_TAG_member)
    <567>   DW_AT_name        : (indirect string, offset: 0x39d1b): DiscontinuousConvMode
    <56b>   DW_AT_decl_file   : 9
    <56c>   DW_AT_decl_line   : 89
    <56d>   DW_AT_decl_column : 19
    <56e>   DW_AT_type        : <0x2b5>
    <572>   DW_AT_data_member_location: 28
 <2><573>: Abbrev Number: 1 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0x15ac7): NbrOfDiscConversion
    <578>   DW_AT_decl_file   : 9
    <579>   DW_AT_decl_line   : 93
    <57a>   DW_AT_decl_column : 12
    <57b>   DW_AT_type        : <0xb1>
    <57f>   DW_AT_data_member_location: 32
 <2><580>: Abbrev Number: 1 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0x6e519): ExternalTrigConv
    <585>   DW_AT_decl_file   : 9
    <586>   DW_AT_decl_line   : 96
    <587>   DW_AT_decl_column : 12
    <588>   DW_AT_type        : <0xb1>
    <58c>   DW_AT_data_member_location: 36
 <2><58d>: Abbrev Number: 1 (DW_TAG_member)
    <58e>   DW_AT_name        : (indirect string, offset: 0x297e3): ExternalTrigConvEdge
    <592>   DW_AT_decl_file   : 9
    <593>   DW_AT_decl_line   : 100
    <594>   DW_AT_decl_column : 12
    <595>   DW_AT_type        : <0xb1>
    <599>   DW_AT_data_member_location: 40
 <2><59a>: Abbrev Number: 1 (DW_TAG_member)
    <59b>   DW_AT_name        : (indirect string, offset: 0x3bf49): DMAContinuousRequests
    <59f>   DW_AT_decl_file   : 9
    <5a0>   DW_AT_decl_line   : 103
    <5a1>   DW_AT_decl_column : 19
    <5a2>   DW_AT_type        : <0x2b5>
    <5a6>   DW_AT_data_member_location: 44
 <2><5a7>: Abbrev Number: 0
 <1><5a8>: Abbrev Number: 2 (DW_TAG_typedef)
    <5a9>   DW_AT_name        : (indirect string, offset: 0x237b6): ADC_InitTypeDef
    <5ad>   DW_AT_decl_file   : 9
    <5ae>   DW_AT_decl_line   : 108
    <5af>   DW_AT_decl_column : 3
    <5b0>   DW_AT_type        : <0x503>
 <1><5b4>: Abbrev Number: 9 (DW_TAG_structure_type)
    <5b5>   DW_AT_byte_size   : 72
    <5b6>   DW_AT_decl_file   : 9
    <5b7>   DW_AT_decl_line   : 195
    <5b8>   DW_AT_decl_column : 9
    <5b8>   DW_AT_sibling     : <0x618>
 <2><5bc>: Abbrev Number: 1 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <5c1>   DW_AT_decl_file   : 9
    <5c2>   DW_AT_decl_line   : 198
    <5c3>   DW_AT_decl_column : 34
    <5c4>   DW_AT_type        : <0x618>
    <5c8>   DW_AT_data_member_location: 0
 <2><5c9>: Abbrev Number: 1 (DW_TAG_member)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x9d12f): Init
    <5ce>   DW_AT_decl_file   : 9
    <5cf>   DW_AT_decl_line   : 200
    <5d0>   DW_AT_decl_column : 33
    <5d1>   DW_AT_type        : <0x5a8>
    <5d5>   DW_AT_data_member_location: 4
 <2><5d6>: Abbrev Number: 1 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x2728e): NbrOfCurrentConversionRank
    <5db>   DW_AT_decl_file   : 9
    <5dc>   DW_AT_decl_line   : 202
    <5dd>   DW_AT_decl_column : 33
    <5de>   DW_AT_type        : <0xbd>
    <5e2>   DW_AT_data_member_location: 52
 <2><5e3>: Abbrev Number: 1 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x195b): DMA_Handle
    <5e8>   DW_AT_decl_file   : 9
    <5e9>   DW_AT_decl_line   : 204
    <5ea>   DW_AT_decl_column : 34
    <5eb>   DW_AT_type        : <0x61d>
    <5ef>   DW_AT_data_member_location: 56
 <2><5f0>: Abbrev Number: 1 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x6ce81): Lock
    <5f5>   DW_AT_decl_file   : 9
    <5f6>   DW_AT_decl_line   : 206
    <5f7>   DW_AT_decl_column : 33
    <5f8>   DW_AT_type        : <0x316>
    <5fc>   DW_AT_data_member_location: 60
 <2><5fd>: Abbrev Number: 1 (DW_TAG_member)
    <5fe>   DW_AT_name        : (indirect string, offset: 0x9d214): State
    <602>   DW_AT_decl_file   : 9
    <603>   DW_AT_decl_line   : 208
    <604>   DW_AT_decl_column : 33
    <605>   DW_AT_type        : <0xbd>
    <609>   DW_AT_data_member_location: 64
 <2><60a>: Abbrev Number: 1 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x96264): ErrorCode
    <60f>   DW_AT_decl_file   : 9
    <610>   DW_AT_decl_line   : 210
    <611>   DW_AT_decl_column : 33
    <612>   DW_AT_type        : <0xbd>
    <616>   DW_AT_data_member_location: 68
 <2><617>: Abbrev Number: 0
 <1><618>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <619>   DW_AT_byte_size   : 4
    <619>   DW_AT_type        : <0x232>
 <1><61d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <61e>   DW_AT_byte_size   : 4
    <61e>   DW_AT_type        : <0x4f7>
 <1><622>: Abbrev Number: 2 (DW_TAG_typedef)
    <623>   DW_AT_name        : (indirect string, offset: 0x1e318): ADC_HandleTypeDef
    <627>   DW_AT_decl_file   : 9
    <628>   DW_AT_decl_line   : 220
    <629>   DW_AT_decl_column : 3
    <62a>   DW_AT_type        : <0x5b4>
 <1><62e>: Abbrev Number: 13 (DW_TAG_variable)
    <62f>   DW_AT_name        : (indirect string, offset: 0x3d723): hadc1
    <633>   DW_AT_decl_file   : 10
    <634>   DW_AT_decl_line   : 35
    <635>   DW_AT_decl_column : 26
    <636>   DW_AT_type        : <0x622>
    <63a>   DW_AT_external    : 1
    <63a>   DW_AT_declaration : 1
 <1><63a>: Abbrev Number: 4 (DW_TAG_base_type)
    <63b>   DW_AT_byte_size   : 1
    <63c>   DW_AT_encoding    : 8	(unsigned char)
    <63d>   DW_AT_name        : (indirect string, offset: 0x30e5f): char
 <1><641>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <642>   DW_AT_encoding    : 5	(signed)
    <643>   DW_AT_byte_size   : 4
    <644>   DW_AT_type        : <0x86>
    <648>   DW_AT_decl_file   : 11
    <649>   DW_AT_decl_line   : 176
    <64a>   DW_AT_decl_column : 14
    <64b>   DW_AT_sibling     : <0x683>
 <2><64f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <650>   DW_AT_name        : (indirect string, offset: 0x87e81): osOK
    <654>   DW_AT_const_value : 0
 <2><655>: Abbrev Number: 10 (DW_TAG_enumerator)
    <656>   DW_AT_name        : (indirect string, offset: 0x45c6e): osError
    <65a>   DW_AT_const_value : -1
 <2><65b>: Abbrev Number: 10 (DW_TAG_enumerator)
    <65c>   DW_AT_name        : (indirect string, offset: 0x15ab8): osErrorTimeout
    <660>   DW_AT_const_value : -2
 <2><661>: Abbrev Number: 10 (DW_TAG_enumerator)
    <662>   DW_AT_name        : (indirect string, offset: 0x631b6): osErrorResource
    <666>   DW_AT_const_value : -3
 <2><667>: Abbrev Number: 10 (DW_TAG_enumerator)
    <668>   DW_AT_name        : (indirect string, offset: 0x276ea): osErrorParameter
    <66c>   DW_AT_const_value : -4
 <2><66d>: Abbrev Number: 10 (DW_TAG_enumerator)
    <66e>   DW_AT_name        : (indirect string, offset: 0x1a2c4): osErrorNoMemory
    <672>   DW_AT_const_value : -5
 <2><673>: Abbrev Number: 10 (DW_TAG_enumerator)
    <674>   DW_AT_name        : (indirect string, offset: 0x28f14): osErrorISR
    <678>   DW_AT_const_value : -6
 <2><679>: Abbrev Number: 22 (DW_TAG_enumerator)
    <67a>   DW_AT_name        : (indirect string, offset: 0x4cc25): osStatusReserved
    <67e>   DW_AT_const_value : 0x7fffffff
 <2><682>: Abbrev Number: 0
 <1><683>: Abbrev Number: 2 (DW_TAG_typedef)
    <684>   DW_AT_name        : (indirect string, offset: 0x33983): osStatus_t
    <688>   DW_AT_decl_file   : 11
    <689>   DW_AT_decl_line   : 185
    <68a>   DW_AT_decl_column : 3
    <68b>   DW_AT_type        : <0x641>
 <1><68f>: Abbrev Number: 2 (DW_TAG_typedef)
    <690>   DW_AT_name        : (indirect string, offset: 0x43dff): osMessageQueueId_t
    <694>   DW_AT_decl_file   : 11
    <695>   DW_AT_decl_line   : 207
    <696>   DW_AT_decl_column : 15
    <697>   DW_AT_type        : <0x4e0>
 <1><69b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <69c>   DW_AT_byte_size   : 4
    <69c>   DW_AT_type        : <0x6a0>
 <1><6a0>: Abbrev Number: 23 (DW_TAG_const_type)
 <1><6a1>: Abbrev Number: 13 (DW_TAG_variable)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x74454): adcQueueHandle
    <6a6>   DW_AT_decl_file   : 1
    <6a7>   DW_AT_decl_line   : 12
    <6a8>   DW_AT_decl_column : 27
    <6a9>   DW_AT_type        : <0x68f>
    <6ad>   DW_AT_external    : 1
    <6ad>   DW_AT_declaration : 1
 <1><6ad>: Abbrev Number: 24 (DW_TAG_variable)
    <6ae>   DW_AT_specification: <0xd7>
    <6b2>   DW_AT_decl_file   : 1
    <6b3>   DW_AT_decl_column : 19
    <6b4>   DW_AT_location    : 5 byte block: 3 8c 0 0 20 	(DW_OP_addr: 2000008c)
 <1><6ba>: Abbrev Number: 8 (DW_TAG_variable)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x90872): windDirectionGain
    <6bf>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 15
    <6c0>   DW_AT_decl_column : 7
    <6c0>   DW_AT_type        : <0x120>
    <6c4>   DW_AT_external    : 1
    <6c4>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><6ca>: Abbrev Number: 8 (DW_TAG_variable)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x98b8b): windDirectionOffset
    <6cf>   DW_AT_decl_file   : 1
    <6cf>   DW_AT_decl_line   : 16
    <6d0>   DW_AT_decl_column : 7
    <6d0>   DW_AT_type        : <0x120>
    <6d4>   DW_AT_external    : 1
    <6d4>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><6da>: Abbrev Number: 8 (DW_TAG_variable)
    <6db>   DW_AT_name        : (indirect string, offset: 0x76b31): batteryVoltageGain
    <6df>   DW_AT_decl_file   : 1
    <6df>   DW_AT_decl_line   : 18
    <6e0>   DW_AT_decl_column : 7
    <6e0>   DW_AT_type        : <0x120>
    <6e4>   DW_AT_external    : 1
    <6e4>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><6ea>: Abbrev Number: 8 (DW_TAG_variable)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x76fef): batteryVoltageOffset
    <6ef>   DW_AT_decl_file   : 1
    <6ef>   DW_AT_decl_line   : 19
    <6f0>   DW_AT_decl_column : 7
    <6f0>   DW_AT_type        : <0x120>
    <6f4>   DW_AT_external    : 1
    <6f4>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><6fa>: Abbrev Number: 8 (DW_TAG_variable)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x614b1): extra1Gain
    <6ff>   DW_AT_decl_file   : 1
    <6ff>   DW_AT_decl_line   : 21
    <700>   DW_AT_decl_column : 7
    <700>   DW_AT_type        : <0x120>
    <704>   DW_AT_external    : 1
    <704>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><70a>: Abbrev Number: 8 (DW_TAG_variable)
    <70b>   DW_AT_name        : (indirect string, offset: 0x4029): extra1Offset
    <70f>   DW_AT_decl_file   : 1
    <70f>   DW_AT_decl_line   : 22
    <710>   DW_AT_decl_column : 7
    <710>   DW_AT_type        : <0x120>
    <714>   DW_AT_external    : 1
    <714>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><71a>: Abbrev Number: 8 (DW_TAG_variable)
    <71b>   DW_AT_name        : (indirect string, offset: 0x93a89): extra2Gain
    <71f>   DW_AT_decl_file   : 1
    <71f>   DW_AT_decl_line   : 24
    <720>   DW_AT_decl_column : 7
    <720>   DW_AT_type        : <0x120>
    <724>   DW_AT_external    : 1
    <724>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <1><72a>: Abbrev Number: 8 (DW_TAG_variable)
    <72b>   DW_AT_name        : (indirect string, offset: 0x5a613): extra2Offset
    <72f>   DW_AT_decl_file   : 1
    <72f>   DW_AT_decl_line   : 25
    <730>   DW_AT_decl_column : 7
    <730>   DW_AT_type        : <0x120>
    <734>   DW_AT_external    : 1
    <734>   DW_AT_location    : 5 byte block: 3 a0 0 0 20 	(DW_OP_addr: 200000a0)
 <1><73a>: Abbrev Number: 14 (DW_TAG_subprogram)
    <73b>   DW_AT_external    : 1
    <73b>   DW_AT_name        : (indirect string, offset: 0x6d5cb): osMessageQueuePut
    <73f>   DW_AT_decl_file   : 11
    <740>   DW_AT_decl_line   : 689
    <742>   DW_AT_decl_column : 12
    <743>   DW_AT_prototyped  : 1
    <743>   DW_AT_type        : <0x683>
    <747>   DW_AT_declaration : 1
    <747>   DW_AT_sibling     : <0x760>
 <2><74b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <74c>   DW_AT_type        : <0x68f>
 <2><750>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <751>   DW_AT_type        : <0x69b>
 <2><755>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <756>   DW_AT_type        : <0x94>
 <2><75a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <75b>   DW_AT_type        : <0xb1>
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 14 (DW_TAG_subprogram)
    <761>   DW_AT_external    : 1
    <761>   DW_AT_name        : (indirect string, offset: 0x99f23): HAL_ADC_Start_DMA
    <765>   DW_AT_decl_file   : 9
    <766>   DW_AT_decl_line   : 594
    <768>   DW_AT_decl_column : 19
    <769>   DW_AT_prototyped  : 1
    <769>   DW_AT_type        : <0x2ef>
    <76d>   DW_AT_declaration : 1
    <76d>   DW_AT_sibling     : <0x781>
 <2><771>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <772>   DW_AT_type        : <0x781>
 <2><776>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <777>   DW_AT_type        : <0x786>
 <2><77b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77c>   DW_AT_type        : <0xb1>
 <2><780>: Abbrev Number: 0
 <1><781>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <782>   DW_AT_byte_size   : 4
    <782>   DW_AT_type        : <0x622>
 <1><786>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <787>   DW_AT_byte_size   : 4
    <787>   DW_AT_type        : <0xb1>
 <1><78b>: Abbrev Number: 25 (DW_TAG_subprogram)
    <78c>   DW_AT_external    : 1
    <78c>   DW_AT_name        : (indirect string, offset: 0x4bf50): adc_read
    <790>   DW_AT_decl_file   : 1
    <791>   DW_AT_decl_line   : 27
    <792>   DW_AT_decl_column : 6
    <793>   DW_AT_prototyped  : 1
    <793>   DW_AT_low_pc      : 0x80004d0
    <797>   DW_AT_high_pc     : 0xec
    <79b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <79d>   DW_AT_call_all_tail_calls: 1
 <2><79d>: Abbrev Number: 26 (DW_TAG_variable)
    <79e>   DW_AT_name        : (indirect string, offset: 0x6b83b): adcData
    <7a2>   DW_AT_decl_file   : 1
    <7a3>   DW_AT_decl_line   : 32
    <7a4>   DW_AT_decl_column : 15
    <7a5>   DW_AT_type        : <0x127>
    <7a9>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><7ac>: Abbrev Number: 0
 <1><7ad>: Abbrev Number: 0
  Compilation Unit @ offset 0x7ae:
   Length:        0x1b1 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x163
   Pointer Size:  4
 <0><7ba>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <7bb>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <7bf>   DW_AT_language    : 29	(C11)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x9ace5): ../Core/Src/CONTROL.c
    <7c4>   DW_AT_comp_dir    : (indirect string, offset: 0x4a227): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <7c8>   DW_AT_ranges      : 0x20
    <7cc>   DW_AT_low_pc      : 0
    <7d0>   DW_AT_stmt_list   : 0x9c3
    <7d4>   DW_AT_macros      : 0x16675
 <1><7d8>: Abbrev Number: 1 (DW_TAG_base_type)
    <7d9>   DW_AT_byte_size   : 1
    <7da>   DW_AT_encoding    : 6	(signed char)
    <7db>   DW_AT_name        : (indirect string, offset: 0x4c38f): signed char
 <1><7df>: Abbrev Number: 2 (DW_TAG_typedef)
    <7e0>   DW_AT_name        : (indirect string, offset: 0x2be2d): __uint8_t
    <7e4>   DW_AT_decl_file   : 2
    <7e5>   DW_AT_decl_line   : 43
    <7e6>   DW_AT_decl_column : 24
    <7e7>   DW_AT_type        : <0x7eb>
 <1><7eb>: Abbrev Number: 1 (DW_TAG_base_type)
    <7ec>   DW_AT_byte_size   : 1
    <7ed>   DW_AT_encoding    : 8	(unsigned char)
    <7ee>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><7f2>: Abbrev Number: 1 (DW_TAG_base_type)
    <7f3>   DW_AT_byte_size   : 2
    <7f4>   DW_AT_encoding    : 5	(signed)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x72789): short int
 <1><7f9>: Abbrev Number: 1 (DW_TAG_base_type)
    <7fa>   DW_AT_byte_size   : 2
    <7fb>   DW_AT_encoding    : 7	(unsigned)
    <7fc>   DW_AT_name        : (indirect string, offset: 0x9315f): short unsigned int
 <1><800>: Abbrev Number: 1 (DW_TAG_base_type)
    <801>   DW_AT_byte_size   : 4
    <802>   DW_AT_encoding    : 5	(signed)
    <803>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><807>: Abbrev Number: 2 (DW_TAG_typedef)
    <808>   DW_AT_name        : (indirect string, offset: 0x60d4c): __uint32_t
    <80c>   DW_AT_decl_file   : 2
    <80d>   DW_AT_decl_line   : 79
    <80e>   DW_AT_decl_column : 25
    <80f>   DW_AT_type        : <0x813>
 <1><813>: Abbrev Number: 1 (DW_TAG_base_type)
    <814>   DW_AT_byte_size   : 4
    <815>   DW_AT_encoding    : 7	(unsigned)
    <816>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><81a>: Abbrev Number: 1 (DW_TAG_base_type)
    <81b>   DW_AT_byte_size   : 8
    <81c>   DW_AT_encoding    : 5	(signed)
    <81d>   DW_AT_name        : (indirect string, offset: 0x44c7d): long long int
 <1><821>: Abbrev Number: 1 (DW_TAG_base_type)
    <822>   DW_AT_byte_size   : 8
    <823>   DW_AT_encoding    : 7	(unsigned)
    <824>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><828>: Abbrev Number: 7 (DW_TAG_base_type)
    <829>   DW_AT_byte_size   : 4
    <82a>   DW_AT_encoding    : 5	(signed)
    <82b>   DW_AT_name        : int
 <1><82f>: Abbrev Number: 1 (DW_TAG_base_type)
    <830>   DW_AT_byte_size   : 4
    <831>   DW_AT_encoding    : 7	(unsigned)
    <832>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><836>: Abbrev Number: 2 (DW_TAG_typedef)
    <837>   DW_AT_name        : (indirect string, offset: 0x2be2f): uint8_t
    <83b>   DW_AT_decl_file   : 3
    <83c>   DW_AT_decl_line   : 24
    <83d>   DW_AT_decl_column : 19
    <83e>   DW_AT_type        : <0x7df>
 <1><842>: Abbrev Number: 2 (DW_TAG_typedef)
    <843>   DW_AT_name        : (indirect string, offset: 0x6f29d): uint32_t
    <847>   DW_AT_decl_file   : 3
    <848>   DW_AT_decl_line   : 48
    <849>   DW_AT_decl_column : 20
    <84a>   DW_AT_type        : <0x807>
 <1><84e>: Abbrev Number: 1 (DW_TAG_base_type)
    <84f>   DW_AT_byte_size   : 8
    <850>   DW_AT_encoding    : 4	(float)
    <851>   DW_AT_name        : (indirect string, offset: 0x7e29a): long double
 <1><855>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <856>   DW_AT_byte_size   : 4
 <1><857>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <858>   DW_AT_byte_size   : 4
    <859>   DW_AT_type        : <0x836>
 <1><85d>: Abbrev Number: 1 (DW_TAG_base_type)
    <85e>   DW_AT_byte_size   : 1
    <85f>   DW_AT_encoding    : 8	(unsigned char)
    <860>   DW_AT_name        : (indirect string, offset: 0x30e5f): char
 <1><864>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <865>   DW_AT_encoding    : 5	(signed)
    <866>   DW_AT_byte_size   : 4
    <867>   DW_AT_type        : <0x828>
    <86b>   DW_AT_decl_file   : 4
    <86c>   DW_AT_decl_line   : 176
    <86d>   DW_AT_decl_column : 14
    <86e>   DW_AT_sibling     : <0x8a6>
 <2><872>: Abbrev Number: 11 (DW_TAG_enumerator)
    <873>   DW_AT_name        : (indirect string, offset: 0x87e81): osOK
    <877>   DW_AT_const_value : 0
 <2><878>: Abbrev Number: 3 (DW_TAG_enumerator)
    <879>   DW_AT_name        : (indirect string, offset: 0x45c6e): osError
    <87d>   DW_AT_const_value : -1
 <2><87e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <87f>   DW_AT_name        : (indirect string, offset: 0x15ab8): osErrorTimeout
    <883>   DW_AT_const_value : -2
 <2><884>: Abbrev Number: 3 (DW_TAG_enumerator)
    <885>   DW_AT_name        : (indirect string, offset: 0x631b6): osErrorResource
    <889>   DW_AT_const_value : -3
 <2><88a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <88b>   DW_AT_name        : (indirect string, offset: 0x276ea): osErrorParameter
    <88f>   DW_AT_const_value : -4
 <2><890>: Abbrev Number: 3 (DW_TAG_enumerator)
    <891>   DW_AT_name        : (indirect string, offset: 0x1a2c4): osErrorNoMemory
    <895>   DW_AT_const_value : -5
 <2><896>: Abbrev Number: 3 (DW_TAG_enumerator)
    <897>   DW_AT_name        : (indirect string, offset: 0x28f14): osErrorISR
    <89b>   DW_AT_const_value : -6
 <2><89c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <89d>   DW_AT_name        : (indirect string, offset: 0x4cc25): osStatusReserved
    <8a1>   DW_AT_const_value : 0x7fffffff
 <2><8a5>: Abbrev Number: 0
 <1><8a6>: Abbrev Number: 2 (DW_TAG_typedef)
    <8a7>   DW_AT_name        : (indirect string, offset: 0x33983): osStatus_t
    <8ab>   DW_AT_decl_file   : 4
    <8ac>   DW_AT_decl_line   : 185
    <8ad>   DW_AT_decl_column : 3
    <8ae>   DW_AT_type        : <0x864>
 <1><8b2>: Abbrev Number: 2 (DW_TAG_typedef)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x43dff): osMessageQueueId_t
    <8b7>   DW_AT_decl_file   : 4
    <8b8>   DW_AT_decl_line   : 207
    <8b9>   DW_AT_decl_column : 15
    <8ba>   DW_AT_type        : <0x855>
 <1><8be>: Abbrev Number: 13 (DW_TAG_structure_type)
    <8bf>   DW_AT_byte_size   : 16
    <8c0>   DW_AT_decl_file   : 5
    <8c1>   DW_AT_decl_line   : 15
    <8c2>   DW_AT_decl_column : 9
    <8c3>   DW_AT_sibling     : <0x8f4>
 <2><8c7>: Abbrev Number: 4 (DW_TAG_member)
    <8c8>   DW_AT_name        : (indirect string, offset: 0x8a687): windDirection
    <8cc>   DW_AT_decl_file   : 5
    <8cc>   DW_AT_decl_line   : 16
    <8cd>   DW_AT_decl_column : 8
    <8cd>   DW_AT_type        : <0x8f4>
    <8d1>   DW_AT_data_member_location: 0
 <2><8d2>: Abbrev Number: 4 (DW_TAG_member)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x288c2): batteryVoltage
    <8d7>   DW_AT_decl_file   : 5
    <8d7>   DW_AT_decl_line   : 17
    <8d8>   DW_AT_decl_column : 8
    <8d8>   DW_AT_type        : <0x8f4>
    <8dc>   DW_AT_data_member_location: 4
 <2><8dd>: Abbrev Number: 4 (DW_TAG_member)
    <8de>   DW_AT_name        : (indirect string, offset: 0x61157): extra1
    <8e2>   DW_AT_decl_file   : 5
    <8e2>   DW_AT_decl_line   : 18
    <8e3>   DW_AT_decl_column : 8
    <8e3>   DW_AT_type        : <0x8f4>
    <8e7>   DW_AT_data_member_location: 8
 <2><8e8>: Abbrev Number: 4 (DW_TAG_member)
    <8e9>   DW_AT_name        : (indirect string, offset: 0x6115e): extra2
    <8ed>   DW_AT_decl_file   : 5
    <8ed>   DW_AT_decl_line   : 19
    <8ee>   DW_AT_decl_column : 8
    <8ee>   DW_AT_type        : <0x8f4>
    <8f2>   DW_AT_data_member_location: 12
 <2><8f3>: Abbrev Number: 0
 <1><8f4>: Abbrev Number: 1 (DW_TAG_base_type)
    <8f5>   DW_AT_byte_size   : 4
    <8f6>   DW_AT_encoding    : 4	(float)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x83cd8): float
 <1><8fb>: Abbrev Number: 2 (DW_TAG_typedef)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x5dcdf): AdcData_t
    <900>   DW_AT_decl_file   : 5
    <901>   DW_AT_decl_line   : 20
    <902>   DW_AT_decl_column : 3
    <903>   DW_AT_type        : <0x8be>
 <1><907>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <908>   DW_AT_type        : <0x8fb>
 <1><90c>: Abbrev Number: 15 (DW_TAG_variable)
    <90d>   DW_AT_name        : (indirect string, offset: 0x74454): adcQueueHandle
    <911>   DW_AT_decl_file   : 1
    <912>   DW_AT_decl_line   : 13
    <913>   DW_AT_decl_column : 27
    <914>   DW_AT_type        : <0x8b2>
    <918>   DW_AT_external    : 1
    <918>   DW_AT_declaration : 1
 <1><918>: Abbrev Number: 16 (DW_TAG_variable)
    <919>   DW_AT_name        : (indirect string, offset: 0x9b2f0): adcDataReceived
    <91d>   DW_AT_decl_file   : 1
    <91e>   DW_AT_decl_line   : 16
    <91f>   DW_AT_decl_column : 20
    <920>   DW_AT_type        : <0x907>
    <924>   DW_AT_external    : 1
    <924>   DW_AT_location    : 5 byte block: 3 a4 0 0 20 	(DW_OP_addr: 200000a4)
 <1><92a>: Abbrev Number: 17 (DW_TAG_subprogram)
    <92b>   DW_AT_external    : 1
    <92b>   DW_AT_name        : (indirect string, offset: 0x9a2af): osMessageQueueGet
    <92f>   DW_AT_decl_file   : 4
    <930>   DW_AT_decl_line   : 697
    <932>   DW_AT_decl_column : 12
    <933>   DW_AT_prototyped  : 1
    <933>   DW_AT_type        : <0x8a6>
    <937>   DW_AT_declaration : 1
    <937>   DW_AT_sibling     : <0x950>
 <2><93b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <93c>   DW_AT_type        : <0x8b2>
 <2><940>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <941>   DW_AT_type        : <0x855>
 <2><945>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <946>   DW_AT_type        : <0x857>
 <2><94a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <94b>   DW_AT_type        : <0x842>
 <2><94f>: Abbrev Number: 0
 <1><950>: Abbrev Number: 18 (DW_TAG_subprogram)
    <951>   DW_AT_external    : 1
    <951>   DW_AT_name        : (indirect string, offset: 0x9ab2d): control
    <955>   DW_AT_decl_file   : 1
    <956>   DW_AT_decl_line   : 18
    <957>   DW_AT_decl_column : 6
    <958>   DW_AT_prototyped  : 1
    <958>   DW_AT_low_pc      : 0x80005bc
    <95c>   DW_AT_high_pc     : 0x20
    <960>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <962>   DW_AT_call_all_tail_calls: 1
 <1><962>: Abbrev Number: 0
  Compilation Unit @ offset 0x963:
   Length:        0x40 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x262
   Pointer Size:  4
 <0><96f>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <970>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <974>   DW_AT_language    : 29	(C11)
    <975>   DW_AT_name        : (indirect string, offset: 0x9b593): ../Core/Src/IMU.c
    <979>   DW_AT_comp_dir    : (indirect string, offset: 0x4a227): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <97d>   DW_AT_ranges      : 0x33
    <981>   DW_AT_low_pc      : 0
    <985>   DW_AT_stmt_list   : 0xffb
    <989>   DW_AT_macros      : 0x16db5
 <1><98d>: Abbrev Number: 2 (DW_TAG_base_type)
    <98e>   DW_AT_byte_size   : 4
    <98f>   DW_AT_encoding    : 4	(float)
    <990>   DW_AT_name        : (indirect string, offset: 0x83cd8): float
 <1><994>: Abbrev Number: 3 (DW_TAG_subprogram)
    <995>   DW_AT_external    : 1
    <995>   DW_AT_name        : (indirect string, offset: 0x9b57e): imu_read
    <999>   DW_AT_decl_file   : 1
    <99a>   DW_AT_decl_line   : 10
    <99b>   DW_AT_decl_column : 6
    <99c>   DW_AT_prototyped  : 1
    <99c>   DW_AT_low_pc      : 0x80005dc
    <9a0>   DW_AT_high_pc     : 0xe
    <9a4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9a6>   DW_AT_call_all_calls: 1
 <1><9a6>: Abbrev Number: 0
  Compilation Unit @ offset 0x9a7:
   Length:        0x86 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x29c
   Pointer Size:  4
 <0><9b3>: Abbrev Number: 2 (DW_TAG_compile_unit)
    <9b4>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <9b8>   DW_AT_language    : 29	(C11)
    <9b9>   DW_AT_name        : (indirect string, offset: 0x9b5a5): ../Core/Src/TELEMETRY.c
    <9bd>   DW_AT_comp_dir    : (indirect string, offset: 0x4a227): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <9c1>   DW_AT_ranges      : 0x46
    <9c5>   DW_AT_low_pc      : 0
    <9c9>   DW_AT_stmt_list   : 0x1056
    <9cd>   DW_AT_macros      : 0x16dd0
 <1><9d1>: Abbrev Number: 1 (DW_TAG_base_type)
    <9d2>   DW_AT_byte_size   : 1
    <9d3>   DW_AT_encoding    : 6	(signed char)
    <9d4>   DW_AT_name        : (indirect string, offset: 0x4c38f): signed char
 <1><9d8>: Abbrev Number: 1 (DW_TAG_base_type)
    <9d9>   DW_AT_byte_size   : 1
    <9da>   DW_AT_encoding    : 8	(unsigned char)
    <9db>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><9df>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e0>   DW_AT_byte_size   : 2
    <9e1>   DW_AT_encoding    : 5	(signed)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x72789): short int
 <1><9e6>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e7>   DW_AT_byte_size   : 2
    <9e8>   DW_AT_encoding    : 7	(unsigned)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x9315f): short unsigned int
 <1><9ed>: Abbrev Number: 1 (DW_TAG_base_type)
    <9ee>   DW_AT_byte_size   : 4
    <9ef>   DW_AT_encoding    : 5	(signed)
    <9f0>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><9f4>: Abbrev Number: 1 (DW_TAG_base_type)
    <9f5>   DW_AT_byte_size   : 4
    <9f6>   DW_AT_encoding    : 7	(unsigned)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><9fb>: Abbrev Number: 1 (DW_TAG_base_type)
    <9fc>   DW_AT_byte_size   : 8
    <9fd>   DW_AT_encoding    : 5	(signed)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x44c7d): long long int
 <1><a02>: Abbrev Number: 1 (DW_TAG_base_type)
    <a03>   DW_AT_byte_size   : 8
    <a04>   DW_AT_encoding    : 7	(unsigned)
    <a05>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><a09>: Abbrev Number: 3 (DW_TAG_base_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_encoding    : 5	(signed)
    <a0c>   DW_AT_name        : int
 <1><a10>: Abbrev Number: 1 (DW_TAG_base_type)
    <a11>   DW_AT_byte_size   : 4
    <a12>   DW_AT_encoding    : 7	(unsigned)
    <a13>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><a17>: Abbrev Number: 1 (DW_TAG_base_type)
    <a18>   DW_AT_byte_size   : 4
    <a19>   DW_AT_encoding    : 4	(float)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x83cd8): float
 <1><a1e>: Abbrev Number: 4 (DW_TAG_subprogram)
    <a1f>   DW_AT_external    : 1
    <a1f>   DW_AT_name        : (indirect string, offset: 0x9b5bd): telemetry
    <a23>   DW_AT_decl_file   : 1
    <a24>   DW_AT_decl_line   : 10
    <a25>   DW_AT_decl_column : 6
    <a26>   DW_AT_prototyped  : 1
    <a26>   DW_AT_low_pc      : 0x80005ea
    <a2a>   DW_AT_high_pc     : 0xe
    <a2e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a30>   DW_AT_call_all_calls: 1
 <1><a30>: Abbrev Number: 0
  Compilation Unit @ offset 0xa31:
   Length:        0xa02 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2e1
   Pointer Size:  4
 <0><a3d>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <a3e>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a42>   DW_AT_language    : 29	(C11)
    <a43>   DW_AT_name        : (indirect string, offset: 0x9b756): ../Core/Src/adc.c
    <a47>   DW_AT_comp_dir    : (indirect string, offset: 0x4a227): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <a4b>   DW_AT_ranges      : 0x59
    <a4f>   DW_AT_low_pc      : 0
    <a53>   DW_AT_stmt_list   : 0x13e3
    <a57>   DW_AT_macros      : 0x16e5b
 <1><a5b>: Abbrev Number: 5 (DW_TAG_base_type)
    <a5c>   DW_AT_byte_size   : 1
    <a5d>   DW_AT_encoding    : 6	(signed char)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x4c38f): signed char
 <1><a62>: Abbrev Number: 5 (DW_TAG_base_type)
    <a63>   DW_AT_byte_size   : 1
    <a64>   DW_AT_encoding    : 8	(unsigned char)
    <a65>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><a69>: Abbrev Number: 5 (DW_TAG_base_type)
    <a6a>   DW_AT_byte_size   : 2
    <a6b>   DW_AT_encoding    : 5	(signed)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x72789): short int
 <1><a70>: Abbrev Number: 3 (DW_TAG_typedef)
    <a71>   DW_AT_name        : (indirect string, offset: 0x7d80b): __uint16_t
    <a75>   DW_AT_decl_file   : 2
    <a76>   DW_AT_decl_line   : 57
    <a77>   DW_AT_decl_column : 25
    <a78>   DW_AT_type        : <0xa7c>
 <1><a7c>: Abbrev Number: 5 (DW_TAG_base_type)
    <a7d>   DW_AT_byte_size   : 2
    <a7e>   DW_AT_encoding    : 7	(unsigned)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x9315f): short unsigned int
 <1><a83>: Abbrev Number: 5 (DW_TAG_base_type)
    <a84>   DW_AT_byte_size   : 4
    <a85>   DW_AT_encoding    : 5	(signed)
    <a86>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><a8a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x60d4c): __uint32_t
    <a8f>   DW_AT_decl_file   : 2
    <a90>   DW_AT_decl_line   : 79
    <a91>   DW_AT_decl_column : 25
    <a92>   DW_AT_type        : <0xa96>
 <1><a96>: Abbrev Number: 5 (DW_TAG_base_type)
    <a97>   DW_AT_byte_size   : 4
    <a98>   DW_AT_encoding    : 7	(unsigned)
    <a99>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><a9d>: Abbrev Number: 5 (DW_TAG_base_type)
    <a9e>   DW_AT_byte_size   : 8
    <a9f>   DW_AT_encoding    : 5	(signed)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x44c7d): long long int
 <1><aa4>: Abbrev Number: 5 (DW_TAG_base_type)
    <aa5>   DW_AT_byte_size   : 8
    <aa6>   DW_AT_encoding    : 7	(unsigned)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><aab>: Abbrev Number: 23 (DW_TAG_base_type)
    <aac>   DW_AT_byte_size   : 4
    <aad>   DW_AT_encoding    : 5	(signed)
    <aae>   DW_AT_name        : int
 <1><ab2>: Abbrev Number: 5 (DW_TAG_base_type)
    <ab3>   DW_AT_byte_size   : 4
    <ab4>   DW_AT_encoding    : 7	(unsigned)
    <ab5>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><ab9>: Abbrev Number: 3 (DW_TAG_typedef)
    <aba>   DW_AT_name        : (indirect string, offset: 0x6fb3d): uint16_t
    <abe>   DW_AT_decl_file   : 3
    <abf>   DW_AT_decl_line   : 36
    <ac0>   DW_AT_decl_column : 20
    <ac1>   DW_AT_type        : <0xa70>
 <1><ac5>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x6f29d): uint32_t
    <aca>   DW_AT_decl_file   : 3
    <acb>   DW_AT_decl_line   : 48
    <acc>   DW_AT_decl_column : 20
    <acd>   DW_AT_type        : <0xa8a>
 <1><ad1>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <ad2>   DW_AT_type        : <0xac5>
 <1><ad6>: Abbrev Number: 15 (DW_TAG_array_type)
    <ad7>   DW_AT_type        : <0xac5>
    <adb>   DW_AT_sibling     : <0xae6>
 <2><adf>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <ae0>   DW_AT_type        : <0xab2>
    <ae4>   DW_AT_upper_bound : 0
 <2><ae5>: Abbrev Number: 0
 <1><ae6>: Abbrev Number: 15 (DW_TAG_array_type)
    <ae7>   DW_AT_type        : <0xac5>
    <aeb>   DW_AT_sibling     : <0xaf6>
 <2><aef>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <af0>   DW_AT_type        : <0xab2>
    <af4>   DW_AT_upper_bound : 1
 <2><af5>: Abbrev Number: 0
 <1><af6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <af7>   DW_AT_byte_size   : 80
    <af8>   DW_AT_decl_file   : 4
    <af9>   DW_AT_decl_line   : 151
    <afa>   DW_AT_decl_column : 9
    <afa>   DW_AT_sibling     : <0xc01>
 <2><afe>: Abbrev Number: 6 (DW_TAG_member)
    <aff>   DW_AT_name        : SR
    <b02>   DW_AT_decl_file   : 4
    <b03>   DW_AT_decl_line   : 153
    <b04>   DW_AT_decl_column : 17
    <b05>   DW_AT_type        : <0xad1>
    <b09>   DW_AT_data_member_location: 0
 <2><b0a>: Abbrev Number: 6 (DW_TAG_member)
    <b0b>   DW_AT_name        : CR1
    <b0f>   DW_AT_decl_file   : 4
    <b10>   DW_AT_decl_line   : 154
    <b11>   DW_AT_decl_column : 17
    <b12>   DW_AT_type        : <0xad1>
    <b16>   DW_AT_data_member_location: 4
 <2><b17>: Abbrev Number: 6 (DW_TAG_member)
    <b18>   DW_AT_name        : CR2
    <b1c>   DW_AT_decl_file   : 4
    <b1d>   DW_AT_decl_line   : 155
    <b1e>   DW_AT_decl_column : 17
    <b1f>   DW_AT_type        : <0xad1>
    <b23>   DW_AT_data_member_location: 8
 <2><b24>: Abbrev Number: 1 (DW_TAG_member)
    <b25>   DW_AT_name        : (indirect string, offset: 0x89ef7): SMPR1
    <b29>   DW_AT_decl_file   : 4
    <b2a>   DW_AT_decl_line   : 156
    <b2b>   DW_AT_decl_column : 17
    <b2c>   DW_AT_type        : <0xad1>
    <b30>   DW_AT_data_member_location: 12
 <2><b31>: Abbrev Number: 1 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0x35f3f): SMPR2
    <b36>   DW_AT_decl_file   : 4
    <b37>   DW_AT_decl_line   : 157
    <b38>   DW_AT_decl_column : 17
    <b39>   DW_AT_type        : <0xad1>
    <b3d>   DW_AT_data_member_location: 16
 <2><b3e>: Abbrev Number: 1 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x343e8): JOFR1
    <b43>   DW_AT_decl_file   : 4
    <b44>   DW_AT_decl_line   : 158
    <b45>   DW_AT_decl_column : 17
    <b46>   DW_AT_type        : <0xad1>
    <b4a>   DW_AT_data_member_location: 20
 <2><b4b>: Abbrev Number: 1 (DW_TAG_member)
    <b4c>   DW_AT_name        : (indirect string, offset: 0x343ee): JOFR2
    <b50>   DW_AT_decl_file   : 4
    <b51>   DW_AT_decl_line   : 159
    <b52>   DW_AT_decl_column : 17
    <b53>   DW_AT_type        : <0xad1>
    <b57>   DW_AT_data_member_location: 24
 <2><b58>: Abbrev Number: 1 (DW_TAG_member)
    <b59>   DW_AT_name        : (indirect string, offset: 0x343f4): JOFR3
    <b5d>   DW_AT_decl_file   : 4
    <b5e>   DW_AT_decl_line   : 160
    <b5f>   DW_AT_decl_column : 17
    <b60>   DW_AT_type        : <0xad1>
    <b64>   DW_AT_data_member_location: 28
 <2><b65>: Abbrev Number: 1 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0x343fa): JOFR4
    <b6a>   DW_AT_decl_file   : 4
    <b6b>   DW_AT_decl_line   : 161
    <b6c>   DW_AT_decl_column : 17
    <b6d>   DW_AT_type        : <0xad1>
    <b71>   DW_AT_data_member_location: 32
 <2><b72>: Abbrev Number: 6 (DW_TAG_member)
    <b73>   DW_AT_name        : HTR
    <b77>   DW_AT_decl_file   : 4
    <b78>   DW_AT_decl_line   : 162
    <b79>   DW_AT_decl_column : 17
    <b7a>   DW_AT_type        : <0xad1>
    <b7e>   DW_AT_data_member_location: 36
 <2><b7f>: Abbrev Number: 6 (DW_TAG_member)
    <b80>   DW_AT_name        : LTR
    <b84>   DW_AT_decl_file   : 4
    <b85>   DW_AT_decl_line   : 163
    <b86>   DW_AT_decl_column : 17
    <b87>   DW_AT_type        : <0xad1>
    <b8b>   DW_AT_data_member_location: 40
 <2><b8c>: Abbrev Number: 1 (DW_TAG_member)
    <b8d>   DW_AT_name        : (indirect string, offset: 0xc960): SQR1
    <b91>   DW_AT_decl_file   : 4
    <b92>   DW_AT_decl_line   : 164
    <b93>   DW_AT_decl_column : 17
    <b94>   DW_AT_type        : <0xad1>
    <b98>   DW_AT_data_member_location: 44
 <2><b99>: Abbrev Number: 1 (DW_TAG_member)
    <b9a>   DW_AT_name        : (indirect string, offset: 0xb49e): SQR2
    <b9e>   DW_AT_decl_file   : 4
    <b9f>   DW_AT_decl_line   : 165
    <ba0>   DW_AT_decl_column : 17
    <ba1>   DW_AT_type        : <0xad1>
    <ba5>   DW_AT_data_member_location: 48
 <2><ba6>: Abbrev Number: 1 (DW_TAG_member)
    <ba7>   DW_AT_name        : (indirect string, offset: 0xb4a3): SQR3
    <bab>   DW_AT_decl_file   : 4
    <bac>   DW_AT_decl_line   : 166
    <bad>   DW_AT_decl_column : 17
    <bae>   DW_AT_type        : <0xad1>
    <bb2>   DW_AT_data_member_location: 52
 <2><bb3>: Abbrev Number: 1 (DW_TAG_member)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x75f0f): JSQR
    <bb8>   DW_AT_decl_file   : 4
    <bb9>   DW_AT_decl_line   : 167
    <bba>   DW_AT_decl_column : 17
    <bbb>   DW_AT_type        : <0xad1>
    <bbf>   DW_AT_data_member_location: 56
 <2><bc0>: Abbrev Number: 1 (DW_TAG_member)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x6164c): JDR1
    <bc5>   DW_AT_decl_file   : 4
    <bc6>   DW_AT_decl_line   : 168
    <bc7>   DW_AT_decl_column : 17
    <bc8>   DW_AT_type        : <0xad1>
    <bcc>   DW_AT_data_member_location: 60
 <2><bcd>: Abbrev Number: 1 (DW_TAG_member)
    <bce>   DW_AT_name        : (indirect string, offset: 0x61651): JDR2
    <bd2>   DW_AT_decl_file   : 4
    <bd3>   DW_AT_decl_line   : 169
    <bd4>   DW_AT_decl_column : 17
    <bd5>   DW_AT_type        : <0xad1>
    <bd9>   DW_AT_data_member_location: 64
 <2><bda>: Abbrev Number: 1 (DW_TAG_member)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x61656): JDR3
    <bdf>   DW_AT_decl_file   : 4
    <be0>   DW_AT_decl_line   : 170
    <be1>   DW_AT_decl_column : 17
    <be2>   DW_AT_type        : <0xad1>
    <be6>   DW_AT_data_member_location: 68
 <2><be7>: Abbrev Number: 1 (DW_TAG_member)
    <be8>   DW_AT_name        : (indirect string, offset: 0x284f9): JDR4
    <bec>   DW_AT_decl_file   : 4
    <bed>   DW_AT_decl_line   : 171
    <bee>   DW_AT_decl_column : 17
    <bef>   DW_AT_type        : <0xad1>
    <bf3>   DW_AT_data_member_location: 72
 <2><bf4>: Abbrev Number: 6 (DW_TAG_member)
    <bf5>   DW_AT_name        : DR
    <bf8>   DW_AT_decl_file   : 4
    <bf9>   DW_AT_decl_line   : 172
    <bfa>   DW_AT_decl_column : 17
    <bfb>   DW_AT_type        : <0xad1>
    <bff>   DW_AT_data_member_location: 76
 <2><c00>: Abbrev Number: 0
 <1><c01>: Abbrev Number: 3 (DW_TAG_typedef)
    <c02>   DW_AT_name        : (indirect string, offset: 0x75e0e): ADC_TypeDef
    <c06>   DW_AT_decl_file   : 4
    <c07>   DW_AT_decl_line   : 173
    <c08>   DW_AT_decl_column : 3
    <c09>   DW_AT_type        : <0xaf6>
 <1><c0d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c0e>   DW_AT_byte_size   : 24
    <c0f>   DW_AT_decl_file   : 4
    <c10>   DW_AT_decl_line   : 213
    <c11>   DW_AT_decl_column : 9
    <c11>   DW_AT_sibling     : <0xc63>
 <2><c15>: Abbrev Number: 6 (DW_TAG_member)
    <c16>   DW_AT_name        : CR
    <c19>   DW_AT_decl_file   : 4
    <c1a>   DW_AT_decl_line   : 215
    <c1b>   DW_AT_decl_column : 17
    <c1c>   DW_AT_type        : <0xad1>
    <c20>   DW_AT_data_member_location: 0
 <2><c21>: Abbrev Number: 1 (DW_TAG_member)
    <c22>   DW_AT_name        : (indirect string, offset: 0x4a592): NDTR
    <c26>   DW_AT_decl_file   : 4
    <c27>   DW_AT_decl_line   : 216
    <c28>   DW_AT_decl_column : 17
    <c29>   DW_AT_type        : <0xad1>
    <c2d>   DW_AT_data_member_location: 4
 <2><c2e>: Abbrev Number: 6 (DW_TAG_member)
    <c2f>   DW_AT_name        : PAR
    <c33>   DW_AT_decl_file   : 4
    <c34>   DW_AT_decl_line   : 217
    <c35>   DW_AT_decl_column : 17
    <c36>   DW_AT_type        : <0xad1>
    <c3a>   DW_AT_data_member_location: 8
 <2><c3b>: Abbrev Number: 1 (DW_TAG_member)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x3e899): M0AR
    <c40>   DW_AT_decl_file   : 4
    <c41>   DW_AT_decl_line   : 218
    <c42>   DW_AT_decl_column : 17
    <c43>   DW_AT_type        : <0xad1>
    <c47>   DW_AT_data_member_location: 12
 <2><c48>: Abbrev Number: 1 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0xddb2): M1AR
    <c4d>   DW_AT_decl_file   : 4
    <c4e>   DW_AT_decl_line   : 219
    <c4f>   DW_AT_decl_column : 17
    <c50>   DW_AT_type        : <0xad1>
    <c54>   DW_AT_data_member_location: 16
 <2><c55>: Abbrev Number: 6 (DW_TAG_member)
    <c56>   DW_AT_name        : FCR
    <c5a>   DW_AT_decl_file   : 4
    <c5b>   DW_AT_decl_line   : 220
    <c5c>   DW_AT_decl_column : 17
    <c5d>   DW_AT_type        : <0xad1>
    <c61>   DW_AT_data_member_location: 20
 <2><c62>: Abbrev Number: 0
 <1><c63>: Abbrev Number: 3 (DW_TAG_typedef)
    <c64>   DW_AT_name        : (indirect string, offset: 0x8ba87): DMA_Stream_TypeDef
    <c68>   DW_AT_decl_file   : 4
    <c69>   DW_AT_decl_line   : 221
    <c6a>   DW_AT_decl_column : 3
    <c6b>   DW_AT_type        : <0xc0d>
 <1><c6f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <c70>   DW_AT_byte_size   : 40
    <c71>   DW_AT_decl_file   : 4
    <c71>   DW_AT_decl_line   : 264
    <c73>   DW_AT_decl_column : 9
    <c73>   DW_AT_sibling     : <0xce4>
 <2><c77>: Abbrev Number: 2 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0x9b5d9): MODER
    <c7c>   DW_AT_decl_file   : 4
    <c7c>   DW_AT_decl_line   : 266
    <c7e>   DW_AT_decl_column : 17
    <c7e>   DW_AT_type        : <0xad1>
    <c82>   DW_AT_data_member_location: 0
 <2><c83>: Abbrev Number: 2 (DW_TAG_member)
    <c84>   DW_AT_name        : (indirect string, offset: 0x9b770): OTYPER
    <c88>   DW_AT_decl_file   : 4
    <c88>   DW_AT_decl_line   : 267
    <c8a>   DW_AT_decl_column : 17
    <c8a>   DW_AT_type        : <0xad1>
    <c8e>   DW_AT_data_member_location: 4
 <2><c8f>: Abbrev Number: 2 (DW_TAG_member)
    <c90>   DW_AT_name        : (indirect string, offset: 0x9b7a6): OSPEEDR
    <c94>   DW_AT_decl_file   : 4
    <c94>   DW_AT_decl_line   : 268
    <c96>   DW_AT_decl_column : 17
    <c96>   DW_AT_type        : <0xad1>
    <c9a>   DW_AT_data_member_location: 8
 <2><c9b>: Abbrev Number: 2 (DW_TAG_member)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x9b750): PUPDR
    <ca0>   DW_AT_decl_file   : 4
    <ca0>   DW_AT_decl_line   : 269
    <ca2>   DW_AT_decl_column : 17
    <ca2>   DW_AT_type        : <0xad1>
    <ca6>   DW_AT_data_member_location: 12
 <2><ca7>: Abbrev Number: 10 (DW_TAG_member)
    <ca8>   DW_AT_name        : IDR
    <cac>   DW_AT_decl_file   : 4
    <cac>   DW_AT_decl_line   : 270
    <cae>   DW_AT_decl_column : 17
    <cae>   DW_AT_type        : <0xad1>
    <cb2>   DW_AT_data_member_location: 16
 <2><cb3>: Abbrev Number: 10 (DW_TAG_member)
    <cb4>   DW_AT_name        : ODR
    <cb8>   DW_AT_decl_file   : 4
    <cb8>   DW_AT_decl_line   : 271
    <cba>   DW_AT_decl_column : 17
    <cba>   DW_AT_type        : <0xad1>
    <cbe>   DW_AT_data_member_location: 20
 <2><cbf>: Abbrev Number: 2 (DW_TAG_member)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x9b686): BSRR
    <cc4>   DW_AT_decl_file   : 4
    <cc4>   DW_AT_decl_line   : 272
    <cc6>   DW_AT_decl_column : 17
    <cc6>   DW_AT_type        : <0xad1>
    <cca>   DW_AT_data_member_location: 24
 <2><ccb>: Abbrev Number: 2 (DW_TAG_member)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x9b791): LCKR
    <cd0>   DW_AT_decl_file   : 4
    <cd0>   DW_AT_decl_line   : 273
    <cd2>   DW_AT_decl_column : 17
    <cd2>   DW_AT_type        : <0xad1>
    <cd6>   DW_AT_data_member_location: 28
 <2><cd7>: Abbrev Number: 10 (DW_TAG_member)
    <cd8>   DW_AT_name        : AFR
    <cdc>   DW_AT_decl_file   : 4
    <cdc>   DW_AT_decl_line   : 274
    <cde>   DW_AT_decl_column : 17
    <cde>   DW_AT_type        : <0xcf4>
    <ce2>   DW_AT_data_member_location: 32
 <2><ce3>: Abbrev Number: 0
 <1><ce4>: Abbrev Number: 15 (DW_TAG_array_type)
    <ce5>   DW_AT_type        : <0xad1>
    <ce9>   DW_AT_sibling     : <0xcf4>
 <2><ced>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <cee>   DW_AT_type        : <0xab2>
    <cf2>   DW_AT_upper_bound : 1
 <2><cf3>: Abbrev Number: 0
 <1><cf4>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <cf5>   DW_AT_type        : <0xce4>
 <1><cf9>: Abbrev Number: 18 (DW_TAG_typedef)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x9b813): GPIO_TypeDef
    <cfe>   DW_AT_decl_file   : 4
    <cfe>   DW_AT_decl_line   : 275
    <d00>   DW_AT_decl_column : 3
    <d00>   DW_AT_type        : <0xc6f>
 <1><d04>: Abbrev Number: 17 (DW_TAG_structure_type)
    <d05>   DW_AT_byte_size   : 144
    <d06>   DW_AT_decl_file   : 4
    <d06>   DW_AT_decl_line   : 335
    <d08>   DW_AT_decl_column : 9
    <d08>   DW_AT_sibling     : <0xe8c>
 <2><d0c>: Abbrev Number: 10 (DW_TAG_member)
    <d0d>   DW_AT_name        : CR
    <d10>   DW_AT_decl_file   : 4
    <d10>   DW_AT_decl_line   : 337
    <d12>   DW_AT_decl_column : 17
    <d12>   DW_AT_type        : <0xad1>
    <d16>   DW_AT_data_member_location: 0
 <2><d17>: Abbrev Number: 2 (DW_TAG_member)
    <d18>   DW_AT_name        : (indirect string, offset: 0x9b748): PLLCFGR
    <d1c>   DW_AT_decl_file   : 4
    <d1c>   DW_AT_decl_line   : 338
    <d1e>   DW_AT_decl_column : 17
    <d1e>   DW_AT_type        : <0xad1>
    <d22>   DW_AT_data_member_location: 4
 <2><d23>: Abbrev Number: 2 (DW_TAG_member)
    <d24>   DW_AT_name        : (indirect string, offset: 0x9b6c9): CFGR
    <d28>   DW_AT_decl_file   : 4
    <d28>   DW_AT_decl_line   : 339
    <d2a>   DW_AT_decl_column : 17
    <d2a>   DW_AT_type        : <0xad1>
    <d2e>   DW_AT_data_member_location: 8
 <2><d2f>: Abbrev Number: 10 (DW_TAG_member)
    <d30>   DW_AT_name        : CIR
    <d34>   DW_AT_decl_file   : 4
    <d34>   DW_AT_decl_line   : 340
    <d36>   DW_AT_decl_column : 17
    <d36>   DW_AT_type        : <0xad1>
    <d3a>   DW_AT_data_member_location: 12
 <2><d3b>: Abbrev Number: 2 (DW_TAG_member)
    <d3c>   DW_AT_name        : (indirect string, offset: 0x9b788): AHB1RSTR
    <d40>   DW_AT_decl_file   : 4
    <d40>   DW_AT_decl_line   : 341
    <d42>   DW_AT_decl_column : 17
    <d42>   DW_AT_type        : <0xad1>
    <d46>   DW_AT_data_member_location: 16
 <2><d47>: Abbrev Number: 2 (DW_TAG_member)
    <d48>   DW_AT_name        : (indirect string, offset: 0x9b647): AHB2RSTR
    <d4c>   DW_AT_decl_file   : 4
    <d4c>   DW_AT_decl_line   : 342
    <d4e>   DW_AT_decl_column : 17
    <d4e>   DW_AT_type        : <0xad1>
    <d52>   DW_AT_data_member_location: 20
 <2><d53>: Abbrev Number: 2 (DW_TAG_member)
    <d54>   DW_AT_name        : (indirect string, offset: 0x9b6bd): AHB3RSTR
    <d58>   DW_AT_decl_file   : 4
    <d58>   DW_AT_decl_line   : 343
    <d5a>   DW_AT_decl_column : 17
    <d5a>   DW_AT_type        : <0xad1>
    <d5e>   DW_AT_data_member_location: 24
 <2><d5f>: Abbrev Number: 2 (DW_TAG_member)
    <d60>   DW_AT_name        : (indirect string, offset: 0x9b7bb): RESERVED0
    <d64>   DW_AT_decl_file   : 4
    <d64>   DW_AT_decl_line   : 344
    <d66>   DW_AT_decl_column : 17
    <d66>   DW_AT_type        : <0xac5>
    <d6a>   DW_AT_data_member_location: 28
 <2><d6b>: Abbrev Number: 2 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x9b63e): APB1RSTR
    <d70>   DW_AT_decl_file   : 4
    <d70>   DW_AT_decl_line   : 345
    <d72>   DW_AT_decl_column : 17
    <d72>   DW_AT_type        : <0xad1>
    <d76>   DW_AT_data_member_location: 32
 <2><d77>: Abbrev Number: 2 (DW_TAG_member)
    <d78>   DW_AT_name        : (indirect string, offset: 0x9b6b4): APB2RSTR
    <d7c>   DW_AT_decl_file   : 4
    <d7c>   DW_AT_decl_line   : 346
    <d7e>   DW_AT_decl_column : 17
    <d7e>   DW_AT_type        : <0xad1>
    <d82>   DW_AT_data_member_location: 36
 <2><d83>: Abbrev Number: 2 (DW_TAG_member)
    <d84>   DW_AT_name        : (indirect string, offset: 0x9b7c5): RESERVED1
    <d88>   DW_AT_decl_file   : 4
    <d88>   DW_AT_decl_line   : 347
    <d8a>   DW_AT_decl_column : 17
    <d8a>   DW_AT_type        : <0xae6>
    <d8e>   DW_AT_data_member_location: 40
 <2><d8f>: Abbrev Number: 2 (DW_TAG_member)
    <d90>   DW_AT_name        : (indirect string, offset: 0x9b619): AHB1ENR
    <d94>   DW_AT_decl_file   : 4
    <d94>   DW_AT_decl_line   : 348
    <d96>   DW_AT_decl_column : 17
    <d96>   DW_AT_type        : <0xad1>
    <d9a>   DW_AT_data_member_location: 48
 <2><d9b>: Abbrev Number: 2 (DW_TAG_member)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x9b68b): AHB2ENR
    <da0>   DW_AT_decl_file   : 4
    <da0>   DW_AT_decl_line   : 349
    <da2>   DW_AT_decl_column : 17
    <da2>   DW_AT_type        : <0xad1>
    <da6>   DW_AT_data_member_location: 52
 <2><da7>: Abbrev Number: 2 (DW_TAG_member)
    <da8>   DW_AT_name        : (indirect string, offset: 0x9b6dc): AHB3ENR
    <dac>   DW_AT_decl_file   : 4
    <dac>   DW_AT_decl_line   : 350
    <dae>   DW_AT_decl_column : 17
    <dae>   DW_AT_type        : <0xad1>
    <db2>   DW_AT_data_member_location: 56
 <2><db3>: Abbrev Number: 2 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x9b7cf): RESERVED2
    <db8>   DW_AT_decl_file   : 4
    <db8>   DW_AT_decl_line   : 351
    <dba>   DW_AT_decl_column : 17
    <dba>   DW_AT_type        : <0xac5>
    <dbe>   DW_AT_data_member_location: 60
 <2><dbf>: Abbrev Number: 2 (DW_TAG_member)
    <dc0>   DW_AT_name        : (indirect string, offset: 0x9b768): APB1ENR
    <dc4>   DW_AT_decl_file   : 4
    <dc4>   DW_AT_decl_line   : 352
    <dc6>   DW_AT_decl_column : 17
    <dc6>   DW_AT_type        : <0xad1>
    <dca>   DW_AT_data_member_location: 64
 <2><dcb>: Abbrev Number: 2 (DW_TAG_member)
    <dcc>   DW_AT_name        : (indirect string, offset: 0x9b650): APB2ENR
    <dd0>   DW_AT_decl_file   : 4
    <dd0>   DW_AT_decl_line   : 353
    <dd2>   DW_AT_decl_column : 17
    <dd2>   DW_AT_type        : <0xad1>
    <dd6>   DW_AT_data_member_location: 68
 <2><dd7>: Abbrev Number: 2 (DW_TAG_member)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x9b7d9): RESERVED3
    <ddc>   DW_AT_decl_file   : 4
    <ddc>   DW_AT_decl_line   : 354
    <dde>   DW_AT_decl_column : 17
    <dde>   DW_AT_type        : <0xae6>
    <de2>   DW_AT_data_member_location: 72
 <2><de3>: Abbrev Number: 2 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0x9b6fa): AHB1LPENR
    <de8>   DW_AT_decl_file   : 4
    <de8>   DW_AT_decl_line   : 355
    <dea>   DW_AT_decl_column : 17
    <dea>   DW_AT_type        : <0xad1>
    <dee>   DW_AT_data_member_location: 80
 <2><def>: Abbrev Number: 2 (DW_TAG_member)
    <df0>   DW_AT_name        : (indirect string, offset: 0x9b67c): AHB2LPENR
    <df4>   DW_AT_decl_file   : 4
    <df4>   DW_AT_decl_line   : 356
    <df6>   DW_AT_decl_column : 17
    <df6>   DW_AT_type        : <0xad1>
    <dfa>   DW_AT_data_member_location: 84
 <2><dfb>: Abbrev Number: 2 (DW_TAG_member)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x9b73e): AHB3LPENR
    <e00>   DW_AT_decl_file   : 4
    <e00>   DW_AT_decl_line   : 357
    <e02>   DW_AT_decl_column : 17
    <e02>   DW_AT_type        : <0xad1>
    <e06>   DW_AT_data_member_location: 88
 <2><e07>: Abbrev Number: 2 (DW_TAG_member)
    <e08>   DW_AT_name        : (indirect string, offset: 0x9b7e3): RESERVED4
    <e0c>   DW_AT_decl_file   : 4
    <e0c>   DW_AT_decl_line   : 358
    <e0e>   DW_AT_decl_column : 17
    <e0e>   DW_AT_type        : <0xac5>
    <e12>   DW_AT_data_member_location: 92
 <2><e13>: Abbrev Number: 2 (DW_TAG_member)
    <e14>   DW_AT_name        : (indirect string, offset: 0x9b734): APB1LPENR
    <e18>   DW_AT_decl_file   : 4
    <e18>   DW_AT_decl_line   : 359
    <e1a>   DW_AT_decl_column : 17
    <e1a>   DW_AT_type        : <0xad1>
    <e1e>   DW_AT_data_member_location: 96
 <2><e1f>: Abbrev Number: 2 (DW_TAG_member)
    <e20>   DW_AT_name        : (indirect string, offset: 0x9b60f): APB2LPENR
    <e24>   DW_AT_decl_file   : 4
    <e24>   DW_AT_decl_line   : 360
    <e26>   DW_AT_decl_column : 17
    <e26>   DW_AT_type        : <0xad1>
    <e2a>   DW_AT_data_member_location: 100
 <2><e2b>: Abbrev Number: 2 (DW_TAG_member)
    <e2c>   DW_AT_name        : (indirect string, offset: 0x9b7ed): RESERVED5
    <e30>   DW_AT_decl_file   : 4
    <e30>   DW_AT_decl_line   : 361
    <e32>   DW_AT_decl_column : 17
    <e32>   DW_AT_type        : <0xae6>
    <e36>   DW_AT_data_member_location: 104
 <2><e37>: Abbrev Number: 2 (DW_TAG_member)
    <e38>   DW_AT_name        : (indirect string, offset: 0x9b668): BDCR
    <e3c>   DW_AT_decl_file   : 4
    <e3c>   DW_AT_decl_line   : 362
    <e3e>   DW_AT_decl_column : 17
    <e3e>   DW_AT_type        : <0xad1>
    <e42>   DW_AT_data_member_location: 112
 <2><e43>: Abbrev Number: 10 (DW_TAG_member)
    <e44>   DW_AT_name        : CSR
    <e48>   DW_AT_decl_file   : 4
    <e48>   DW_AT_decl_line   : 363
    <e4a>   DW_AT_decl_column : 17
    <e4a>   DW_AT_type        : <0xad1>
    <e4e>   DW_AT_data_member_location: 116
 <2><e4f>: Abbrev Number: 2 (DW_TAG_member)
    <e50>   DW_AT_name        : (indirect string, offset: 0x9b7f7): RESERVED6
    <e54>   DW_AT_decl_file   : 4
    <e54>   DW_AT_decl_line   : 364
    <e56>   DW_AT_decl_column : 17
    <e56>   DW_AT_type        : <0xae6>
    <e5a>   DW_AT_data_member_location: 120
 <2><e5b>: Abbrev Number: 2 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x9b709): SSCGR
    <e60>   DW_AT_decl_file   : 4
    <e60>   DW_AT_decl_line   : 365
    <e62>   DW_AT_decl_column : 17
    <e62>   DW_AT_type        : <0xad1>
    <e66>   DW_AT_data_member_location: 128
 <2><e67>: Abbrev Number: 2 (DW_TAG_member)
    <e68>   DW_AT_name        : (indirect string, offset: 0x9b6a9): PLLI2SCFGR
    <e6c>   DW_AT_decl_file   : 4
    <e6c>   DW_AT_decl_line   : 366
    <e6e>   DW_AT_decl_column : 17
    <e6e>   DW_AT_type        : <0xad1>
    <e72>   DW_AT_data_member_location: 132
 <2><e73>: Abbrev Number: 2 (DW_TAG_member)
    <e74>   DW_AT_name        : (indirect string, offset: 0x9b801): RESERVED7
    <e78>   DW_AT_decl_file   : 4
    <e78>   DW_AT_decl_line   : 367
    <e7a>   DW_AT_decl_column : 17
    <e7a>   DW_AT_type        : <0xad6>
    <e7e>   DW_AT_data_member_location: 136
 <2><e7f>: Abbrev Number: 2 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0x9b6c6): DCKCFGR
    <e84>   DW_AT_decl_file   : 4
    <e84>   DW_AT_decl_line   : 368
    <e86>   DW_AT_decl_column : 17
    <e86>   DW_AT_type        : <0xad1>
    <e8a>   DW_AT_data_member_location: 140
 <2><e8b>: Abbrev Number: 0
 <1><e8c>: Abbrev Number: 18 (DW_TAG_typedef)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x9b6ee): RCC_TypeDef
    <e91>   DW_AT_decl_file   : 4
    <e91>   DW_AT_decl_line   : 369
    <e93>   DW_AT_decl_column : 3
    <e93>   DW_AT_type        : <0xd04>
 <1><e97>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <e98>   DW_AT_encoding    : 7	(unsigned)
    <e98>   DW_AT_byte_size   : 1
    <e98>   DW_AT_type        : <0xa62>
    <e9c>   DW_AT_decl_file   : 5
    <e9d>   DW_AT_decl_line   : 191
    <e9e>   DW_AT_decl_column : 1
    <e9e>   DW_AT_sibling     : <0xeaf>
 <2><ea2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x47f0e): DISABLE
    <ea7>   DW_AT_const_value : 0
 <2><ea8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x8bf81): ENABLE
    <ead>   DW_AT_const_value : 1
 <2><eae>: Abbrev Number: 0
 <1><eaf>: Abbrev Number: 3 (DW_TAG_typedef)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x9896d): FunctionalState
    <eb4>   DW_AT_decl_file   : 5
    <eb5>   DW_AT_decl_line   : 194
    <eb6>   DW_AT_decl_column : 3
    <eb7>   DW_AT_type        : <0xe97>
 <1><ebb>: Abbrev Number: 5 (DW_TAG_base_type)
    <ebc>   DW_AT_byte_size   : 8
    <ebd>   DW_AT_encoding    : 4	(float)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x7e29a): long double
 <1><ec2>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <ec3>   DW_AT_encoding    : 7	(unsigned)
    <ec3>   DW_AT_byte_size   : 1
    <ec3>   DW_AT_type        : <0xa62>
    <ec7>   DW_AT_decl_file   : 6
    <ec8>   DW_AT_decl_line   : 39
    <ec9>   DW_AT_decl_column : 1
    <ec9>   DW_AT_sibling     : <0xee6>
 <2><ecd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ece>   DW_AT_name        : (indirect string, offset: 0x3300e): HAL_OK
    <ed2>   DW_AT_const_value : 0
 <2><ed3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x5ef1e): HAL_ERROR
    <ed8>   DW_AT_const_value : 1
 <2><ed9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <eda>   DW_AT_name        : (indirect string, offset: 0x80720): HAL_BUSY
    <ede>   DW_AT_const_value : 2
 <2><edf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x2c349): HAL_TIMEOUT
    <ee4>   DW_AT_const_value : 3
 <2><ee5>: Abbrev Number: 0
 <1><ee6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x89dbf): HAL_StatusTypeDef
    <eeb>   DW_AT_decl_file   : 6
    <eec>   DW_AT_decl_line   : 44
    <eed>   DW_AT_decl_column : 3
    <eee>   DW_AT_type        : <0xec2>
 <1><ef2>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <ef3>   DW_AT_encoding    : 7	(unsigned)
    <ef3>   DW_AT_byte_size   : 1
    <ef3>   DW_AT_type        : <0xa62>
    <ef7>   DW_AT_decl_file   : 6
    <ef8>   DW_AT_decl_line   : 50
    <ef9>   DW_AT_decl_column : 1
    <ef9>   DW_AT_sibling     : <0xf0a>
 <2><efd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <efe>   DW_AT_name        : (indirect string, offset: 0x718b7): HAL_UNLOCKED
    <f02>   DW_AT_const_value : 0
 <2><f03>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f04>   DW_AT_name        : (indirect string, offset: 0x992df): HAL_LOCKED
    <f08>   DW_AT_const_value : 1
 <2><f09>: Abbrev Number: 0
 <1><f0a>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0b>   DW_AT_name        : (indirect string, offset: 0x5c7d6): HAL_LockTypeDef
    <f0f>   DW_AT_decl_file   : 6
    <f10>   DW_AT_decl_line   : 53
    <f11>   DW_AT_decl_column : 3
    <f12>   DW_AT_type        : <0xef2>
 <1><f16>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f17>   DW_AT_byte_size   : 20
    <f18>   DW_AT_decl_file   : 7
    <f19>   DW_AT_decl_line   : 46
    <f1a>   DW_AT_decl_column : 9
    <f1a>   DW_AT_sibling     : <0xf60>
 <2><f1e>: Abbrev Number: 6 (DW_TAG_member)
    <f1f>   DW_AT_name        : Pin
    <f23>   DW_AT_decl_file   : 7
    <f24>   DW_AT_decl_line   : 48
    <f25>   DW_AT_decl_column : 12
    <f26>   DW_AT_type        : <0xac5>
    <f2a>   DW_AT_data_member_location: 0
 <2><f2b>: Abbrev Number: 1 (DW_TAG_member)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x9d780): Mode
    <f30>   DW_AT_decl_file   : 7
    <f31>   DW_AT_decl_line   : 51
    <f32>   DW_AT_decl_column : 12
    <f33>   DW_AT_type        : <0xac5>
    <f37>   DW_AT_data_member_location: 4
 <2><f38>: Abbrev Number: 1 (DW_TAG_member)
    <f39>   DW_AT_name        : (indirect string, offset: 0x9b704): Pull
    <f3d>   DW_AT_decl_file   : 7
    <f3e>   DW_AT_decl_line   : 54
    <f3f>   DW_AT_decl_column : 12
    <f40>   DW_AT_type        : <0xac5>
    <f44>   DW_AT_data_member_location: 8
 <2><f45>: Abbrev Number: 1 (DW_TAG_member)
    <f46>   DW_AT_name        : (indirect string, offset: 0x9d0fe): Speed
    <f4a>   DW_AT_decl_file   : 7
    <f4b>   DW_AT_decl_line   : 57
    <f4c>   DW_AT_decl_column : 12
    <f4d>   DW_AT_type        : <0xac5>
    <f51>   DW_AT_data_member_location: 12
 <2><f52>: Abbrev Number: 1 (DW_TAG_member)
    <f53>   DW_AT_name        : (indirect string, offset: 0x9b6e4): Alternate
    <f57>   DW_AT_decl_file   : 7
    <f58>   DW_AT_decl_line   : 60
    <f59>   DW_AT_decl_column : 12
    <f5a>   DW_AT_type        : <0xac5>
    <f5e>   DW_AT_data_member_location: 16
 <2><f5f>: Abbrev Number: 0
 <1><f60>: Abbrev Number: 3 (DW_TAG_typedef)
    <f61>   DW_AT_name        : (indirect string, offset: 0x9b777): GPIO_InitTypeDef
    <f65>   DW_AT_decl_file   : 7
    <f66>   DW_AT_decl_line   : 62
    <f67>   DW_AT_decl_column : 2
    <f68>   DW_AT_type        : <0xf16>
 <1><f6c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f6d>   DW_AT_byte_size   : 48
    <f6e>   DW_AT_decl_file   : 8
    <f6f>   DW_AT_decl_line   : 48
    <f70>   DW_AT_decl_column : 9
    <f70>   DW_AT_sibling     : <0x1011>
 <2><f74>: Abbrev Number: 1 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0x9c299): Channel
    <f79>   DW_AT_decl_file   : 8
    <f7a>   DW_AT_decl_line   : 50
    <f7b>   DW_AT_decl_column : 12
    <f7c>   DW_AT_type        : <0xac5>
    <f80>   DW_AT_data_member_location: 0
 <2><f81>: Abbrev Number: 1 (DW_TAG_member)
    <f82>   DW_AT_name        : (indirect string, offset: 0x8a68b): Direction
    <f86>   DW_AT_decl_file   : 8
    <f87>   DW_AT_decl_line   : 53
    <f88>   DW_AT_decl_column : 12
    <f89>   DW_AT_type        : <0xac5>
    <f8d>   DW_AT_data_member_location: 4
 <2><f8e>: Abbrev Number: 1 (DW_TAG_member)
    <f8f>   DW_AT_name        : (indirect string, offset: 0xa018): PeriphInc
    <f93>   DW_AT_decl_file   : 8
    <f94>   DW_AT_decl_line   : 57
    <f95>   DW_AT_decl_column : 12
    <f96>   DW_AT_type        : <0xac5>
    <f9a>   DW_AT_data_member_location: 8
 <2><f9b>: Abbrev Number: 1 (DW_TAG_member)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x178d8): MemInc
    <fa0>   DW_AT_decl_file   : 8
    <fa1>   DW_AT_decl_line   : 60
    <fa2>   DW_AT_decl_column : 12
    <fa3>   DW_AT_type        : <0xac5>
    <fa7>   DW_AT_data_member_location: 12
 <2><fa8>: Abbrev Number: 1 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x4baae): PeriphDataAlignment
    <fad>   DW_AT_decl_file   : 8
    <fae>   DW_AT_decl_line   : 63
    <faf>   DW_AT_decl_column : 12
    <fb0>   DW_AT_type        : <0xac5>
    <fb4>   DW_AT_data_member_location: 16
 <2><fb5>: Abbrev Number: 1 (DW_TAG_member)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x8ae88): MemDataAlignment
    <fba>   DW_AT_decl_file   : 8
    <fbb>   DW_AT_decl_line   : 66
    <fbc>   DW_AT_decl_column : 12
    <fbd>   DW_AT_type        : <0xac5>
    <fc1>   DW_AT_data_member_location: 20
 <2><fc2>: Abbrev Number: 1 (DW_TAG_member)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x9d780): Mode
    <fc7>   DW_AT_decl_file   : 8
    <fc8>   DW_AT_decl_line   : 69
    <fc9>   DW_AT_decl_column : 12
    <fca>   DW_AT_type        : <0xac5>
    <fce>   DW_AT_data_member_location: 24
 <2><fcf>: Abbrev Number: 1 (DW_TAG_member)
    <fd0>   DW_AT_name        : (indirect string, offset: 0x9e589): Priority
    <fd4>   DW_AT_decl_file   : 8
    <fd5>   DW_AT_decl_line   : 74
    <fd6>   DW_AT_decl_column : 12
    <fd7>   DW_AT_type        : <0xac5>
    <fdb>   DW_AT_data_member_location: 28
 <2><fdc>: Abbrev Number: 1 (DW_TAG_member)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x40e86): FIFOMode
    <fe1>   DW_AT_decl_file   : 8
    <fe2>   DW_AT_decl_line   : 77
    <fe3>   DW_AT_decl_column : 12
    <fe4>   DW_AT_type        : <0xac5>
    <fe8>   DW_AT_data_member_location: 32
 <2><fe9>: Abbrev Number: 1 (DW_TAG_member)
    <fea>   DW_AT_name        : (indirect string, offset: 0x74db4): FIFOThreshold
    <fee>   DW_AT_decl_file   : 8
    <fef>   DW_AT_decl_line   : 82
    <ff0>   DW_AT_decl_column : 12
    <ff1>   DW_AT_type        : <0xac5>
    <ff5>   DW_AT_data_member_location: 36
 <2><ff6>: Abbrev Number: 1 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x3bc69): MemBurst
    <ffb>   DW_AT_decl_file   : 8
    <ffc>   DW_AT_decl_line   : 85
    <ffd>   DW_AT_decl_column : 12
    <ffe>   DW_AT_type        : <0xac5>
    <1002>   DW_AT_data_member_location: 40
 <2><1003>: Abbrev Number: 1 (DW_TAG_member)
    <1004>   DW_AT_name        : (indirect string, offset: 0x33c81): PeriphBurst
    <1008>   DW_AT_decl_file   : 8
    <1009>   DW_AT_decl_line   : 91
