Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x7b3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x3cb40): ../Core/Src/ANALOG.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4a233): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 4 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4c39b): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2be2d): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 4 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><44>: Abbrev Number: 4 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x7278d): short int
 <1><4b>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x7d80f): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 4 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x93163): short unsigned int
 <1><5e>: Abbrev Number: 4 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x60d58): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 4 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><78>: Abbrev Number: 4 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x44c89): long long int
 <1><7f>: Abbrev Number: 4 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><86>: Abbrev Number: 16 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 4 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><94>: Abbrev Number: 2 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x2be2f): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x6fb41): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 2 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x6f2a1): uint32_t
    <b6>   DW_AT_decl_file   : 3
    <b7>   DW_AT_decl_line   : 48
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x65>
 <1><bd>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 17 (DW_TAG_array_type)
    <c3>   DW_AT_type        : <0xac>
    <c7>   DW_AT_sibling     : <0xd2>
 <2><cb>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <cc>   DW_AT_type        : <0x8d>
    <d0>   DW_AT_upper_bound : 3
 <2><d1>: Abbrev Number: 0
 <1><d2>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d3>   DW_AT_type        : <0xc2>
 <1><d7>: Abbrev Number: 13 (DW_TAG_variable)
    <d8>   DW_AT_name        : (indirect string, offset: 0x9971a): adc_raw_readings
    <dc>   DW_AT_decl_file   : 4
    <dd>   DW_AT_decl_line   : 13
    <de>   DW_AT_decl_column : 26
    <df>   DW_AT_type        : <0xd2>
    <e3>   DW_AT_external    : 1
    <e3>   DW_AT_declaration : 1
 <1><e3>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e4>   DW_AT_byte_size   : 16
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 15
    <e7>   DW_AT_decl_column : 9
    <e7>   DW_AT_sibling     : <0x120>
 <2><eb>: Abbrev Number: 1 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x8a68b): windDirection
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 16
    <f2>   DW_AT_decl_column : 8
    <f3>   DW_AT_type        : <0x120>
    <f7>   DW_AT_data_member_location: 0
 <2><f8>: Abbrev Number: 1 (DW_TAG_member)
    <f9>   DW_AT_name        : (indirect string, offset: 0x288c2): batteryVoltage
    <fd>   DW_AT_decl_file   : 4
    <fe>   DW_AT_decl_line   : 17
    <ff>   DW_AT_decl_column : 8
    <100>   DW_AT_type        : <0x120>
    <104>   DW_AT_data_member_location: 4
 <2><105>: Abbrev Number: 1 (DW_TAG_member)
    <106>   DW_AT_name        : (indirect string, offset: 0x61163): extra1
    <10a>   DW_AT_decl_file   : 4
    <10b>   DW_AT_decl_line   : 18
    <10c>   DW_AT_decl_column : 8
    <10d>   DW_AT_type        : <0x120>
    <111>   DW_AT_data_member_location: 8
 <2><112>: Abbrev Number: 1 (DW_TAG_member)
    <113>   DW_AT_name        : (indirect string, offset: 0x6116a): extra2
    <117>   DW_AT_decl_file   : 4
    <118>   DW_AT_decl_line   : 19
    <119>   DW_AT_decl_column : 8
    <11a>   DW_AT_type        : <0x120>
    <11e>   DW_AT_data_member_location: 12
 <2><11f>: Abbrev Number: 0
 <1><120>: Abbrev Number: 4 (DW_TAG_base_type)
    <121>   DW_AT_byte_size   : 4
    <122>   DW_AT_encoding    : 4	(float)
    <123>   DW_AT_name        : (indirect string, offset: 0x83cdc): float
 <1><127>: Abbrev Number: 2 (DW_TAG_typedef)
    <128>   DW_AT_name        : (indirect string, offset: 0x5dceb): AdcData_t
    <12c>   DW_AT_decl_file   : 4
    <12d>   DW_AT_decl_line   : 20
    <12e>   DW_AT_decl_column : 3
    <12f>   DW_AT_type        : <0xe3>
 <1><133>: Abbrev Number: 9 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 80
    <135>   DW_AT_decl_file   : 5
    <136>   DW_AT_decl_line   : 151
    <137>   DW_AT_decl_column : 9
    <137>   DW_AT_sibling     : <0x232>
 <2><13b>: Abbrev Number: 5 (DW_TAG_member)
    <13c>   DW_AT_name        : SR
    <13f>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 153
    <140>   DW_AT_decl_column : 17
    <140>   DW_AT_type        : <0xbd>
    <144>   DW_AT_data_member_location: 0
 <2><145>: Abbrev Number: 5 (DW_TAG_member)
    <146>   DW_AT_name        : CR1
    <14a>   DW_AT_decl_file   : 5
    <14a>   DW_AT_decl_line   : 154
    <14b>   DW_AT_decl_column : 17
    <14b>   DW_AT_type        : <0xbd>
    <14f>   DW_AT_data_member_location: 4
 <2><150>: Abbrev Number: 5 (DW_TAG_member)
    <151>   DW_AT_name        : CR2
    <155>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 155
    <156>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0xbd>
    <15a>   DW_AT_data_member_location: 8
 <2><15b>: Abbrev Number: 1 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0x89efb): SMPR1
    <160>   DW_AT_decl_file   : 5
    <161>   DW_AT_decl_line   : 156
    <162>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xbd>
    <167>   DW_AT_data_member_location: 12
 <2><168>: Abbrev Number: 1 (DW_TAG_member)
    <169>   DW_AT_name        : (indirect string, offset: 0x35f3f): SMPR2
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 157
    <16f>   DW_AT_decl_column : 17
    <170>   DW_AT_type        : <0xbd>
    <174>   DW_AT_data_member_location: 16
 <2><175>: Abbrev Number: 1 (DW_TAG_member)
    <176>   DW_AT_name        : (indirect string, offset: 0x343e8): JOFR1
    <17a>   DW_AT_decl_file   : 5
    <17b>   DW_AT_decl_line   : 158
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xbd>
    <181>   DW_AT_data_member_location: 20
 <2><182>: Abbrev Number: 1 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x343ee): JOFR2
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 159
    <189>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xbd>
    <18e>   DW_AT_data_member_location: 24
 <2><18f>: Abbrev Number: 1 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x343f4): JOFR3
    <194>   DW_AT_decl_file   : 5
    <195>   DW_AT_decl_line   : 160
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xbd>
    <19b>   DW_AT_data_member_location: 28
 <2><19c>: Abbrev Number: 1 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0x343fa): JOFR4
    <1a1>   DW_AT_decl_file   : 5
    <1a2>   DW_AT_decl_line   : 161
    <1a3>   DW_AT_decl_column : 17
    <1a4>   DW_AT_type        : <0xbd>
    <1a8>   DW_AT_data_member_location: 32
 <2><1a9>: Abbrev Number: 5 (DW_TAG_member)
    <1aa>   DW_AT_name        : HTR
    <1ae>   DW_AT_decl_file   : 5
    <1ae>   DW_AT_decl_line   : 162
    <1af>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xbd>
    <1b3>   DW_AT_data_member_location: 36
 <2><1b4>: Abbrev Number: 5 (DW_TAG_member)
    <1b5>   DW_AT_name        : LTR
    <1b9>   DW_AT_decl_file   : 5
    <1b9>   DW_AT_decl_line   : 163
    <1ba>   DW_AT_decl_column : 17
    <1ba>   DW_AT_type        : <0xbd>
    <1be>   DW_AT_data_member_location: 40
 <2><1bf>: Abbrev Number: 1 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xc960): SQR1
    <1c4>   DW_AT_decl_file   : 5
    <1c5>   DW_AT_decl_line   : 164
    <1c6>   DW_AT_decl_column : 17
    <1c7>   DW_AT_type        : <0xbd>
    <1cb>   DW_AT_data_member_location: 44
 <2><1cc>: Abbrev Number: 1 (DW_TAG_member)
    <1cd>   DW_AT_name        : (indirect string, offset: 0xb49e): SQR2
    <1d1>   DW_AT_decl_file   : 5
    <1d2>   DW_AT_decl_line   : 165
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0xbd>
    <1d8>   DW_AT_data_member_location: 48
 <2><1d9>: Abbrev Number: 1 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0xb4a3): SQR3
    <1de>   DW_AT_decl_file   : 5
    <1df>   DW_AT_decl_line   : 166
    <1e0>   DW_AT_decl_column : 17
    <1e1>   DW_AT_type        : <0xbd>
    <1e5>   DW_AT_data_member_location: 52
 <2><1e6>: Abbrev Number: 1 (DW_TAG_member)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x75f13): JSQR
    <1eb>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 167
    <1ed>   DW_AT_decl_column : 17
    <1ee>   DW_AT_type        : <0xbd>
    <1f2>   DW_AT_data_member_location: 56
 <2><1f3>: Abbrev Number: 1 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x61658): JDR1
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 168
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0xbd>
    <1ff>   DW_AT_data_member_location: 60
 <2><200>: Abbrev Number: 1 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x6165d): JDR2
    <205>   DW_AT_decl_file   : 5
    <206>   DW_AT_decl_line   : 169
    <207>   DW_AT_decl_column : 17
    <208>   DW_AT_type        : <0xbd>
    <20c>   DW_AT_data_member_location: 64
 <2><20d>: Abbrev Number: 1 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x61662): JDR3
    <212>   DW_AT_decl_file   : 5
    <213>   DW_AT_decl_line   : 170
    <214>   DW_AT_decl_column : 17
    <215>   DW_AT_type        : <0xbd>
    <219>   DW_AT_data_member_location: 68
 <2><21a>: Abbrev Number: 1 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x284f9): JDR4
    <21f>   DW_AT_decl_file   : 5
    <220>   DW_AT_decl_line   : 171
    <221>   DW_AT_decl_column : 17
    <222>   DW_AT_type        : <0xbd>
    <226>   DW_AT_data_member_location: 72
 <2><227>: Abbrev Number: 5 (DW_TAG_member)
    <228>   DW_AT_name        : DR
    <22b>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 172
    <22c>   DW_AT_decl_column : 17
    <22c>   DW_AT_type        : <0xbd>
    <230>   DW_AT_data_member_location: 76
 <2><231>: Abbrev Number: 0
 <1><232>: Abbrev Number: 2 (DW_TAG_typedef)
    <233>   DW_AT_name        : (indirect string, offset: 0x75e12): ADC_TypeDef
    <237>   DW_AT_decl_file   : 5
    <238>   DW_AT_decl_line   : 173
    <239>   DW_AT_decl_column : 3
    <23a>   DW_AT_type        : <0x133>
 <1><23e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <23f>   DW_AT_byte_size   : 24
    <240>   DW_AT_decl_file   : 5
    <241>   DW_AT_decl_line   : 213
    <242>   DW_AT_decl_column : 9
    <242>   DW_AT_sibling     : <0x28e>
 <2><246>: Abbrev Number: 5 (DW_TAG_member)
    <247>   DW_AT_name        : CR
    <24a>   DW_AT_decl_file   : 5
    <24a>   DW_AT_decl_line   : 215
    <24b>   DW_AT_decl_column : 17
    <24b>   DW_AT_type        : <0xbd>
    <24f>   DW_AT_data_member_location: 0
 <2><250>: Abbrev Number: 1 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0x4a59e): NDTR
    <255>   DW_AT_decl_file   : 5
    <256>   DW_AT_decl_line   : 216
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xbd>
    <25c>   DW_AT_data_member_location: 4
 <2><25d>: Abbrev Number: 5 (DW_TAG_member)
    <25e>   DW_AT_name        : PAR
    <262>   DW_AT_decl_file   : 5
    <262>   DW_AT_decl_line   : 217
    <263>   DW_AT_decl_column : 17
    <263>   DW_AT_type        : <0xbd>
    <267>   DW_AT_data_member_location: 8
 <2><268>: Abbrev Number: 1 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x3e899): M0AR
    <26d>   DW_AT_decl_file   : 5
    <26e>   DW_AT_decl_line   : 218
    <26f>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xbd>
    <274>   DW_AT_data_member_location: 12
 <2><275>: Abbrev Number: 1 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0xddb2): M1AR
    <27a>   DW_AT_decl_file   : 5
    <27b>   DW_AT_decl_line   : 219
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xbd>
    <281>   DW_AT_data_member_location: 16
 <2><282>: Abbrev Number: 5 (DW_TAG_member)
    <283>   DW_AT_name        : FCR
    <287>   DW_AT_decl_file   : 5
    <287>   DW_AT_decl_line   : 220
    <288>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xbd>
    <28c>   DW_AT_data_member_location: 20
 <2><28d>: Abbrev Number: 0
 <1><28e>: Abbrev Number: 2 (DW_TAG_typedef)
    <28f>   DW_AT_name        : (indirect string, offset: 0x8ba8b): DMA_Stream_TypeDef
    <293>   DW_AT_decl_file   : 5
    <294>   DW_AT_decl_line   : 221
    <295>   DW_AT_decl_column : 3
    <296>   DW_AT_type        : <0x23e>
 <1><29a>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <29b>   DW_AT_encoding    : 7	(unsigned)
    <29c>   DW_AT_byte_size   : 1
    <29d>   DW_AT_type        : <0x3d>
    <2a1>   DW_AT_decl_file   : 6
    <2a2>   DW_AT_decl_line   : 191
    <2a3>   DW_AT_decl_column : 1
    <2a4>   DW_AT_sibling     : <0x2b5>
 <2><2a8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x47f1a): DISABLE
    <2ad>   DW_AT_const_value : 0
 <2><2ae>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2af>   DW_AT_name        : (indirect string, offset: 0x8bf85): ENABLE
    <2b3>   DW_AT_const_value : 1
 <2><2b4>: Abbrev Number: 0
 <1><2b5>: Abbrev Number: 2 (DW_TAG_typedef)
    <2b6>   DW_AT_name        : (indirect string, offset: 0x98971): FunctionalState
    <2ba>   DW_AT_decl_file   : 6
    <2bb>   DW_AT_decl_line   : 194
    <2bc>   DW_AT_decl_column : 3
    <2bd>   DW_AT_type        : <0x29a>
 <1><2c1>: Abbrev Number: 4 (DW_TAG_base_type)
    <2c2>   DW_AT_byte_size   : 8
    <2c3>   DW_AT_encoding    : 4	(float)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x7e29e): long double
 <1><2c8>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <2c9>   DW_AT_encoding    : 7	(unsigned)
    <2ca>   DW_AT_byte_size   : 1
    <2cb>   DW_AT_type        : <0x3d>
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 39
    <2d1>   DW_AT_decl_column : 1
    <2d2>   DW_AT_sibling     : <0x2ef>
 <2><2d6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x3300e): HAL_OK
    <2db>   DW_AT_const_value : 0
 <2><2dc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2dd>   DW_AT_name        : (indirect string, offset: 0x5ef2a): HAL_ERROR
    <2e1>   DW_AT_const_value : 1
 <2><2e2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x80724): HAL_BUSY
    <2e7>   DW_AT_const_value : 2
 <2><2e8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x2c349): HAL_TIMEOUT
    <2ed>   DW_AT_const_value : 3
 <2><2ee>: Abbrev Number: 0
 <1><2ef>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x89dc3): HAL_StatusTypeDef
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 44
    <2f6>   DW_AT_decl_column : 3
    <2f7>   DW_AT_type        : <0x2c8>
 <1><2fb>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <2fc>   DW_AT_encoding    : 7	(unsigned)
    <2fd>   DW_AT_byte_size   : 1
    <2fe>   DW_AT_type        : <0x3d>
    <302>   DW_AT_decl_file   : 7
    <303>   DW_AT_decl_line   : 50
    <304>   DW_AT_decl_column : 1
    <305>   DW_AT_sibling     : <0x316>
 <2><309>: Abbrev Number: 3 (DW_TAG_enumerator)
    <30a>   DW_AT_name        : (indirect string, offset: 0x718bb): HAL_UNLOCKED
    <30e>   DW_AT_const_value : 0
 <2><30f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <310>   DW_AT_name        : (indirect string, offset: 0x992e3): HAL_LOCKED
    <314>   DW_AT_const_value : 1
 <2><315>: Abbrev Number: 0
 <1><316>: Abbrev Number: 2 (DW_TAG_typedef)
    <317>   DW_AT_name        : (indirect string, offset: 0x5c7e2): HAL_LockTypeDef
    <31b>   DW_AT_decl_file   : 7
    <31c>   DW_AT_decl_line   : 53
    <31d>   DW_AT_decl_column : 3
    <31e>   DW_AT_type        : <0x2fb>
 <1><322>: Abbrev Number: 9 (DW_TAG_structure_type)
    <323>   DW_AT_byte_size   : 48
    <324>   DW_AT_decl_file   : 8
    <325>   DW_AT_decl_line   : 48
    <326>   DW_AT_decl_column : 9
    <326>   DW_AT_sibling     : <0x3c7>
 <2><32a>: Abbrev Number: 1 (DW_TAG_member)
    <32b>   DW_AT_name        : (indirect string, offset: 0x9a127): Channel
    <32f>   DW_AT_decl_file   : 8
    <330>   DW_AT_decl_line   : 50
    <331>   DW_AT_decl_column : 12
    <332>   DW_AT_type        : <0xb1>
    <336>   DW_AT_data_member_location: 0
 <2><337>: Abbrev Number: 1 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0x8a68f): Direction
    <33c>   DW_AT_decl_file   : 8
    <33d>   DW_AT_decl_line   : 53
    <33e>   DW_AT_decl_column : 12
    <33f>   DW_AT_type        : <0xb1>
    <343>   DW_AT_data_member_location: 4
 <2><344>: Abbrev Number: 1 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0xa018): PeriphInc
    <349>   DW_AT_decl_file   : 8
    <34a>   DW_AT_decl_line   : 57
    <34b>   DW_AT_decl_column : 12
    <34c>   DW_AT_type        : <0xb1>
    <350>   DW_AT_data_member_location: 8
 <2><351>: Abbrev Number: 1 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0x178d8): MemInc
    <356>   DW_AT_decl_file   : 8
    <357>   DW_AT_decl_line   : 60
    <358>   DW_AT_decl_column : 12
    <359>   DW_AT_type        : <0xb1>
    <35d>   DW_AT_data_member_location: 12
 <2><35e>: Abbrev Number: 1 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x4baba): PeriphDataAlignment
    <363>   DW_AT_decl_file   : 8
    <364>   DW_AT_decl_line   : 63
    <365>   DW_AT_decl_column : 12
    <366>   DW_AT_type        : <0xb1>
    <36a>   DW_AT_data_member_location: 16
 <2><36b>: Abbrev Number: 1 (DW_TAG_member)
    <36c>   DW_AT_name        : (indirect string, offset: 0x8ae8c): MemDataAlignment
    <370>   DW_AT_decl_file   : 8
    <371>   DW_AT_decl_line   : 66
    <372>   DW_AT_decl_column : 12
    <373>   DW_AT_type        : <0xb1>
    <377>   DW_AT_data_member_location: 20
 <2><378>: Abbrev Number: 1 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0xa1aa1): Mode
    <37d>   DW_AT_decl_file   : 8
    <37e>   DW_AT_decl_line   : 69
    <37f>   DW_AT_decl_column : 12
    <380>   DW_AT_type        : <0xb1>
    <384>   DW_AT_data_member_location: 24
 <2><385>: Abbrev Number: 1 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0xa26ce): Priority
    <38a>   DW_AT_decl_file   : 8
    <38b>   DW_AT_decl_line   : 74
    <38c>   DW_AT_decl_column : 12
    <38d>   DW_AT_type        : <0xb1>
    <391>   DW_AT_data_member_location: 28
 <2><392>: Abbrev Number: 1 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0x40e92): FIFOMode
    <397>   DW_AT_decl_file   : 8
    <398>   DW_AT_decl_line   : 77
    <399>   DW_AT_decl_column : 12
    <39a>   DW_AT_type        : <0xb1>
    <39e>   DW_AT_data_member_location: 32
 <2><39f>: Abbrev Number: 1 (DW_TAG_member)
    <3a0>   DW_AT_name        : (indirect string, offset: 0x74db8): FIFOThreshold
    <3a4>   DW_AT_decl_file   : 8
    <3a5>   DW_AT_decl_line   : 82
    <3a6>   DW_AT_decl_column : 12
    <3a7>   DW_AT_type        : <0xb1>
    <3ab>   DW_AT_data_member_location: 36
 <2><3ac>: Abbrev Number: 1 (DW_TAG_member)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x3bc69): MemBurst
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 85
    <3b3>   DW_AT_decl_column : 12
    <3b4>   DW_AT_type        : <0xb1>
    <3b8>   DW_AT_data_member_location: 40
 <2><3b9>: Abbrev Number: 1 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x33c81): PeriphBurst
    <3be>   DW_AT_decl_file   : 8
    <3bf>   DW_AT_decl_line   : 91
    <3c0>   DW_AT_decl_column : 12
    <3c1>   DW_AT_type        : <0xb1>
    <3c5>   DW_AT_data_member_location: 44
 <2><3c6>: Abbrev Number: 0
 <1><3c7>: Abbrev Number: 2 (DW_TAG_typedef)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x28c05): DMA_InitTypeDef
    <3cc>   DW_AT_decl_file   : 8
    <3cd>   DW_AT_decl_line   : 96
    <3ce>   DW_AT_decl_column : 2
    <3cf>   DW_AT_type        : <0x322>
 <1><3d3>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <3d4>   DW_AT_encoding    : 7	(unsigned)
    <3d5>   DW_AT_byte_size   : 1
    <3d6>   DW_AT_type        : <0x3d>
    <3da>   DW_AT_decl_file   : 8
    <3db>   DW_AT_decl_line   : 103
    <3dc>   DW_AT_decl_column : 1
    <3dd>   DW_AT_sibling     : <0x406>
 <2><3e1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x72a46): HAL_DMA_STATE_RESET
    <3e6>   DW_AT_const_value : 0
 <2><3e7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x29b4e): HAL_DMA_STATE_READY
    <3ec>   DW_AT_const_value : 1
 <2><3ed>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x69709): HAL_DMA_STATE_BUSY
    <3f2>   DW_AT_const_value : 2
 <2><3f3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x970a3): HAL_DMA_STATE_TIMEOUT
    <3f8>   DW_AT_const_value : 3
 <2><3f9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x83773): HAL_DMA_STATE_ERROR
    <3fe>   DW_AT_const_value : 4
 <2><3ff>: Abbrev Number: 3 (DW_TAG_enumerator)
    <400>   DW_AT_name        : (indirect string, offset: 0x227f7): HAL_DMA_STATE_ABORT
    <404>   DW_AT_const_value : 5
 <2><405>: Abbrev Number: 0
 <1><406>: Abbrev Number: 2 (DW_TAG_typedef)
    <407>   DW_AT_name        : (indirect string, offset: 0x5425d): HAL_DMA_StateTypeDef
    <40b>   DW_AT_decl_file   : 8
    <40c>   DW_AT_decl_line   : 110
    <40d>   DW_AT_decl_column : 2
    <40e>   DW_AT_type        : <0x3d3>
 <1><412>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <413>   DW_AT_type        : <0x406>
 <1><417>: Abbrev Number: 19 (DW_TAG_structure_type)
    <418>   DW_AT_name        : (indirect string, offset: 0x82ba6): __DMA_HandleTypeDef
    <41c>   DW_AT_byte_size   : 96
    <41d>   DW_AT_decl_file   : 8
    <41e>   DW_AT_decl_line   : 138
    <41f>   DW_AT_decl_column : 16
    <420>   DW_AT_sibling     : <0x4db>
 <2><424>: Abbrev Number: 1 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <429>   DW_AT_decl_file   : 8
    <42a>   DW_AT_decl_line   : 140
    <42b>   DW_AT_decl_column : 31
    <42c>   DW_AT_type        : <0x4db>
    <430>   DW_AT_data_member_location: 0
 <2><431>: Abbrev Number: 1 (DW_TAG_member)
    <432>   DW_AT_name        : (indirect string, offset: 0x9f42e): Init
    <436>   DW_AT_decl_file   : 8
    <437>   DW_AT_decl_line   : 142
    <438>   DW_AT_decl_column : 30
    <439>   DW_AT_type        : <0x3c7>
    <43d>   DW_AT_data_member_location: 4
 <2><43e>: Abbrev Number: 1 (DW_TAG_member)
    <43f>   DW_AT_name        : (indirect string, offset: 0x6ce85): Lock
    <443>   DW_AT_decl_file   : 8
    <444>   DW_AT_decl_line   : 144
    <445>   DW_AT_decl_column : 30
    <446>   DW_AT_type        : <0x316>
    <44a>   DW_AT_data_member_location: 52
 <2><44b>: Abbrev Number: 1 (DW_TAG_member)
    <44c>   DW_AT_name        : (indirect string, offset: 0x9f513): State
    <450>   DW_AT_decl_file   : 8
    <451>   DW_AT_decl_line   : 146
    <452>   DW_AT_decl_column : 30
    <453>   DW_AT_type        : <0x412>
    <457>   DW_AT_data_member_location: 53
 <2><458>: Abbrev Number: 1 (DW_TAG_member)
    <459>   DW_AT_name        : (indirect string, offset: 0x920e1): Parent
    <45d>   DW_AT_decl_file   : 8
    <45e>   DW_AT_decl_line   : 148
    <45f>   DW_AT_decl_column : 31
    <460>   DW_AT_type        : <0x4e0>
    <464>   DW_AT_data_member_location: 56
 <2><465>: Abbrev Number: 1 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0x98b66): XferCpltCallback
    <46a>   DW_AT_decl_file   : 8
    <46b>   DW_AT_decl_line   : 150
    <46c>   DW_AT_decl_column : 33
    <46d>   DW_AT_type        : <0x4f2>
    <471>   DW_AT_data_member_location: 60
 <2><472>: Abbrev Number: 1 (DW_TAG_member)
    <473>   DW_AT_name        : (indirect string, offset: 0x77583): XferHalfCpltCallback
    <477>   DW_AT_decl_file   : 8
    <478>   DW_AT_decl_line   : 152
    <479>   DW_AT_decl_column : 33
    <47a>   DW_AT_type        : <0x4f2>
    <47e>   DW_AT_data_member_location: 64
 <2><47f>: Abbrev Number: 1 (DW_TAG_member)
    <480>   DW_AT_name        : (indirect string, offset: 0x2421b): XferM1CpltCallback
    <484>   DW_AT_decl_file   : 8
    <485>   DW_AT_decl_line   : 154
    <486>   DW_AT_decl_column : 33
    <487>   DW_AT_type        : <0x4f2>
    <48b>   DW_AT_data_member_location: 68
 <2><48c>: Abbrev Number: 1 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0x5443e): XferM1HalfCpltCallback
    <491>   DW_AT_decl_file   : 8
    <492>   DW_AT_decl_line   : 156
    <493>   DW_AT_decl_column : 33
    <494>   DW_AT_type        : <0x4f2>
    <498>   DW_AT_data_member_location: 72
 <2><499>: Abbrev Number: 1 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x15c13): XferErrorCallback
    <49e>   DW_AT_decl_file   : 8
    <49f>   DW_AT_decl_line   : 158
    <4a0>   DW_AT_decl_column : 33
    <4a1>   DW_AT_type        : <0x4f2>
    <4a5>   DW_AT_data_member_location: 76
 <2><4a6>: Abbrev Number: 1 (DW_TAG_member)
    <4a7>   DW_AT_name        : (indirect string, offset: 0x8f71e): XferAbortCallback
    <4ab>   DW_AT_decl_file   : 8
    <4ac>   DW_AT_decl_line   : 160
    <4ad>   DW_AT_decl_column : 33
    <4ae>   DW_AT_type        : <0x4f2>
    <4b2>   DW_AT_data_member_location: 80
 <2><4b3>: Abbrev Number: 1 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x96268): ErrorCode
    <4b8>   DW_AT_decl_file   : 8
    <4b9>   DW_AT_decl_line   : 162
    <4ba>   DW_AT_decl_column : 30
    <4bb>   DW_AT_type        : <0xbd>
    <4bf>   DW_AT_data_member_location: 84
 <2><4c0>: Abbrev Number: 1 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x74143): StreamBaseAddress
    <4c5>   DW_AT_decl_file   : 8
    <4c6>   DW_AT_decl_line   : 164
    <4c7>   DW_AT_decl_column : 30
    <4c8>   DW_AT_type        : <0xb1>
    <4cc>   DW_AT_data_member_location: 88
 <2><4cd>: Abbrev Number: 1 (DW_TAG_member)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x813dd): StreamIndex
    <4d2>   DW_AT_decl_file   : 8
    <4d3>   DW_AT_decl_line   : 166
    <4d4>   DW_AT_decl_column : 30
    <4d5>   DW_AT_type        : <0xb1>
    <4d9>   DW_AT_data_member_location: 92
 <2><4da>: Abbrev Number: 0
 <1><4db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4dc>   DW_AT_byte_size   : 4
    <4dc>   DW_AT_type        : <0x28e>
 <1><4e0>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <4e1>   DW_AT_byte_size   : 4
 <1><4e2>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <4e3>   DW_AT_prototyped  : 1
    <4e3>   DW_AT_sibling     : <0x4ed>
 <2><4e7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <4e8>   DW_AT_type        : <0x4ed>
 <2><4ec>: Abbrev Number: 0
 <1><4ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4ee>   DW_AT_byte_size   : 4
    <4ee>   DW_AT_type        : <0x417>
 <1><4f2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4f3>   DW_AT_byte_size   : 4
    <4f3>   DW_AT_type        : <0x4e2>
 <1><4f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x82ba8): DMA_HandleTypeDef
    <4fc>   DW_AT_decl_file   : 8
    <4fd>   DW_AT_decl_line   : 168
    <4fe>   DW_AT_decl_column : 2
    <4ff>   DW_AT_type        : <0x417>
 <1><503>: Abbrev Number: 9 (DW_TAG_structure_type)
    <504>   DW_AT_byte_size   : 48
    <505>   DW_AT_decl_file   : 9
    <506>   DW_AT_decl_line   : 59
    <507>   DW_AT_decl_column : 9
    <507>   DW_AT_sibling     : <0x5a8>
 <2><50b>: Abbrev Number: 1 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x87ab6): ClockPrescaler
    <510>   DW_AT_decl_file   : 9
    <511>   DW_AT_decl_line   : 61
    <512>   DW_AT_decl_column : 12
    <513>   DW_AT_type        : <0xb1>
    <517>   DW_AT_data_member_location: 0
 <2><518>: Abbrev Number: 1 (DW_TAG_member)
    <519>   DW_AT_name        : (indirect string, offset: 0xbfc6): Resolution
    <51d>   DW_AT_decl_file   : 9
    <51e>   DW_AT_decl_line   : 64
    <51f>   DW_AT_decl_column : 12
    <520>   DW_AT_type        : <0xb1>
    <524>   DW_AT_data_member_location: 4
 <2><525>: Abbrev Number: 1 (DW_TAG_member)
    <526>   DW_AT_name        : (indirect string, offset: 0x20ed8): DataAlign
    <52a>   DW_AT_decl_file   : 9
    <52b>   DW_AT_decl_line   : 66
    <52c>   DW_AT_decl_column : 12
    <52d>   DW_AT_type        : <0xb1>
    <531>   DW_AT_data_member_location: 8
 <2><532>: Abbrev Number: 1 (DW_TAG_member)
    <533>   DW_AT_name        : (indirect string, offset: 0x5b681): ScanConvMode
    <537>   DW_AT_decl_file   : 9
    <538>   DW_AT_decl_line   : 69
    <539>   DW_AT_decl_column : 12
    <53a>   DW_AT_type        : <0xb1>
    <53e>   DW_AT_data_member_location: 12
 <2><53f>: Abbrev Number: 1 (DW_TAG_member)
    <540>   DW_AT_name        : (indirect string, offset: 0x65580): EOCSelection
    <544>   DW_AT_decl_file   : 9
    <545>   DW_AT_decl_line   : 76
    <546>   DW_AT_decl_column : 12
    <547>   DW_AT_type        : <0xb1>
    <54b>   DW_AT_data_member_location: 16
 <2><54c>: Abbrev Number: 1 (DW_TAG_member)
    <54d>   DW_AT_name        : (indirect string, offset: 0x3f0e4): ContinuousConvMode
    <551>   DW_AT_decl_file   : 9
    <552>   DW_AT_decl_line   : 83
    <553>   DW_AT_decl_column : 19
    <554>   DW_AT_type        : <0x2b5>
    <558>   DW_AT_data_member_location: 20
 <2><559>: Abbrev Number: 1 (DW_TAG_member)
    <55a>   DW_AT_name        : (indirect string, offset: 0x5af71): NbrOfConversion
    <55e>   DW_AT_decl_file   : 9
    <55f>   DW_AT_decl_line   : 86
    <560>   DW_AT_decl_column : 12
    <561>   DW_AT_type        : <0xb1>
    <565>   DW_AT_data_member_location: 24
 <2><566>: Abbrev Number: 1 (DW_TAG_member)
    <567>   DW_AT_name        : (indirect string, offset: 0x39d1b): DiscontinuousConvMode
    <56b>   DW_AT_decl_file   : 9
    <56c>   DW_AT_decl_line   : 89
    <56d>   DW_AT_decl_column : 19
    <56e>   DW_AT_type        : <0x2b5>
    <572>   DW_AT_data_member_location: 28
 <2><573>: Abbrev Number: 1 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0x15ac7): NbrOfDiscConversion
    <578>   DW_AT_decl_file   : 9
    <579>   DW_AT_decl_line   : 93
    <57a>   DW_AT_decl_column : 12
    <57b>   DW_AT_type        : <0xb1>
    <57f>   DW_AT_data_member_location: 32
 <2><580>: Abbrev Number: 1 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0x6e51d): ExternalTrigConv
    <585>   DW_AT_decl_file   : 9
    <586>   DW_AT_decl_line   : 96
    <587>   DW_AT_decl_column : 12
    <588>   DW_AT_type        : <0xb1>
    <58c>   DW_AT_data_member_location: 36
 <2><58d>: Abbrev Number: 1 (DW_TAG_member)
    <58e>   DW_AT_name        : (indirect string, offset: 0x297e3): ExternalTrigConvEdge
    <592>   DW_AT_decl_file   : 9
    <593>   DW_AT_decl_line   : 100
    <594>   DW_AT_decl_column : 12
    <595>   DW_AT_type        : <0xb1>
    <599>   DW_AT_data_member_location: 40
 <2><59a>: Abbrev Number: 1 (DW_TAG_member)
    <59b>   DW_AT_name        : (indirect string, offset: 0x3bf49): DMAContinuousRequests
    <59f>   DW_AT_decl_file   : 9
    <5a0>   DW_AT_decl_line   : 103
    <5a1>   DW_AT_decl_column : 19
    <5a2>   DW_AT_type        : <0x2b5>
    <5a6>   DW_AT_data_member_location: 44
 <2><5a7>: Abbrev Number: 0
 <1><5a8>: Abbrev Number: 2 (DW_TAG_typedef)
    <5a9>   DW_AT_name        : (indirect string, offset: 0x237b6): ADC_InitTypeDef
    <5ad>   DW_AT_decl_file   : 9
    <5ae>   DW_AT_decl_line   : 108
    <5af>   DW_AT_decl_column : 3
    <5b0>   DW_AT_type        : <0x503>
 <1><5b4>: Abbrev Number: 9 (DW_TAG_structure_type)
    <5b5>   DW_AT_byte_size   : 72
    <5b6>   DW_AT_decl_file   : 9
    <5b7>   DW_AT_decl_line   : 195
    <5b8>   DW_AT_decl_column : 9
    <5b8>   DW_AT_sibling     : <0x618>
 <2><5bc>: Abbrev Number: 1 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <5c1>   DW_AT_decl_file   : 9
    <5c2>   DW_AT_decl_line   : 198
    <5c3>   DW_AT_decl_column : 34
    <5c4>   DW_AT_type        : <0x618>
    <5c8>   DW_AT_data_member_location: 0
 <2><5c9>: Abbrev Number: 1 (DW_TAG_member)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x9f42e): Init
    <5ce>   DW_AT_decl_file   : 9
    <5cf>   DW_AT_decl_line   : 200
    <5d0>   DW_AT_decl_column : 33
    <5d1>   DW_AT_type        : <0x5a8>
    <5d5>   DW_AT_data_member_location: 4
 <2><5d6>: Abbrev Number: 1 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x2728e): NbrOfCurrentConversionRank
    <5db>   DW_AT_decl_file   : 9
    <5dc>   DW_AT_decl_line   : 202
    <5dd>   DW_AT_decl_column : 33
    <5de>   DW_AT_type        : <0xbd>
    <5e2>   DW_AT_data_member_location: 52
 <2><5e3>: Abbrev Number: 1 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x195b): DMA_Handle
    <5e8>   DW_AT_decl_file   : 9
    <5e9>   DW_AT_decl_line   : 204
    <5ea>   DW_AT_decl_column : 34
    <5eb>   DW_AT_type        : <0x61d>
    <5ef>   DW_AT_data_member_location: 56
 <2><5f0>: Abbrev Number: 1 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x6ce85): Lock
    <5f5>   DW_AT_decl_file   : 9
    <5f6>   DW_AT_decl_line   : 206
    <5f7>   DW_AT_decl_column : 33
    <5f8>   DW_AT_type        : <0x316>
    <5fc>   DW_AT_data_member_location: 60
 <2><5fd>: Abbrev Number: 1 (DW_TAG_member)
    <5fe>   DW_AT_name        : (indirect string, offset: 0x9f513): State
    <602>   DW_AT_decl_file   : 9
    <603>   DW_AT_decl_line   : 208
    <604>   DW_AT_decl_column : 33
    <605>   DW_AT_type        : <0xbd>
    <609>   DW_AT_data_member_location: 64
 <2><60a>: Abbrev Number: 1 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x96268): ErrorCode
    <60f>   DW_AT_decl_file   : 9
    <610>   DW_AT_decl_line   : 210
    <611>   DW_AT_decl_column : 33
    <612>   DW_AT_type        : <0xbd>
    <616>   DW_AT_data_member_location: 68
 <2><617>: Abbrev Number: 0
 <1><618>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <619>   DW_AT_byte_size   : 4
    <619>   DW_AT_type        : <0x232>
 <1><61d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <61e>   DW_AT_byte_size   : 4
    <61e>   DW_AT_type        : <0x4f7>
 <1><622>: Abbrev Number: 2 (DW_TAG_typedef)
    <623>   DW_AT_name        : (indirect string, offset: 0x1e318): ADC_HandleTypeDef
    <627>   DW_AT_decl_file   : 9
    <628>   DW_AT_decl_line   : 220
    <629>   DW_AT_decl_column : 3
    <62a>   DW_AT_type        : <0x5b4>
 <1><62e>: Abbrev Number: 13 (DW_TAG_variable)
    <62f>   DW_AT_name        : (indirect string, offset: 0x3d723): hadc1
    <633>   DW_AT_decl_file   : 10
    <634>   DW_AT_decl_line   : 35
    <635>   DW_AT_decl_column : 26
    <636>   DW_AT_type        : <0x622>
    <63a>   DW_AT_external    : 1
    <63a>   DW_AT_declaration : 1
 <1><63a>: Abbrev Number: 4 (DW_TAG_base_type)
    <63b>   DW_AT_byte_size   : 1
    <63c>   DW_AT_encoding    : 8	(unsigned char)
    <63d>   DW_AT_name        : (indirect string, offset: 0x30e5f): char
 <1><641>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <642>   DW_AT_encoding    : 5	(signed)
    <643>   DW_AT_byte_size   : 4
    <644>   DW_AT_type        : <0x86>
    <648>   DW_AT_decl_file   : 11
    <649>   DW_AT_decl_line   : 176
    <64a>   DW_AT_decl_column : 14
    <64b>   DW_AT_sibling     : <0x683>
 <2><64f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <650>   DW_AT_name        : (indirect string, offset: 0x87e85): osOK
    <654>   DW_AT_const_value : 0
 <2><655>: Abbrev Number: 10 (DW_TAG_enumerator)
    <656>   DW_AT_name        : (indirect string, offset: 0x45c7a): osError
    <65a>   DW_AT_const_value : -1
 <2><65b>: Abbrev Number: 10 (DW_TAG_enumerator)
    <65c>   DW_AT_name        : (indirect string, offset: 0x15ab8): osErrorTimeout
    <660>   DW_AT_const_value : -2
 <2><661>: Abbrev Number: 10 (DW_TAG_enumerator)
    <662>   DW_AT_name        : (indirect string, offset: 0x631c2): osErrorResource
    <666>   DW_AT_const_value : -3
 <2><667>: Abbrev Number: 10 (DW_TAG_enumerator)
    <668>   DW_AT_name        : (indirect string, offset: 0x276ea): osErrorParameter
    <66c>   DW_AT_const_value : -4
 <2><66d>: Abbrev Number: 10 (DW_TAG_enumerator)
    <66e>   DW_AT_name        : (indirect string, offset: 0x1a2c4): osErrorNoMemory
    <672>   DW_AT_const_value : -5
 <2><673>: Abbrev Number: 10 (DW_TAG_enumerator)
    <674>   DW_AT_name        : (indirect string, offset: 0x28f14): osErrorISR
    <678>   DW_AT_const_value : -6
 <2><679>: Abbrev Number: 22 (DW_TAG_enumerator)
    <67a>   DW_AT_name        : (indirect string, offset: 0x4cc31): osStatusReserved
    <67e>   DW_AT_const_value : 0x7fffffff
 <2><682>: Abbrev Number: 0
 <1><683>: Abbrev Number: 2 (DW_TAG_typedef)
    <684>   DW_AT_name        : (indirect string, offset: 0x33983): osStatus_t
    <688>   DW_AT_decl_file   : 11
    <689>   DW_AT_decl_line   : 185
    <68a>   DW_AT_decl_column : 3
    <68b>   DW_AT_type        : <0x641>
 <1><68f>: Abbrev Number: 2 (DW_TAG_typedef)
    <690>   DW_AT_name        : (indirect string, offset: 0x43e0b): osMessageQueueId_t
    <694>   DW_AT_decl_file   : 11
    <695>   DW_AT_decl_line   : 207
    <696>   DW_AT_decl_column : 15
    <697>   DW_AT_type        : <0x4e0>
 <1><69b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <69c>   DW_AT_byte_size   : 4
    <69c>   DW_AT_type        : <0x6a0>
 <1><6a0>: Abbrev Number: 23 (DW_TAG_const_type)
 <1><6a1>: Abbrev Number: 13 (DW_TAG_variable)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x74458): adcQueueHandle
    <6a6>   DW_AT_decl_file   : 1
    <6a7>   DW_AT_decl_line   : 12
    <6a8>   DW_AT_decl_column : 27
    <6a9>   DW_AT_type        : <0x68f>
    <6ad>   DW_AT_external    : 1
    <6ad>   DW_AT_declaration : 1
 <1><6ad>: Abbrev Number: 24 (DW_TAG_variable)
    <6ae>   DW_AT_specification: <0xd7>
    <6b2>   DW_AT_decl_file   : 1
    <6b3>   DW_AT_decl_column : 19
    <6b4>   DW_AT_location    : 5 byte block: 3 d4 2 0 20 	(DW_OP_addr: 200002d4)
 <1><6ba>: Abbrev Number: 6 (DW_TAG_variable)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x90876): windDirectionGain
    <6bf>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 15
    <6c0>   DW_AT_decl_column : 7
    <6c1>   DW_AT_type        : <0x120>
    <6c5>   DW_AT_external    : 1
    <6c5>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><6cb>: Abbrev Number: 6 (DW_TAG_variable)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x98b8f): windDirectionOffset
    <6d0>   DW_AT_decl_file   : 1
    <6d0>   DW_AT_decl_line   : 16
    <6d1>   DW_AT_decl_column : 7
    <6d2>   DW_AT_type        : <0x120>
    <6d6>   DW_AT_external    : 1
    <6d6>   DW_AT_location    : 5 byte block: 3 dc 2 0 20 	(DW_OP_addr: 200002dc)
 <1><6dc>: Abbrev Number: 6 (DW_TAG_variable)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x76b35): batteryVoltageGain
    <6e1>   DW_AT_decl_file   : 1
    <6e1>   DW_AT_decl_line   : 18
    <6e2>   DW_AT_decl_column : 7
    <6e3>   DW_AT_type        : <0x120>
    <6e7>   DW_AT_external    : 1
    <6e7>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><6ed>: Abbrev Number: 6 (DW_TAG_variable)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x76ff3): batteryVoltageOffset
    <6f2>   DW_AT_decl_file   : 1
    <6f2>   DW_AT_decl_line   : 19
    <6f3>   DW_AT_decl_column : 7
    <6f4>   DW_AT_type        : <0x120>
    <6f8>   DW_AT_external    : 1
    <6f8>   DW_AT_location    : 5 byte block: 3 e0 2 0 20 	(DW_OP_addr: 200002e0)
 <1><6fe>: Abbrev Number: 6 (DW_TAG_variable)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x614bd): extra1Gain
    <703>   DW_AT_decl_file   : 1
    <703>   DW_AT_decl_line   : 21
    <704>   DW_AT_decl_column : 7
    <705>   DW_AT_type        : <0x120>
    <709>   DW_AT_external    : 1
    <709>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><70f>: Abbrev Number: 6 (DW_TAG_variable)
    <710>   DW_AT_name        : (indirect string, offset: 0x4029): extra1Offset
    <714>   DW_AT_decl_file   : 1
    <714>   DW_AT_decl_line   : 22
    <715>   DW_AT_decl_column : 7
    <716>   DW_AT_type        : <0x120>
    <71a>   DW_AT_external    : 1
    <71a>   DW_AT_location    : 5 byte block: 3 e4 2 0 20 	(DW_OP_addr: 200002e4)
 <1><720>: Abbrev Number: 6 (DW_TAG_variable)
    <721>   DW_AT_name        : (indirect string, offset: 0x93a8d): extra2Gain
    <725>   DW_AT_decl_file   : 1
    <725>   DW_AT_decl_line   : 24
    <726>   DW_AT_decl_column : 7
    <727>   DW_AT_type        : <0x120>
    <72b>   DW_AT_external    : 1
    <72b>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <1><731>: Abbrev Number: 6 (DW_TAG_variable)
    <732>   DW_AT_name        : (indirect string, offset: 0x5a61f): extra2Offset
    <736>   DW_AT_decl_file   : 1
    <736>   DW_AT_decl_line   : 25
    <737>   DW_AT_decl_column : 7
    <738>   DW_AT_type        : <0x120>
    <73c>   DW_AT_external    : 1
    <73c>   DW_AT_location    : 5 byte block: 3 e8 2 0 20 	(DW_OP_addr: 200002e8)
 <1><742>: Abbrev Number: 6 (DW_TAG_variable)
    <743>   DW_AT_name        : (indirect string, offset: 0x40bd8): adcDataSent
    <747>   DW_AT_decl_file   : 1
    <747>   DW_AT_decl_line   : 26
    <748>   DW_AT_decl_column : 11
    <749>   DW_AT_type        : <0x127>
    <74d>   DW_AT_external    : 1
    <74d>   DW_AT_location    : 5 byte block: 3 ec 2 0 20 	(DW_OP_addr: 200002ec)
 <1><753>: Abbrev Number: 14 (DW_TAG_subprogram)
    <754>   DW_AT_external    : 1
    <754>   DW_AT_name        : (indirect string, offset: 0x6d5cf): osMessageQueuePut
    <758>   DW_AT_decl_file   : 11
    <759>   DW_AT_decl_line   : 689
    <75b>   DW_AT_decl_column : 12
    <75c>   DW_AT_prototyped  : 1
    <75c>   DW_AT_type        : <0x683>
    <760>   DW_AT_declaration : 1
    <760>   DW_AT_sibling     : <0x779>
 <2><764>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <765>   DW_AT_type        : <0x68f>
 <2><769>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <76a>   DW_AT_type        : <0x69b>
 <2><76e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <76f>   DW_AT_type        : <0x94>
 <2><773>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <774>   DW_AT_type        : <0xb1>
 <2><778>: Abbrev Number: 0
 <1><779>: Abbrev Number: 14 (DW_TAG_subprogram)
    <77a>   DW_AT_external    : 1
    <77a>   DW_AT_name        : (indirect string, offset: 0x99f27): HAL_ADC_Start_DMA
    <77e>   DW_AT_decl_file   : 9
    <77f>   DW_AT_decl_line   : 594
    <781>   DW_AT_decl_column : 19
    <782>   DW_AT_prototyped  : 1
    <782>   DW_AT_type        : <0x2ef>
    <786>   DW_AT_declaration : 1
    <786>   DW_AT_sibling     : <0x79a>
 <2><78a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <78b>   DW_AT_type        : <0x79a>
 <2><78f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <790>   DW_AT_type        : <0x79f>
 <2><794>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <795>   DW_AT_type        : <0xb1>
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <79b>   DW_AT_byte_size   : 4
    <79b>   DW_AT_type        : <0x622>
 <1><79f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7a0>   DW_AT_byte_size   : 4
    <7a0>   DW_AT_type        : <0xb1>
 <1><7a4>: Abbrev Number: 25 (DW_TAG_subprogram)
    <7a5>   DW_AT_external    : 1
    <7a5>   DW_AT_name        : (indirect string, offset: 0x4bf5c): adc_read
    <7a9>   DW_AT_decl_file   : 1
    <7aa>   DW_AT_decl_line   : 28
    <7ab>   DW_AT_decl_column : 6
    <7ac>   DW_AT_prototyped  : 1
    <7ac>   DW_AT_low_pc      : 0x8000ea8
    <7b0>   DW_AT_high_pc     : 0xf0
    <7b4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7b6>   DW_AT_call_all_tail_calls: 1
 <1><7b6>: Abbrev Number: 0
  Compilation Unit @ offset 0x7b7:
   Length:        0x93f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x151
   Pointer Size:  4
 <0><7c3>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <7c4>   DW_AT_producer    : (indirect string, offset: 0x3818d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <7c8>   DW_AT_language    : 29	(C11)
    <7c9>   DW_AT_name        : (indirect string, offset: 0x99f69): ../Core/Src/CONTROL.c
    <7cd>   DW_AT_comp_dir    : (indirect string, offset: 0x4a233): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <7d1>   DW_AT_ranges      : 0x20
    <7d5>   DW_AT_low_pc      : 0
    <7d9>   DW_AT_stmt_list   : 0x9c3
    <7dd>   DW_AT_macros      : 0x16675
 <1><7e1>: Abbrev Number: 5 (DW_TAG_base_type)
    <7e2>   DW_AT_byte_size   : 1
    <7e3>   DW_AT_encoding    : 6	(signed char)
    <7e4>   DW_AT_name        : (indirect string, offset: 0x4c39b): signed char
 <1><7e8>: Abbrev Number: 4 (DW_TAG_typedef)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x2be2d): __uint8_t
    <7ed>   DW_AT_decl_file   : 2
    <7ee>   DW_AT_decl_line   : 43
    <7ef>   DW_AT_decl_column : 24
    <7f0>   DW_AT_type        : <0x7f4>
 <1><7f4>: Abbrev Number: 5 (DW_TAG_base_type)
    <7f5>   DW_AT_byte_size   : 1
    <7f6>   DW_AT_encoding    : 8	(unsigned char)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x1ec7a): unsigned char
 <1><7fb>: Abbrev Number: 4 (DW_TAG_typedef)
    <7fc>   DW_AT_name        : (indirect string, offset: 0x9a2ba): __int16_t
    <800>   DW_AT_decl_file   : 2
    <801>   DW_AT_decl_line   : 55
    <802>   DW_AT_decl_column : 24
    <803>   DW_AT_type        : <0x807>
 <1><807>: Abbrev Number: 5 (DW_TAG_base_type)
    <808>   DW_AT_byte_size   : 2
    <809>   DW_AT_encoding    : 5	(signed)
    <80a>   DW_AT_name        : (indirect string, offset: 0x7278d): short int
 <1><80e>: Abbrev Number: 5 (DW_TAG_base_type)
    <80f>   DW_AT_byte_size   : 2
    <810>   DW_AT_encoding    : 7	(unsigned)
    <811>   DW_AT_name        : (indirect string, offset: 0x93163): short unsigned int
 <1><815>: Abbrev Number: 5 (DW_TAG_base_type)
    <816>   DW_AT_byte_size   : 4
    <817>   DW_AT_encoding    : 5	(signed)
    <818>   DW_AT_name        : (indirect string, offset: 0xc88b): long int
 <1><81c>: Abbrev Number: 4 (DW_TAG_typedef)
    <81d>   DW_AT_name        : (indirect string, offset: 0x60d58): __uint32_t
    <821>   DW_AT_decl_file   : 2
    <822>   DW_AT_decl_line   : 79
    <823>   DW_AT_decl_column : 25
    <824>   DW_AT_type        : <0x828>
 <1><828>: Abbrev Number: 5 (DW_TAG_base_type)
    <829>   DW_AT_byte_size   : 4
    <82a>   DW_AT_encoding    : 7	(unsigned)
    <82b>   DW_AT_name        : (indirect string, offset: 0x2e981): long unsigned int
 <1><82f>: Abbrev Number: 5 (DW_TAG_base_type)
    <830>   DW_AT_byte_size   : 8
    <831>   DW_AT_encoding    : 5	(signed)
    <832>   DW_AT_name        : (indirect string, offset: 0x44c89): long long int
 <1><836>: Abbrev Number: 5 (DW_TAG_base_type)
    <837>   DW_AT_byte_size   : 8
    <838>   DW_AT_encoding    : 7	(unsigned)
    <839>   DW_AT_name        : (indirect string, offset: 0x1f6bc): long long unsigned int
 <1><83d>: Abbrev Number: 25 (DW_TAG_base_type)
    <83e>   DW_AT_byte_size   : 4
    <83f>   DW_AT_encoding    : 5	(signed)
    <840>   DW_AT_name        : int
 <1><844>: Abbrev Number: 5 (DW_TAG_base_type)
    <845>   DW_AT_byte_size   : 4
    <846>   DW_AT_encoding    : 7	(unsigned)
    <847>   DW_AT_name        : (indirect string, offset: 0xc2e7): unsigned int
 <1><84b>: Abbrev Number: 4 (DW_TAG_typedef)
    <84c>   DW_AT_name        : (indirect string, offset: 0x2be2f): uint8_t
    <850>   DW_AT_decl_file   : 3
    <851>   DW_AT_decl_line   : 24
    <852>   DW_AT_decl_column : 19
    <853>   DW_AT_type        : <0x7e8>
 <1><857>: Abbrev Number: 4 (DW_TAG_typedef)
    <858>   DW_AT_name        : (indirect string, offset: 0x9a2bc): int16_t
    <85c>   DW_AT_decl_file   : 3
    <85d>   DW_AT_decl_line   : 32
    <85e>   DW_AT_decl_column : 19
    <85f>   DW_AT_type        : <0x7fb>
 <1><863>: Abbrev Number: 4 (DW_TAG_typedef)
    <864>   DW_AT_name        : (indirect string, offset: 0x6f2a1): uint32_t
    <868>   DW_AT_decl_file   : 3
    <869>   DW_AT_decl_line   : 48
    <86a>   DW_AT_decl_column : 20
    <86b>   DW_AT_type        : <0x81c>
 <1><86f>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <870>   DW_AT_type        : <0x863>
 <1><874>: Abbrev Number: 13 (DW_TAG_structure_type)
    <875>   DW_AT_byte_size   : 8
    <876>   DW_AT_decl_file   : 4
    <877>   DW_AT_decl_line   : 12
    <878>   DW_AT_decl_column : 9
    <878>   DW_AT_sibling     : <0x8b1>
 <2><87c>: Abbrev Number: 8 (DW_TAG_member)
    <87d>   DW_AT_name        : ch1
    <881>   DW_AT_decl_file   : 4
    <882>   DW_AT_decl_line   : 13
    <883>   DW_AT_decl_column : 10
    <884>   DW_AT_type        : <0x857>
    <888>   DW_AT_data_member_location: 0
 <2><889>: Abbrev Number: 8 (DW_TAG_member)
    <88a>   DW_AT_name        : ch2
    <88e>   DW_AT_decl_file   : 4
    <88f>   DW_AT_decl_line   : 14
    <890>   DW_AT_decl_column : 10
    <891>   DW_AT_type        : <0x857>
    <895>   DW_AT_data_member_location: 2
 <2><896>: Abbrev Number: 8 (DW_TAG_member)
    <897>   DW_AT_name        : ch3
    <89b>   DW_AT_decl_file   : 4
    <89c>   DW_AT_decl_line   : 15
    <89d>   DW_AT_decl_column : 10
    <89e>   DW_AT_type        : <0x857>
    <8a2>   DW_AT_data_member_location: 4
 <2><8a3>: Abbrev Number: 8 (DW_TAG_member)
    <8a4>   DW_AT_name        : ch4
    <8a8>   DW_AT_decl_file   : 4
    <8a9>   DW_AT_decl_line   : 16
    <8aa>   DW_AT_decl_column : 10
    <8ab>   DW_AT_type        : <0x857>
    <8af>   DW_AT_data_member_location: 6
 <2><8b0>: Abbrev Number: 0
 <1><8b1>: Abbrev Number: 4 (DW_TAG_typedef)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x9a2cc): RadioData_t
    <8b6>   DW_AT_decl_file   : 4
    <8b7>   DW_AT_decl_line   : 17
    <8b8>   DW_AT_decl_column : 3
    <8b9>   DW_AT_type        : <0x874>
 <1><8bd>: Abbrev Number: 5 (DW_TAG_base_type)
    <8be>   DW_AT_byte_size   : 4
    <8bf>   DW_AT_encoding    : 4	(float)
    <8c0>   DW_AT_name        : (indirect string, offset: 0x83cdc): float
 <1><8c4>: Abbrev Number: 13 (DW_TAG_structure_type)
    <8c5>   DW_AT_byte_size   : 24
    <8c6>   DW_AT_decl_file   : 5
    <8c7>   DW_AT_decl_line   : 213
    <8c8>   DW_AT_decl_column : 9
    <8c8>   DW_AT_sibling     : <0x91a>
 <2><8cc>: Abbrev Number: 8 (DW_TAG_member)
    <8cd>   DW_AT_name        : CR
    <8d0>   DW_AT_decl_file   : 5
    <8d1>   DW_AT_decl_line   : 215
    <8d2>   DW_AT_decl_column : 17
    <8d3>   DW_AT_type        : <0x86f>
    <8d7>   DW_AT_data_member_location: 0
 <2><8d8>: Abbrev Number: 1 (DW_TAG_member)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x4a59e): NDTR
    <8dd>   DW_AT_decl_file   : 5
    <8de>   DW_AT_decl_line   : 216
    <8df>   DW_AT_decl_column : 17
    <8e0>   DW_AT_type        : <0x86f>
    <8e4>   DW_AT_data_member_location: 4
 <2><8e5>: Abbrev Number: 8 (DW_TAG_member)
    <8e6>   DW_AT_name        : PAR
    <8ea>   DW_AT_decl_file   : 5
    <8eb>   DW_AT_decl_line   : 217
    <8ec>   DW_AT_decl_column : 17
    <8ed>   DW_AT_type        : <0x86f>
    <8f1>   DW_AT_data_member_location: 8
 <2><8f2>: Abbrev Number: 1 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x3e899): M0AR
    <8f7>   DW_AT_decl_file   : 5
    <8f8>   DW_AT_decl_line   : 218
    <8f9>   DW_AT_decl_column : 17
    <8fa>   DW_AT_type        : <0x86f>
    <8fe>   DW_AT_data_member_location: 12
 <2><8ff>: Abbrev Number: 1 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0xddb2): M1AR
    <904>   DW_AT_decl_file   : 5
    <905>   DW_AT_decl_line   : 219
    <906>   DW_AT_decl_column : 17
    <907>   DW_AT_type        : <0x86f>
    <90b>   DW_AT_data_member_location: 16
 <2><90c>: Abbrev Number: 8 (DW_TAG_member)
    <90d>   DW_AT_name        : FCR
    <911>   DW_AT_decl_file   : 5
    <912>   DW_AT_decl_line   : 220
    <913>   DW_AT_decl_column : 17
    <914>   DW_AT_type        : <0x86f>
    <918>   DW_AT_data_member_location: 20
 <2><919>: Abbrev Number: 0
 <1><91a>: Abbrev Number: 4 (DW_TAG_typedef)
    <91b>   DW_AT_name        : (indirect string, offset: 0x8ba8b): DMA_Stream_TypeDef
    <91f>   DW_AT_decl_file   : 5
    <920>   DW_AT_decl_line   : 221
    <921>   DW_AT_decl_column : 3
    <922>   DW_AT_type        : <0x8c4>
 <1><926>: Abbrev Number: 20 (DW_TAG_structure_type)
    <927>   DW_AT_byte_size   : 84
    <928>   DW_AT_decl_file   : 5
    <929>   DW_AT_decl_line   : 469
    <92b>   DW_AT_decl_column : 9
    <92b>   DW_AT_sibling     : <0xa40>
 <2><92f>: Abbrev Number: 6 (DW_TAG_member)
    <930>   DW_AT_name        : CR1
    <934>   DW_AT_decl_file   : 5
    <934>   DW_AT_decl_line   : 471
    <936>   DW_AT_decl_column : 17
    <936>   DW_AT_type        : <0x86f>
    <93a>   DW_AT_data_member_location: 0
 <2><93b>: Abbrev Number: 6 (DW_TAG_member)
    <93c>   DW_AT_name        : CR2
    <940>   DW_AT_decl_file   : 5
    <940>   DW_AT_decl_line   : 472
    <942>   DW_AT_decl_column : 17
    <942>   DW_AT_type        : <0x86f>
    <946>   DW_AT_data_member_location: 4
 <2><947>: Abbrev Number: 3 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0x2c40c): SMCR
    <94c>   DW_AT_decl_file   : 5
    <94d>   DW_AT_decl_line   : 473
    <94f>   DW_AT_decl_column : 17
    <950>   DW_AT_type        : <0x86f>
    <954>   DW_AT_data_member_location: 8
 <2><955>: Abbrev Number: 3 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x30c78): DIER
    <95a>   DW_AT_decl_file   : 5
    <95b>   DW_AT_decl_line   : 474
    <95d>   DW_AT_decl_column : 17
    <95e>   DW_AT_type        : <0x86f>
    <962>   DW_AT_data_member_location: 12
 <2><963>: Abbrev Number: 6 (DW_TAG_member)
    <964>   DW_AT_name        : SR
    <967>   DW_AT_decl_file   : 5
    <967>   DW_AT_decl_line   : 475
    <969>   DW_AT_decl_column : 17
    <969>   DW_AT_type        : <0x86f>
    <96d>   DW_AT_data_member_location: 16
 <2><96e>: Abbrev Number: 6 (DW_TAG_member)
    <96f>   DW_AT_name        : EGR
    <973>   DW_AT_decl_file   : 5
    <973>   DW_AT_decl_line   : 476
    <975>   DW_AT_decl_column : 17
    <975>   DW_AT_type        : <0x86f>
    <979>   DW_AT_data_member_location: 20
 <2><97a>: Abbrev Number: 3 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x8c54b): CCMR1
    <97f>   DW_AT_decl_file   : 5
    <980>   DW_AT_decl_line   : 477
    <982>   DW_AT_decl_column : 17
    <983>   DW_AT_type        : <0x86f>
    <987>   DW_AT_data_member_location: 24
 <2><988>: Abbrev Number: 3 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x3c1c3): CCMR2
    <98d>   DW_AT_decl_file   : 5
    <98e>   DW_AT_decl_line   : 478
    <990>   DW_AT_decl_column : 17
    <991>   DW_AT_type        : <0x86f>
    <995>   DW_AT_data_member_location: 28
 <2><996>: Abbrev Number: 3 (DW_TAG_member)
    <997>   DW_AT_name        : (indirect string, offset: 0x1faae): CCER
    <99b>   DW_AT_decl_file   : 5
    <99c>   DW_AT_decl_line   : 479
    <99e>   DW_AT_decl_column : 17
    <99f>   DW_AT_type        : <0x86f>
    <9a3>   DW_AT_data_member_location: 32
 <2><9a4>: Abbrev Number: 6 (DW_TAG_member)
    <9a5>   DW_AT_name        : CNT
    <9a9>   DW_AT_decl_file   : 5
    <9a9>   DW_AT_decl_line   : 480
    <9ab>   DW_AT_decl_column : 17
    <9ab>   DW_AT_type        : <0x86f>
    <9af>   DW_AT_data_member_location: 36
 <2><9b0>: Abbrev Number: 6 (DW_TAG_member)
    <9b1>   DW_AT_name        : PSC
    <9b5>   DW_AT_decl_file   : 5
    <9b5>   DW_AT_decl_line   : 481
    <9b7>   DW_AT_decl_column : 17
    <9b7>   DW_AT_type        : <0x86f>
    <9bb>   DW_AT_data_member_location: 40
 <2><9bc>: Abbrev Number: 6 (DW_TAG_member)
    <9bd>   DW_AT_name        : ARR
    <9c1>   DW_AT_decl_file   : 5
    <9c1>   DW_AT_decl_line   : 482
    <9c3>   DW_AT_decl_column : 17
    <9c3>   DW_AT_type        : <0x86f>
    <9c7>   DW_AT_data_member_location: 44
 <2><9c8>: Abbrev Number: 6 (DW_TAG_member)
    <9c9>   DW_AT_name        : RCR
    <9cd>   DW_AT_decl_file   : 5
    <9cd>   DW_AT_decl_line   : 483
    <9cf>   DW_AT_decl_column : 17
    <9cf>   DW_AT_type        : <0x86f>
    <9d3>   DW_AT_data_member_location: 48
 <2><9d4>: Abbrev Number: 3 (DW_TAG_member)
    <9d5>   DW_AT_name        : (indirect string, offset: 0x118c7): CCR1
    <9d9>   DW_AT_decl_file   : 5
    <9da>   DW_AT_decl_line   : 484
    <9dc>   DW_AT_decl_column : 17
    <9dd>   DW_AT_type        : <0x86f>
    <9e1>   DW_AT_data_member_location: 52
 <2><9e2>: Abbrev Number: 3 (DW_TAG_member)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x3f064): CCR2
    <9e7>   DW_AT_decl_file   : 5
    <9e8>   DW_AT_decl_line   : 485
    <9ea>   DW_AT_decl_column : 17
    <9eb>   DW_AT_type        : <0x86f>
    <9ef>   DW_AT_data_member_location: 56
 <2><9f0>: Abbrev Number: 3 (DW_TAG_member)
    <9f1>   DW_AT_name        : (indirect string, offset: 0x2b449): CCR3
    <9f5>   DW_AT_decl_file   : 5
    <9f6>   DW_AT_decl_line   : 486
    <9f8>   DW_AT_decl_column : 17
    <9f9>   DW_AT_type        : <0x86f>
    <9fd>   DW_AT_data_member_location: 60
 <2><9fe>: Abbrev Number: 3 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x97dd): CCR4
    <a03>   DW_AT_decl_file   : 5
    <a04>   DW_AT_decl_line   : 487
    <a06>   DW_AT_decl_column : 17
    <a07>   DW_AT_type        : <0x86f>
    <a0b>   DW_AT_data_member_location: 64
 <2><a0c>: Abbrev Number: 3 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x458ef): BDTR
    <a11>   DW_AT_decl_file   : 5
    <a12>   DW_AT_decl_line   : 488
    <a14>   DW_AT_decl_column : 17
    <a15>   DW_AT_type        : <0x86f>
    <a19>   DW_AT_data_member_location: 68
 <2><a1a>: Abbrev Number: 6 (DW_TAG_member)
    <a1b>   DW_AT_name        : DCR
    <a1f>   DW_AT_decl_file   : 5
    <a1f>   DW_AT_decl_line   : 489
    <a21>   DW_AT_decl_column : 17
    <a21>   DW_AT_type        : <0x86f>
    <a25>   DW_AT_data_member_location: 72
 <2><a26>: Abbrev Number: 3 (DW_TAG_member)
    <a27>   DW_AT_name        : (indirect string, offset: 0x83f4d): DMAR
    <a2b>   DW_AT_decl_file   : 5
    <a2c>   DW_AT_decl_line   : 490
    <a2e>   DW_AT_decl_column : 17
    <a2f>   DW_AT_type        : <0x86f>
    <a33>   DW_AT_data_member_location: 76
 <2><a34>: Abbrev Number: 6 (DW_TAG_member)
    <a35>   DW_AT_name        : OR
    <a38>   DW_AT_decl_file   : 5
    <a38>   DW_AT_decl_line   : 491
    <a3a>   DW_AT_decl_column : 17
    <a3a>   DW_AT_type        : <0x86f>
    <a3e>   DW_AT_data_member_location: 80
 <2><a3f>: Abbrev Number: 0
 <1><a40>: Abbrev Number: 10 (DW_TAG_typedef)
    <a41>   DW_AT_name        : (indirect string, offset: 0x99f49): TIM_TypeDef
    <a45>   DW_AT_decl_file   : 5
    <a46>   DW_AT_decl_line   : 492
    <a48>   DW_AT_decl_column : 3
    <a48>   DW_AT_type        : <0x926>
 <1><a4c>: Abbrev Number: 5 (DW_TAG_base_type)
    <a4d>   DW_AT_byte_size   : 8
    <a4e>   DW_AT_encoding    : 4	(float)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x7e29e): long double
 <1><a53>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <a54>   DW_AT_encoding    : 7	(unsigned)
    <a55>   DW_AT_byte_size   : 1
    <a56>   DW_AT_type        : <0x7f4>
    <a5a>   DW_AT_decl_file   : 6
    <a5b>   DW_AT_decl_line   : 50
    <a5c>   DW_AT_decl_column : 1
    <a5d>   DW_AT_sibling     : <0xa6e>
 <2><a61>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a62>   DW_AT_name        : (indirect string, offset: 0x718bb): HAL_UNLOCKED
    <a66>   DW_AT_const_value : 0
 <2><a67>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a68>   DW_AT_name        : (indirect string, offset: 0x992e3): HAL_LOCKED
    <a6c>   DW_AT_const_value : 1
 <2><a6d>: Abbrev Number: 0
 <1><a6e>: Abbrev Number: 4 (DW_TAG_typedef)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x5c7e2): HAL_LockTypeDef
    <a73>   DW_AT_decl_file   : 6
    <a74>   DW_AT_decl_line   : 53
    <a75>   DW_AT_decl_column : 3
    <a76>   DW_AT_type        : <0xa53>
 <1><a7a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a7b>   DW_AT_byte_size   : 48
    <a7c>   DW_AT_decl_file   : 7
    <a7d>   DW_AT_decl_line   : 48
    <a7e>   DW_AT_decl_column : 9
    <a7e>   DW_AT_sibling     : <0xb1f>
 <2><a82>: Abbrev Number: 1 (DW_TAG_member)
    <a83>   DW_AT_name        : (indirect string, offset: 0x9a127): Channel
    <a87>   DW_AT_decl_file   : 7
    <a88>   DW_AT_decl_line   : 50
    <a89>   DW_AT_decl_column : 12
    <a8a>   DW_AT_type        : <0x863>
    <a8e>   DW_AT_data_member_location: 0
 <2><a8f>: Abbrev Number: 1 (DW_TAG_member)
    <a90>   DW_AT_name        : (indirect string, offset: 0x8a68f): Direction
    <a94>   DW_AT_decl_file   : 7
    <a95>   DW_AT_decl_line   : 53
    <a96>   DW_AT_decl_column : 12
    <a97>   DW_AT_type        : <0x863>
    <a9b>   DW_AT_data_member_location: 4
 <2><a9c>: Abbrev Number: 1 (DW_TAG_member)
    <a9d>   DW_AT_name        : (indirect string, offset: 0xa018): PeriphInc
    <aa1>   DW_AT_decl_file   : 7
    <aa2>   DW_AT_decl_line   : 57
    <aa3>   DW_AT_decl_column : 12
    <aa4>   DW_AT_type        : <0x863>
    <aa8>   DW_AT_data_member_location: 8
 <2><aa9>: Abbrev Number: 1 (DW_TAG_member)
    <aaa>   DW_AT_name        : (indirect string, offset: 0x178d8): MemInc
    <aae>   DW_AT_decl_file   : 7
    <aaf>   DW_AT_decl_line   : 60
    <ab0>   DW_AT_decl_column : 12
    <ab1>   DW_AT_type        : <0x863>
    <ab5>   DW_AT_data_member_location: 12
 <2><ab6>: Abbrev Number: 1 (DW_TAG_member)
    <ab7>   DW_AT_name        : (indirect string, offset: 0x4baba): PeriphDataAlignment
    <abb>   DW_AT_decl_file   : 7
    <abc>   DW_AT_decl_line   : 63
    <abd>   DW_AT_decl_column : 12
    <abe>   DW_AT_type        : <0x863>
    <ac2>   DW_AT_data_member_location: 16
 <2><ac3>: Abbrev Number: 1 (DW_TAG_member)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x8ae8c): MemDataAlignment
    <ac8>   DW_AT_decl_file   : 7
    <ac9>   DW_AT_decl_line   : 66
    <aca>   DW_AT_decl_column : 12
    <acb>   DW_AT_type        : <0x863>
    <acf>   DW_AT_data_member_location: 20
 <2><ad0>: Abbrev Number: 1 (DW_TAG_member)
    <ad1>   DW_AT_name        : (indirect string, offset: 0xa1aa1): Mode
    <ad5>   DW_AT_decl_file   : 7
    <ad6>   DW_AT_decl_line   : 69
    <ad7>   DW_AT_decl_column : 12
    <ad8>   DW_AT_type        : <0x863>
    <adc>   DW_AT_data_member_location: 24
 <2><add>: Abbrev Number: 1 (DW_TAG_member)
    <ade>   DW_AT_name        : (indirect string, offset: 0xa26ce): Priority
    <ae2>   DW_AT_decl_file   : 7
    <ae3>   DW_AT_decl_line   : 74
    <ae4>   DW_AT_decl_column : 12
    <ae5>   DW_AT_type        : <0x863>
    <ae9>   DW_AT_data_member_location: 28
 <2><aea>: Abbrev Number: 1 (DW_TAG_member)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x40e92): FIFOMode
    <aef>   DW_AT_decl_file   : 7
    <af0>   DW_AT_decl_line   : 77
    <af1>   DW_AT_decl_column : 12
    <af2>   DW_AT_type        : <0x863>
    <af6>   DW_AT_data_member_location: 32
 <2><af7>: Abbrev Number: 1 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0x74db8): FIFOThreshold
    <afc>   DW_AT_decl_file   : 7
    <afd>   DW_AT_decl_line   : 82
    <afe>   DW_AT_decl_column : 12
    <aff>   DW_AT_type        : <0x863>
    <b03>   DW_AT_data_member_location: 36
 <2><b04>: Abbrev Number: 1 (DW_TAG_member)
    <b05>   DW_AT_name        : (indirect string, offset: 0x3bc69): MemBurst
    <b09>   DW_AT_decl_file   : 7
    <b0a>   DW_AT_decl_line   : 85
    <b0b>   DW_AT_decl_column : 12
    <b0c>   DW_AT_type        : <0x863>
    <b10>   DW_AT_data_member_location: 40
 <2><b11>: Abbrev Number: 1 (DW_TAG_member)
    <b12>   DW_AT_name        : (indirect string, offset: 0x33c81): PeriphBurst
    <b16>   DW_AT_decl_file   : 7
    <b17>   DW_AT_decl_line   : 91
    <b18>   DW_AT_decl_column : 12
    <b19>   DW_AT_type        : <0x863>
    <b1d>   DW_AT_data_member_location: 44
 <2><b1e>: Abbrev Number: 0
 <1><b1f>: Abbrev Number: 4 (DW_TAG_typedef)
    <b20>   DW_AT_name        : (indirect string, offset: 0x28c05): DMA_InitTypeDef
    <b24>   DW_AT_decl_file   : 7
    <b25>   DW_AT_decl_line   : 96
    <b26>   DW_AT_decl_column : 2
    <b27>   DW_AT_type        : <0xa7a>
 <1><b2b>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <b2c>   DW_AT_encoding    : 7	(unsigned)
    <b2d>   DW_AT_byte_size   : 1
    <b2e>   DW_AT_type        : <0x7f4>
    <b32>   DW_AT_decl_file   : 7
    <b33>   DW_AT_decl_line   : 103
    <b34>   DW_AT_decl_column : 1
    <b35>   DW_AT_sibling     : <0xb5e>
 <2><b39>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b3a>   DW_AT_name        : (indirect string, offset: 0x72a46): HAL_DMA_STATE_RESET
    <b3e>   DW_AT_const_value : 0
 <2><b3f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b40>   DW_AT_name        : (indirect string, offset: 0x29b4e): HAL_DMA_STATE_READY
    <b44>   DW_AT_const_value : 1
 <2><b45>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b46>   DW_AT_name        : (indirect string, offset: 0x69709): HAL_DMA_STATE_BUSY
    <b4a>   DW_AT_const_value : 2
 <2><b4b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b4c>   DW_AT_name        : (indirect string, offset: 0x970a3): HAL_DMA_STATE_TIMEOUT
    <b50>   DW_AT_const_value : 3
 <2><b51>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b52>   DW_AT_name        : (indirect string, offset: 0x83773): HAL_DMA_STATE_ERROR
    <b56>   DW_AT_const_value : 4
 <2><b57>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b58>   DW_AT_name        : (indirect string, offset: 0x227f7): HAL_DMA_STATE_ABORT
    <b5c>   DW_AT_const_value : 5
 <2><b5d>: Abbrev Number: 0
 <1><b5e>: Abbrev Number: 4 (DW_TAG_typedef)
    <b5f>   DW_AT_name        : (indirect string, offset: 0x5425d): HAL_DMA_StateTypeDef
    <b63>   DW_AT_decl_file   : 7
    <b64>   DW_AT_decl_line   : 110
    <b65>   DW_AT_decl_column : 2
    <b66>   DW_AT_type        : <0xb2b>
 <1><b6a>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b6b>   DW_AT_type        : <0xb5e>
 <1><b6f>: Abbrev Number: 26 (DW_TAG_structure_type)
    <b70>   DW_AT_name        : (indirect string, offset: 0x82ba6): __DMA_HandleTypeDef
    <b74>   DW_AT_byte_size   : 96
    <b75>   DW_AT_decl_file   : 7
    <b76>   DW_AT_decl_line   : 138
    <b77>   DW_AT_decl_column : 16
    <b78>   DW_AT_sibling     : <0xc33>
 <2><b7c>: Abbrev Number: 1 (DW_TAG_member)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <b81>   DW_AT_decl_file   : 7
    <b82>   DW_AT_decl_line   : 140
    <b83>   DW_AT_decl_column : 31
    <b84>   DW_AT_type        : <0xc33>
    <b88>   DW_AT_data_member_location: 0
 <2><b89>: Abbrev Number: 1 (DW_TAG_member)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x9f42e): Init
    <b8e>   DW_AT_decl_file   : 7
    <b8f>   DW_AT_decl_line   : 142
    <b90>   DW_AT_decl_column : 30
    <b91>   DW_AT_type        : <0xb1f>
    <b95>   DW_AT_data_member_location: 4
 <2><b96>: Abbrev Number: 1 (DW_TAG_member)
    <b97>   DW_AT_name        : (indirect string, offset: 0x6ce85): Lock
    <b9b>   DW_AT_decl_file   : 7
    <b9c>   DW_AT_decl_line   : 144
    <b9d>   DW_AT_decl_column : 30
    <b9e>   DW_AT_type        : <0xa6e>
    <ba2>   DW_AT_data_member_location: 52
 <2><ba3>: Abbrev Number: 1 (DW_TAG_member)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x9f513): State
    <ba8>   DW_AT_decl_file   : 7
    <ba9>   DW_AT_decl_line   : 146
    <baa>   DW_AT_decl_column : 30
    <bab>   DW_AT_type        : <0xb6a>
    <baf>   DW_AT_data_member_location: 53
 <2><bb0>: Abbrev Number: 1 (DW_TAG_member)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x920e1): Parent
    <bb5>   DW_AT_decl_file   : 7
    <bb6>   DW_AT_decl_line   : 148
    <bb7>   DW_AT_decl_column : 31
    <bb8>   DW_AT_type        : <0xc38>
    <bbc>   DW_AT_data_member_location: 56
 <2><bbd>: Abbrev Number: 1 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x98b66): XferCpltCallback
    <bc2>   DW_AT_decl_file   : 7
    <bc3>   DW_AT_decl_line   : 150
    <bc4>   DW_AT_decl_column : 33
    <bc5>   DW_AT_type        : <0xc4a>
    <bc9>   DW_AT_data_member_location: 60
 <2><bca>: Abbrev Number: 1 (DW_TAG_member)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x77583): XferHalfCpltCallback
    <bcf>   DW_AT_decl_file   : 7
    <bd0>   DW_AT_decl_line   : 152
    <bd1>   DW_AT_decl_column : 33
    <bd2>   DW_AT_type        : <0xc4a>
    <bd6>   DW_AT_data_member_location: 64
 <2><bd7>: Abbrev Number: 1 (DW_TAG_member)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x2421b): XferM1CpltCallback
    <bdc>   DW_AT_decl_file   : 7
    <bdd>   DW_AT_decl_line   : 154
    <bde>   DW_AT_decl_column : 33
    <bdf>   DW_AT_type        : <0xc4a>
    <be3>   DW_AT_data_member_location: 68
 <2><be4>: Abbrev Number: 1 (DW_TAG_member)
    <be5>   DW_AT_name        : (indirect string, offset: 0x5443e): XferM1HalfCpltCallback
    <be9>   DW_AT_decl_file   : 7
    <bea>   DW_AT_decl_line   : 156
    <beb>   DW_AT_decl_column : 33
    <bec>   DW_AT_type        : <0xc4a>
    <bf0>   DW_AT_data_member_location: 72
 <2><bf1>: Abbrev Number: 1 (DW_TAG_member)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x15c13): XferErrorCallback
    <bf6>   DW_AT_decl_file   : 7
    <bf7>   DW_AT_decl_line   : 158
    <bf8>   DW_AT_decl_column : 33
    <bf9>   DW_AT_type        : <0xc4a>
    <bfd>   DW_AT_data_member_location: 76
 <2><bfe>: Abbrev Number: 1 (DW_TAG_member)
    <bff>   DW_AT_name        : (indirect string, offset: 0x8f71e): XferAbortCallback
    <c03>   DW_AT_decl_file   : 7
    <c04>   DW_AT_decl_line   : 160
    <c05>   DW_AT_decl_column : 33
    <c06>   DW_AT_type        : <0xc4a>
    <c0a>   DW_AT_data_member_location: 80
 <2><c0b>: Abbrev Number: 1 (DW_TAG_member)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x96268): ErrorCode
    <c10>   DW_AT_decl_file   : 7
    <c11>   DW_AT_decl_line   : 162
    <c12>   DW_AT_decl_column : 30
    <c13>   DW_AT_type        : <0x86f>
    <c17>   DW_AT_data_member_location: 84
 <2><c18>: Abbrev Number: 1 (DW_TAG_member)
    <c19>   DW_AT_name        : (indirect string, offset: 0x74143): StreamBaseAddress
    <c1d>   DW_AT_decl_file   : 7
    <c1e>   DW_AT_decl_line   : 164
    <c1f>   DW_AT_decl_column : 30
    <c20>   DW_AT_type        : <0x863>
    <c24>   DW_AT_data_member_location: 88
 <2><c25>: Abbrev Number: 1 (DW_TAG_member)
    <c26>   DW_AT_name        : (indirect string, offset: 0x813dd): StreamIndex
    <c2a>   DW_AT_decl_file   : 7
    <c2b>   DW_AT_decl_line   : 166
    <c2c>   DW_AT_decl_column : 30
    <c2d>   DW_AT_type        : <0x863>
    <c31>   DW_AT_data_member_location: 92
 <2><c32>: Abbrev Number: 0
 <1><c33>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c34>   DW_AT_byte_size   : 4
    <c34>   DW_AT_type        : <0x91a>
 <1><c38>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <c39>   DW_AT_byte_size   : 4
 <1><c3a>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <c3b>   DW_AT_prototyped  : 1
    <c3b>   DW_AT_sibling     : <0xc45>
 <2><c3f>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <c40>   DW_AT_type        : <0xc45>
 <2><c44>: Abbrev Number: 0
 <1><c45>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c46>   DW_AT_byte_size   : 4
    <c46>   DW_AT_type        : <0xb6f>
 <1><c4a>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c4b>   DW_AT_byte_size   : 4
    <c4b>   DW_AT_type        : <0xc3a>
 <1><c4f>: Abbrev Number: 4 (DW_TAG_typedef)
    <c50>   DW_AT_name        : (indirect string, offset: 0x82ba8): DMA_HandleTypeDef
    <c54>   DW_AT_decl_file   : 7
    <c55>   DW_AT_decl_line   : 168
    <c56>   DW_AT_decl_column : 2
    <c57>   DW_AT_type        : <0xb6f>
 <1><c5b>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c5c>   DW_AT_byte_size   : 4
    <c5c>   DW_AT_type        : <0xc4f>
 <1><c60>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <c61>   DW_AT_byte_size   : 4
    <c61>   DW_AT_type        : <0x84b>
 <1><c65>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c66>   DW_AT_byte_size   : 24
    <c67>   DW_AT_decl_file   : 8
    <c68>   DW_AT_decl_line   : 46
    <c69>   DW_AT_decl_column : 9
    <c69>   DW_AT_sibling     : <0xcbc>
 <2><c6d>: Abbrev Number: 1 (DW_TAG_member)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xa3d87): Prescaler
    <c72>   DW_AT_decl_file   : 8
    <c73>   DW_AT_decl_line   : 48
    <c74>   DW_AT_decl_column : 12
    <c75>   DW_AT_type        : <0x863>
    <c79>   DW_AT_data_member_location: 0
 <2><c7a>: Abbrev Number: 1 (DW_TAG_member)
    <c7b>   DW_AT_name        : (indirect string, offset: 0x9a08f): CounterMode
    <c7f>   DW_AT_decl_file   : 8
    <c80>   DW_AT_decl_line   : 51
    <c81>   DW_AT_decl_column : 12
    <c82>   DW_AT_type        : <0x863>
    <c86>   DW_AT_data_member_location: 4
 <2><c87>: Abbrev Number: 1 (DW_TAG_member)
    <c88>   DW_AT_name        : (indirect string, offset: 0xa97e6): Period
    <c8c>   DW_AT_decl_file   : 8
    <c8d>   DW_AT_decl_line   : 54
    <c8e>   DW_AT_decl_column : 12
    <c8f>   DW_AT_type        : <0x863>
    <c93>   DW_AT_data_member_location: 8
 <2><c94>: Abbrev Number: 1 (DW_TAG_member)
    <c95>   DW_AT_name        : (indirect string, offset: 0x9a09b): ClockDivision
    <c99>   DW_AT_decl_file   : 8
    <c9a>   DW_AT_decl_line   : 58
    <c9b>   DW_AT_decl_column : 12
    <c9c>   DW_AT_type        : <0x863>
    <ca0>   DW_AT_data_member_location: 12
 <2><ca1>: Abbrev Number: 1 (DW_TAG_member)
    <ca2>   DW_AT_name        : (indirect string, offset: 0x9a253): RepetitionCounter
    <ca6>   DW_AT_decl_file   : 8
    <ca7>   DW_AT_decl_line   : 61
    <ca8>   DW_AT_decl_column : 12
    <ca9>   DW_AT_type        : <0x863>
    <cad>   DW_AT_data_member_location: 16
 <2><cae>: Abbrev Number: 1 (DW_TAG_member)
    <caf>   DW_AT_name        : (indirect string, offset: 0x9a317): AutoReloadPreload
    <cb3>   DW_AT_decl_file   : 8
    <cb4>   DW_AT_decl_line   : 72
    <cb5>   DW_AT_decl_column : 12
    <cb6>   DW_AT_type        : <0x863>
    <cba>   DW_AT_data_member_location: 20
 <2><cbb>: Abbrev Number: 0
 <1><cbc>: Abbrev Number: 4 (DW_TAG_typedef)
    <cbd>   DW_AT_name        : (indirect string, offset: 0x9a302): TIM_Base_InitTypeDef
    <cc1>   DW_AT_decl_file   : 8
    <cc2>   DW_AT_decl_line   : 74
    <cc3>   DW_AT_decl_column : 3
    <cc4>   DW_AT_type        : <0xc65>
 <1><cc8>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <cc9>   DW_AT_encoding    : 7	(unsigned)
    <cc9>   DW_AT_byte_size   : 1
    <cc9>   DW_AT_type        : <0x7f4>
    <ccd>   DW_AT_decl_file   : 8
    <ccd>   DW_AT_decl_line   : 291
    <ccf>   DW_AT_decl_column : 1
    <ccf>   DW_AT_sibling     : <0xcf2>
 <2><cd3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x9a1e9): HAL_TIM_STATE_RESET
    <cd8>   DW_AT_const_value : 0
 <2><cd9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cda>   DW_AT_name        : (indirect string, offset: 0x99f55): HAL_TIM_STATE_READY
    <cde>   DW_AT_const_value : 1
 <2><cdf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x9a031): HAL_TIM_STATE_BUSY
    <ce4>   DW_AT_const_value : 2
 <2><ce5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x9a2e0): HAL_TIM_STATE_TIMEOUT
    <cea>   DW_AT_const_value : 3
 <2><ceb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cec>   DW_AT_name        : (indirect string, offset: 0x9a1d5): HAL_TIM_STATE_ERROR
    <cf0>   DW_AT_const_value : 4
 <2><cf1>: Abbrev Number: 0
 <1><cf2>: Abbrev Number: 10 (DW_TAG_typedef)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x9a29d): HAL_TIM_StateTypeDef
    <cf7>   DW_AT_decl_file   : 8
    <cf8>   DW_AT_decl_line   : 297
    <cfa>   DW_AT_decl_column : 3
    <cfa>   DW_AT_type        : <0xcc8>
 <1><cfe>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <cff>   DW_AT_type        : <0xcf2>
 <1><d03>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d04>   DW_AT_encoding    : 7	(unsigned)
    <d04>   DW_AT_byte_size   : 1
    <d04>   DW_AT_type        : <0x7f4>
    <d08>   DW_AT_decl_file   : 8
    <d08>   DW_AT_decl_line   : 303
    <d0a>   DW_AT_decl_column : 1
    <d0a>   DW_AT_sibling     : <0xd21>
 <2><d0e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x9a265): HAL_TIM_CHANNEL_STATE_RESET
    <d13>   DW_AT_const_value : 0
 <2><d14>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d15>   DW_AT_name        : (indirect string, offset: 0x9a281): HAL_TIM_CHANNEL_STATE_READY
    <d19>   DW_AT_const_value : 1
 <2><d1a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x9a348): HAL_TIM_CHANNEL_STATE_BUSY
    <d1f>   DW_AT_const_value : 2
 <2><d20>: Abbrev Number: 0
 <1><d21>: Abbrev Number: 10 (DW_TAG_typedef)
    <d22>   DW_AT_name        : (indirect string, offset: 0x9a002): HAL_TIM_ChannelStateTypeDef
    <d26>   DW_AT_decl_file   : 8
    <d27>   DW_AT_decl_line   : 307
    <d29>   DW_AT_decl_column : 3
    <d29>   DW_AT_type        : <0xd03>
 <1><d2d>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d2e>   DW_AT_type        : <0xd21>
 <1><d32>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d33>   DW_AT_encoding    : 7	(unsigned)
    <d33>   DW_AT_byte_size   : 1
    <d33>   DW_AT_type        : <0x7f4>
    <d37>   DW_AT_decl_file   : 8
    <d37>   DW_AT_decl_line   : 313
    <d39>   DW_AT_decl_column : 1
    <d39>   DW_AT_sibling     : <0xd50>
 <2><d3d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x9a239): HAL_DMA_BURST_STATE_RESET
    <d42>   DW_AT_const_value : 0
 <2><d43>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d44>   DW_AT_name        : (indirect string, offset: 0x9a137): HAL_DMA_BURST_STATE_READY
    <d48>   DW_AT_const_value : 1
 <2><d49>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x9a052): HAL_DMA_BURST_STATE_BUSY
    <d4e>   DW_AT_const_value : 2
 <2><d4f>: Abbrev Number: 0
 <1><d50>: Abbrev Number: 10 (DW_TAG_typedef)
    <d51>   DW_AT_name        : (indirect string, offset: 0x99fd0): HAL_TIM_DMABurstStateTypeDef
    <d55>   DW_AT_decl_file   : 8
    <d56>   DW_AT_decl_line   : 317
    <d58>   DW_AT_decl_column : 3
    <d58>   DW_AT_type        : <0xd32>
 <1><d5c>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d5d>   DW_AT_type        : <0xd50>
 <1><d61>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d62>   DW_AT_encoding    : 7	(unsigned)
    <d62>   DW_AT_byte_size   : 1
    <d62>   DW_AT_type        : <0x7f4>
    <d66>   DW_AT_decl_file   : 8
    <d66>   DW_AT_decl_line   : 323
    <d68>   DW_AT_decl_column : 1
    <d68>   DW_AT_sibling     : <0xd8b>
 <2><d6c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x9a151): HAL_TIM_ACTIVE_CHANNEL_1
    <d71>   DW_AT_const_value : 1
 <2><d72>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d73>   DW_AT_name        : (indirect string, offset: 0x9a16a): HAL_TIM_ACTIVE_CHANNEL_2
    <d77>   DW_AT_const_value : 2
 <2><d78>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d79>   DW_AT_name        : (indirect string, offset: 0x9a183): HAL_TIM_ACTIVE_CHANNEL_3
    <d7d>   DW_AT_const_value : 4
 <2><d7e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x9a19c): HAL_TIM_ACTIVE_CHANNEL_4
    <d83>   DW_AT_const_value : 8
 <2><d84>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d85>   DW_AT_name        : (indirect string, offset: 0x9a0b1): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <d89>   DW_AT_const_value : 0
 <2><d8a>: Abbrev Number: 0
 <1><d8b>: Abbrev Number: 10 (DW_TAG_typedef)
    <d8c>   DW_AT_name        : (indirect string, offset: 0x9a119): HAL_TIM_ActiveChannel
    <d90>   DW_AT_decl_file   : 8
    <d91>   DW_AT_decl_line   : 329
    <d93>   DW_AT_decl_column : 3
    <d93>   DW_AT_type        : <0xd61>
 <1><d97>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d98>   DW_AT_byte_size   : 72
    <d99>   DW_AT_decl_file   : 8
    <d9a>   DW_AT_decl_line   : 337
    <d9c>   DW_AT_decl_column : 9
    <d9c>   DW_AT_sibling     : <0xe1f>
 <2><da0>: Abbrev Number: 3 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0x3ac3a): Instance
    <da5>   DW_AT_decl_file   : 8
    <da6>   DW_AT_decl_line   : 340
    <da8>   DW_AT_decl_column : 39
    <da9>   DW_AT_type        : <0xe1f>
    <dad>   DW_AT_data_member_location: 0
 <2><dae>: Abbrev Number: 3 (DW_TAG_member)
    <daf>   DW_AT_name        : (indirect string, offset: 0x9f42e): Init
    <db3>   DW_AT_decl_file   : 8
    <db4>   DW_AT_decl_line   : 341
    <db6>   DW_AT_decl_column : 38
    <db7>   DW_AT_type        : <0xcbc>
    <dbb>   DW_AT_data_member_location: 4
 <2><dbc>: Abbrev Number: 3 (DW_TAG_member)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x9a127): Channel
    <dc1>   DW_AT_decl_file   : 8
    <dc2>   DW_AT_decl_line   : 342
    <dc4>   DW_AT_decl_column : 38
    <dc5>   DW_AT_type        : <0xd8b>
    <dc9>   DW_AT_data_member_location: 28
 <2><dca>: Abbrev Number: 3 (DW_TAG_member)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x9a1bf): hdma
    <dcf>   DW_AT_decl_file   : 8
    <dd0>   DW_AT_decl_line   : 343
    <dd2>   DW_AT_decl_column : 39
    <dd3>   DW_AT_type        : <0xe24>
    <dd7>   DW_AT_data_member_location: 32
 <2><dd8>: Abbrev Number: 3 (DW_TAG_member)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x6ce85): Lock
    <ddd>   DW_AT_decl_file   : 8
    <dde>   DW_AT_decl_line   : 345
    <de0>   DW_AT_decl_column : 38
    <de1>   DW_AT_type        : <0xa6e>
    <de5>   DW_AT_data_member_location: 60
 <2><de6>: Abbrev Number: 3 (DW_TAG_member)
    <de7>   DW_AT_name        : (indirect string, offset: 0x9f513): State
    <deb>   DW_AT_decl_file   : 8
    <dec>   DW_AT_decl_line   : 346
    <dee>   DW_AT_decl_column : 38
    <def>   DW_AT_type        : <0xcfe>
    <df3>   DW_AT_data_member_location: 61
 <2><df4>: Abbrev Number: 3 (DW_TAG_member)
    <df5>   DW_AT_name        : (indirect string, offset: 0xa43d3): ChannelState
    <df9>   DW_AT_decl_file   : 8
    <dfa>   DW_AT_decl_line   : 347
    <dfc>   DW_AT_decl_column : 38
    <dfd>   DW_AT_type        : <0xe44>
    <e01>   DW_AT_data_member_location: 62
 <2><e02>: Abbrev Number: 3 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0xa498c): ChannelNState
    <e07>   DW_AT_decl_file   : 8
    <e08>   DW_AT_decl_line   : 348
    <e0a>   DW_AT_decl_column : 38
    <e0b>   DW_AT_type        : <0xe44>
    <e0f>   DW_AT_data_member_location: 66
 <2><e10>: Abbrev Number: 3 (DW_TAG_member)
    <e11>   DW_AT_name        : (indirect string, offset: 0xa400e): DMABurstState
    <e15>   DW_AT_decl_file   : 8
    <e16>   DW_AT_decl_line   : 349
    <e18>   DW_AT_decl_column : 38
    <e19>   DW_AT_type        : <0xd5c>
    <e1d>   DW_AT_data_member_location: 70
 <2><e1e>: Abbrev Number: 0
 <1><e1f>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <e20>   DW_AT_byte_size   : 4
    <e20>   DW_AT_type        : <0xa40>
 <1><e24>: Abbrev Number: 18 (DW_TAG_array_type)
    <e25>   DW_AT_type        : <0xc5b>
    <e29>   DW_AT_sibling     : <0xe34>
 <2><e2d>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <e2e>   DW_AT_type        : <0x844>
    <e32>   DW_AT_upper_bound : 6
 <2><e33>: Abbrev Number: 0
 <1><e34>: Abbrev Number: 18 (DW_TAG_array_type)
    <e35>   DW_AT_type        : <0xd2d>
    <e39>   DW_AT_sibling     : <0xe44>
 <2><e3d>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <e3e>   DW_AT_type        : <0x844>
    <e42>   DW_AT_upper_bound : 3
 <2><e43>: Abbrev Number: 0
 <1><e44>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e45>   DW_AT_type        : <0xe34>
 <1><e49>: Abbrev Number: 10 (DW_TAG_typedef)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x9a06b): TIM_HandleTypeDef
    <e4e>   DW_AT_decl_file   : 8
    <e4f>   DW_AT_decl_line   : 380
    <e51>   DW_AT_decl_column : 3
    <e51>   DW_AT_type        : <0xd97>
 <1><e55>: Abbrev Number: 21 (DW_TAG_variable)
    <e56>   DW_AT_name        : (indirect string, offset: 0x99fed): htim4
    <e5a>   DW_AT_decl_file   : 10
    <e5b>   DW_AT_decl_line   : 37
    <e5c>   DW_AT_decl_column : 26
    <e5d>   DW_AT_type        : <0xe49>
    <e61>   DW_AT_external    : 1
    <e61>   DW_AT_declaration : 1
 <1><e61>: Abbrev Number: 5 (DW_TAG_base_type)
    <e62>   DW_AT_byte_size   : 1
    <e63>   DW_AT_encoding    : 8	(unsigned char)
    <e64>   DW_AT_name        : (indirect string, offset: 0x30e5f): char
 <1><e68>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <e69>   DW_AT_encoding    : 5	(signed)
    <e6a>   DW_AT_byte_size   : 4
    <e6b>   DW_AT_type        : <0x83d>
    <e6f>   DW_AT_decl_file   : 9
    <e70>   DW_AT_decl_line   : 176
    <e71>   DW_AT_decl_column : 14
    <e72>   DW_AT_sibling     : <0xeaa>
 <2><e76>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e77>   DW_AT_name        : (indirect string, offset: 0x87e85): osOK
    <e7b>   DW_AT_const_value : 0
 <2><e7c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x45c7a): osError
    <e81>   DW_AT_const_value : -1
 <2><e82>: Abbrev Number: 12 (DW_TAG_enumerator)
    <e83>   DW_AT_name        : (indirect string, offset: 0x15ab8): osErrorTimeout
    <e87>   DW_AT_const_value : -2
 <2><e88>: Abbrev Number: 12 (DW_TAG_enumerator)
    <e89>   DW_AT_name        : (indirect string, offset: 0x631c2): osErrorResource
    <e8d>   DW_AT_const_value : -3
 <2><e8e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x276ea): osErrorParameter
    <e93>   DW_AT_const_value : -4
 <2><e94>: Abbrev Number: 12 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0x1a2c4): osErrorNoMemory
    <e99>   DW_AT_const_value : -5
 <2><e9a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x28f14): osErrorISR
    <e9f>   DW_AT_const_value : -6
 <2><ea0>: Abbrev Number: 29 (DW_TAG_enumerator)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x4cc31): osStatusReserved
    <ea5>   DW_AT_const_value : 0x7fffffff
 <2><ea9>: Abbrev Number: 0
 <1><eaa>: Abbrev Number: 4 (DW_TAG_typedef)
    <eab>   DW_AT_name        : (indirect string, offset: 0x33983): osStatus_t
    <eaf>   DW_AT_decl_file   : 9
    <eb0>   DW_AT_decl_line   : 185
    <eb1>   DW_AT_decl_column : 3
    <eb2>   DW_AT_type        : <0xe68>
 <1><eb6>: Abbrev Number: 4 (DW_TAG_typedef)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x43e0b): osMessageQueueId_t
    <ebb>   DW_AT_decl_file   : 9
    <ebc>   DW_AT_decl_line   : 207
    <ebd>   DW_AT_decl_column : 15
    <ebe>   DW_AT_type        : <0xc38>
 <1><ec2>: Abbrev Number: 7 (DW_TAG_variable)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x9a07d): radioDataReceived
    <ec7>   DW_AT_decl_file   : 1
    <ec7>   DW_AT_decl_line   : 13
    <ec8>   DW_AT_decl_column : 20
    <ec9>   DW_AT_type        : <0x8b1>
    <ecd>   DW_AT_location    : 5 byte block: 3 fc 2 0 20 	(DW_OP_addr: 200002fc)
 <1><ed3>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ed4>   DW_AT_byte_size   : 32
    <ed5>   DW_AT_decl_file   : 1
    <ed6>   DW_AT_decl_line   : 16
    <ed7>   DW_AT_decl_column : 9
    <ed7>   DW_AT_sibling     : <0xf44>
 <2><edb>: Abbrev Number: 1 (DW_TAG_member)
    <edc>   DW_AT_name        : (indirect string, offset: 0x9a231): ch1_min
    <ee0>   DW_AT_decl_file   : 1
    <ee1>   DW_AT_decl_line   : 17
    <ee2>   DW_AT_decl_column : 14
    <ee3>   DW_AT_type        : <0x863>
    <ee7>   DW_AT_data_member_location: 0
 <2><ee8>: Abbrev Number: 1 (DW_TAG_member)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x9a2d8): ch1_max
    <eed>   DW_AT_decl_file   : 1
    <eee>   DW_AT_decl_line   : 18
    <eef>   DW_AT_decl_column : 14
    <ef0>   DW_AT_type        : <0x863>
    <ef4>   DW_AT_data_member_location: 4
 <2><ef5>: Abbrev Number: 1 (DW_TAG_member)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x9a0e2): ch2_min
    <efa>   DW_AT_decl_file   : 1
    <efb>   DW_AT_decl_line   : 19
    <efc>   DW_AT_decl_column : 14
    <efd>   DW_AT_type        : <0x863>
    <f01>   DW_AT_data_member_location: 8
 <2><f02>: Abbrev Number: 1 (DW_TAG_member)
    <f03>   DW_AT_name        : (indirect string, offset: 0x9a0a9): ch2_max
    <f07>   DW_AT_decl_file   : 1
    <f08>   DW_AT_decl_line   : 20
    <f09>   DW_AT_decl_column : 14
    <f0a>   DW_AT_type        : <0x863>
    <f0e>   DW_AT_data_member_location: 12
 <2><f0f>: Abbrev Number: 1 (DW_TAG_member)
    <f10>   DW_AT_name        : (indirect string, offset: 0x9a111): ch3_min
    <f14>   DW_AT_decl_file   : 1
    <f15>   DW_AT_decl_line   : 21
    <f16>   DW_AT_decl_column : 14
    <f17>   DW_AT_type        : <0x863>
    <f1b>   DW_AT_data_member_location: 16
 <2><f1c>: Abbrev Number: 1 (DW_TAG_member)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x9a109): ch3_max
    <f21>   DW_AT_decl_file   : 1
    <f22>   DW_AT_decl_line   : 22
    <f23>   DW_AT_decl_column : 14
    <f24>   DW_AT_type        : <0x863>
    <f28>   DW_AT_data_member_location: 20
 <2><f29>: Abbrev Number: 1 (DW_TAG_member)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x9a2c4): ch4_min
    <f2e>   DW_AT_decl_file   : 1
    <f2f>   DW_AT_decl_line   : 23
    <f30>   DW_AT_decl_column : 14
    <f31>   DW_AT_type        : <0x863>
    <f35>   DW_AT_data_member_location: 24
 <2><f36>: Abbrev Number: 1 (DW_TAG_member)
    <f37>   DW_AT_name        : (indirect string, offset: 0x9a2b2): ch4_max
    <f3b>   DW_AT_decl_file   : 1
    <f3c>   DW_AT_decl_line   : 24
    <f3d>   DW_AT_decl_column : 14
    <f3e>   DW_AT_type        : <0x863>
    <f42>   DW_AT_data_member_location: 28
 <2><f43>: Abbrev Number: 0
 <1><f44>: Abbrev Number: 4 (DW_TAG_typedef)
    <f45>   DW_AT_name        : (indirect string, offset: 0x99ff3): RadioMapping_t
    <f49>   DW_AT_decl_file   : 1
    <f4a>   DW_AT_decl_line   : 25
    <f4b>   DW_AT_decl_column : 3
    <f4c>   DW_AT_type        : <0xed3>
 <1><f50>: Abbrev Number: 7 (DW_TAG_variable)
    <f51>   DW_AT_name        : (indirect string, offset: 0x99f7f): mappingBoundaries
    <f55>   DW_AT_decl_file   : 1
    <f55>   DW_AT_decl_line   : 28
    <f56>   DW_AT_decl_column : 23
    <f57>   DW_AT_type        : <0xf44>
    <f5b>   DW_AT_location    : 5 byte block: 3 10 0 0 20 	(DW_OP_addr: 20000010)
 <1><f61>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <f62>   DW_AT_encoding    : 7	(unsigned)
    <f63>   DW_AT_byte_size   : 1
    <f64>   DW_AT_type        : <0x7f4>
    <f68>   DW_AT_decl_file   : 1
    <f69>   DW_AT_decl_line   : 40
    <f6a>   DW_AT_decl_column : 14
    <f6b>   DW_AT_sibling     : <0xf82>
 <2><f6f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f70>   DW_AT_name        : (indirect string, offset: 0x9a0fc): MAPPING_MODE
    <f74>   DW_AT_const_value : 0
 <2><f75>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f76>   DW_AT_name        : (indirect string, offset: 0x9a2f6): BYPASS_MODE
    <f7a>   DW_AT_const_value : 1
 <2><f7b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x9a0d8): NUM_MODES
    <f80>   DW_AT_const_value : 2
 <2><f81>: Abbrev Number: 0
 <1><f82>: Abbrev Number: 4 (DW_TAG_typedef)
    <f83>   DW_AT_name        : (indirect string, offset: 0x99fc2): OperationMode
    <f87>   DW_AT_decl_file   : 1
    <f88>   DW_AT_decl_line   : 44
    <f89>   DW_AT_decl_column : 3
    <f8a>   DW_AT_type        : <0xf61>
 <1><f8e>: Abbrev Number: 7 (DW_TAG_variable)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x99fa2): currentMode
    <f93>   DW_AT_decl_file   : 1
    <f93>   DW_AT_decl_line   : 46
    <f94>   DW_AT_decl_column : 22
    <f95>   DW_AT_type        : <0xf82>
    <f99>   DW_AT_location    : 5 byte block: 3 4 3 0 20 	(DW_OP_addr: 20000304)
 <1><f9f>: Abbrev Number: 21 (DW_TAG_variable)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x99f91): radioQueueHandle
    <fa4>   DW_AT_decl_file   : 1
    <fa5>   DW_AT_decl_line   : 49
    <fa6>   DW_AT_decl_column : 27
    <fa7>   DW_AT_type        : <0xeb6>
    <fab>   DW_AT_external    : 1
    <fab>   DW_AT_declaration : 1
 <1><fab>: Abbrev Number: 30 (DW_TAG_subprogram)
    <fac>   DW_AT_external    : 1
    <fac>   DW_AT_name        : (indirect string, offset: 0x9a0ea): osMessageQueueGet
    <fb0>   DW_AT_decl_file   : 9
    <fb1>   DW_AT_decl_line   : 697
    <fb3>   DW_AT_decl_column : 12
    <fb4>   DW_AT_prototyped  : 1
    <fb4>   DW_AT_type        : <0xeaa>
    <fb8>   DW_AT_declaration : 1
    <fb8>   DW_AT_sibling     : <0xfd1>
 <2><fbc>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fbd>   DW_AT_type        : <0xeb6>
 <2><fc1>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fc2>   DW_AT_type        : <0xc38>
 <2><fc6>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fc7>   DW_AT_type        : <0xc60>
 <2><fcb>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fcc>   DW_AT_type        : <0x863>
 <2><fd0>: Abbrev Number: 0
 <1><fd1>: Abbrev Number: 22 (DW_TAG_subprogram)
    <fd2>   DW_AT_external    : 1
    <fd2>   DW_AT_name        : (indirect string, offset: 0x99f41): control
    <fd6>   DW_AT_decl_file   : 1
    <fd6>   DW_AT_decl_line   : 143
    <fd7>   DW_AT_decl_column : 6
    <fd7>   DW_AT_prototyped  : 1
    <fd7>   DW_AT_low_pc      : 0x80012dc
    <fdb>   DW_AT_high_pc     : 0x58
    <fdf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fe1>   DW_AT_call_all_tail_calls: 1
    <fe1>   DW_AT_sibling     : <0xff4>
 <2><fe5>: Abbrev Number: 7 (DW_TAG_variable)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x99fae): newRadioData
    <fea>   DW_AT_decl_file   : 1
    <fea>   DW_AT_decl_line   : 144
    <feb>   DW_AT_decl_column : 17
    <fec>   DW_AT_type        : <0x8b1>
    <ff0>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ff3>: Abbrev Number: 0
 <1><ff4>: Abbrev Number: 22 (DW_TAG_subprogram)
    <ff5>   DW_AT_external    : 1
    <ff5>   DW_AT_name        : (indirect string, offset: 0x9a1c4): handleBypassMode
    <ff9>   DW_AT_decl_file   : 1
    <ff9>   DW_AT_decl_line   : 80
    <ffa>   DW_AT_decl_column : 6
    <ffa>   DW_AT_prototyped  : 1
    <ffa>   DW_AT_low_pc      : 0x8001114
    <ffe>   DW_AT_high_pc     : 0x1c8
    <1002>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1004>   DW_AT_call_all_tail_calls: 1
    <1004>   DW_AT_sibling     : <0x107f>
 <2><1008>: Abbrev Number: 7 (DW_TAG_variable)
    <1009>   DW_AT_name        : (indirect string, offset: 0x9a026): pulseWidth
    <100d>   DW_AT_decl_file   : 1
    <100d>   DW_AT_decl_line   : 81
    <100e>   DW_AT_decl_column : 14
    <100f>   DW_AT_type        : <0x107f>
    <1013>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><1016>: Abbrev Number: 7 (DW_TAG_variable)
    <1017>   DW_AT_name        : (indirect string, offset: 0x9a01e): min_val
    <101b>   DW_AT_decl_file   : 1
    <101b>   DW_AT_decl_line   : 88
    <101c>   DW_AT_decl_column : 14
    <101d>   DW_AT_type        : <0x107f>
    <1021>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><1024>: Abbrev Number: 7 (DW_TAG_variable)
    <1025>   DW_AT_name        : (indirect string, offset: 0x9a329): max_val
    <1029>   DW_AT_decl_file   : 1
    <1029>   DW_AT_decl_line   : 95
    <102a>   DW_AT_decl_column : 14
    <102b>   DW_AT_type        : <0x107f>
    <102f>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><1033>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <1034>   DW_AT_low_pc      : 0x800116a
    <1038>   DW_AT_high_pc     : 0x14e
 <3><103c>: Abbrev Number: 31 (DW_TAG_variable)
    <103d>   DW_AT_name        : i
    <103f>   DW_AT_decl_file   : 1
    <1040>   DW_AT_decl_line   : 103
    <1041>   DW_AT_decl_column : 14
    <1042>   DW_AT_type        : <0x83d>
    <1046>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><1049>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <104a>   DW_AT_low_pc      : 0x8001170
