Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x39 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x116): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x293d): ../Core/Src/ANALOG.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2c24): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 2 (DW_TAG_subprogram)
    <2b>   DW_AT_external    : 1
    <2b>   DW_AT_name        : (indirect string, offset: 0x1c6e): adc_read
    <2f>   DW_AT_decl_file   : 1
    <30>   DW_AT_decl_line   : 10
    <31>   DW_AT_decl_column : 6
    <32>   DW_AT_prototyped  : 1
    <32>   DW_AT_low_pc      : 0x80004d0
    <36>   DW_AT_high_pc     : 0xe
    <3a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3c>   DW_AT_call_all_calls: 1
 <1><3c>: Abbrev Number: 0
  Compilation Unit @ offset 0x3d:
   Length:        0x39 (32-bit)
   Version:       5

    <c4>   DW_AT_producer    : (indirect string, offset: 0x116): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c8>   DW_AT_language    : 29	(C11)
    <c9>   DW_AT_name        : (indirect string, offset: 0x2e64): ../Core/Src/TELEMETRY.c
    <cd>   DW_AT_comp_dir    : (indirect string, offset: 0x2c24): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <d1>   DW_AT_ranges      : 0x45
    <d5>   DW_AT_low_pc      : 0
    <d9>   DW_AT_stmt_list   : 0x11f
    <dd>   DW_AT_macros      : 0xb05
 <1><e1>: Abbrev Number: 2 (DW_TAG_subprogram)
    <e2>   DW_AT_external    : 1
    <e2>   DW_AT_name        : (indirect string, offset: 0x2e8e): telemetry
    <e6>   DW_AT_decl_file   : 1
    <e7>   DW_AT_decl_line   : 10
    <e8>   DW_AT_decl_column : 6
    <e9>   DW_AT_prototyped  : 1
    <e9>   DW_AT_low_pc      : 0x80004fa
    <ed>   DW_AT_high_pc     : 0xe
    <f1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f3>   DW_AT_call_all_calls: 1
 <1><f3>: Abbrev Number: 0
  Compilation Unit @ offset 0xf4:
   Length:        0xa02 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xbc
   Pointer Size:  4
 <0><100>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <101>   DW_AT_producer    : (indirect string, offset: 0x116): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <105>   DW_AT_language    : 29	(C11)
    <106>   DW_AT_name        : (indirect string, offset: 0x6dbbd): ../Core/Src/adc.c
    <10a>   DW_AT_comp_dir    : (indirect string, offset: 0x2c24): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <10e>   DW_AT_ranges      : 0x58
    <112>   DW_AT_low_pc      : 0
    <116>   DW_AT_stmt_list   : 0x186
    <11a>   DW_AT_macros      : 0xb20
 <1><11e>: Abbrev Number: 5 (DW_TAG_base_type)
    <11f>   DW_AT_byte_size   : 1
    <120>   DW_AT_encoding    : 6	(signed char)
    <121>   DW_AT_name        : (indirect string, offset: 0x2107): signed char
 <1><125>: Abbrev Number: 5 (DW_TAG_base_type)
    <126>   DW_AT_byte_size   : 1
    <127>   DW_AT_encoding    : 8	(unsigned char)
    <128>   DW_AT_name        : (indirect string, offset: 0x223c): unsigned char
 <1><12c>: Abbrev Number: 5 (DW_TAG_base_type)
    <12d>   DW_AT_byte_size   : 2
    <12e>   DW_AT_encoding    : 5	(signed)
    <12f>   DW_AT_name        : (indirect string, offset: 0x599): short int
 <1><133>: Abbrev Number: 3 (DW_TAG_typedef)
    <134>   DW_AT_name        : (indirect string, offset: 0x78e67): __uint16_t
    <138>   DW_AT_decl_file   : 2
    <139>   DW_AT_decl_line   : 57
    <13a>   DW_AT_decl_column : 25
    <13b>   DW_AT_type        : <0x13f>
 <1><13f>: Abbrev Number: 5 (DW_TAG_base_type)
    <140>   DW_AT_byte_size   : 2
    <141>   DW_AT_encoding    : 7	(unsigned)
    <142>   DW_AT_name        : (indirect string, offset: 0x2595): short unsigned int
 <1><146>: Abbrev Number: 5 (DW_TAG_base_type)
    <147>   DW_AT_byte_size   : 4
    <148>   DW_AT_encoding    : 5	(signed)
    <149>   DW_AT_name        : (indirect string, offset: 0x1f99): long int
 <1><14d>: Abbrev Number: 3 (DW_TAG_typedef)
    <14e>   DW_AT_name        : (indirect string, offset: 0x5dd5b): __uint32_t
    <152>   DW_AT_decl_file   : 2
    <153>   DW_AT_decl_line   : 79
    <154>   DW_AT_decl_column : 25
    <155>   DW_AT_type        : <0x159>
 <1><159>: Abbrev Number: 5 (DW_TAG_base_type)
    <15a>   DW_AT_byte_size   : 4
    <15b>   DW_AT_encoding    : 7	(unsigned)
    <15c>   DW_AT_name        : (indirect string, offset: 0x1d66): long unsigned int
 <1><160>: Abbrev Number: 5 (DW_TAG_base_type)
    <161>   DW_AT_byte_size   : 8
    <162>   DW_AT_encoding    : 5	(signed)
    <163>   DW_AT_name        : (indirect string, offset: 0x126b): long long int
 <1><167>: Abbrev Number: 5 (DW_TAG_base_type)
    <168>   DW_AT_byte_size   : 8
    <169>   DW_AT_encoding    : 7	(unsigned)
    <16a>   DW_AT_name        : (indirect string, offset: 0x29a6): long long unsigned int
 <1><16e>: Abbrev Number: 23 (DW_TAG_base_type)
    <16f>   DW_AT_byte_size   : 4
    <170>   DW_AT_encoding    : 5	(signed)
    <171>   DW_AT_name        : int
 <1><175>: Abbrev Number: 5 (DW_TAG_base_type)
    <176>   DW_AT_byte_size   : 4
    <177>   DW_AT_encoding    : 7	(unsigned)
    <178>   DW_AT_name        : (indirect string, offset: 0x1ff9): unsigned int
 <1><17c>: Abbrev Number: 3 (DW_TAG_typedef)
    <17d>   DW_AT_name        : (indirect string, offset: 0x98c7f): uint16_t
    <181>   DW_AT_decl_file   : 3
    <182>   DW_AT_decl_line   : 36
    <183>   DW_AT_decl_column : 20
    <184>   DW_AT_type        : <0x133>
 <1><188>: Abbrev Number: 3 (DW_TAG_typedef)
    <189>   DW_AT_name        : (indirect string, offset: 0x98c5f): uint32_t
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 48
    <18f>   DW_AT_decl_column : 20
    <190>   DW_AT_type        : <0x14d>
 <1><194>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <195>   DW_AT_type        : <0x188>
 <1><199>: Abbrev Number: 15 (DW_TAG_array_type)
    <19a>   DW_AT_type        : <0x188>
    <19e>   DW_AT_sibling     : <0x1a9>
 <2><1a2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1a3>   DW_AT_type        : <0x175>
    <1a7>   DW_AT_upper_bound : 0
 <2><1a8>: Abbrev Number: 0
 <1><1a9>: Abbrev Number: 15 (DW_TAG_array_type)
    <1aa>   DW_AT_type        : <0x188>
    <1ae>   DW_AT_sibling     : <0x1b9>
 <2><1b2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1b3>   DW_AT_type        : <0x175>
    <1b7>   DW_AT_upper_bound : 1
 <2><1b8>: Abbrev Number: 0
 <1><1b9>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1ba>   DW_AT_byte_size   : 80
    <1bb>   DW_AT_decl_file   : 4
    <1bc>   DW_AT_decl_line   : 151
    <1bd>   DW_AT_decl_column : 9
    <1bd>   DW_AT_sibling     : <0x2c4>
 <2><1c1>: Abbrev Number: 6 (DW_TAG_member)
    <1c2>   DW_AT_name        : SR
    <1c5>   DW_AT_decl_file   : 4
    <1c6>   DW_AT_decl_line   : 153
    <1c7>   DW_AT_decl_column : 17
    <1c8>   DW_AT_type        : <0x194>
    <1cc>   DW_AT_data_member_location: 0
 <2><1cd>: Abbrev Number: 6 (DW_TAG_member)
    <1ce>   DW_AT_name        : CR1
    <1d2>   DW_AT_decl_file   : 4
    <1d3>   DW_AT_decl_line   : 154
    <1d4>   DW_AT_decl_column : 17
    <1d5>   DW_AT_type        : <0x194>
    <1d9>   DW_AT_data_member_location: 4
 <2><1da>: Abbrev Number: 6 (DW_TAG_member)
    <1db>   DW_AT_name        : CR2
    <1df>   DW_AT_decl_file   : 4
    <1e0>   DW_AT_decl_line   : 155
    <1e1>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0x194>
    <1e6>   DW_AT_data_member_location: 8
 <2><1e7>: Abbrev Number: 1 (DW_TAG_member)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x84b43): SMPR1
    <1ec>   DW_AT_decl_file   : 4
    <1ed>   DW_AT_decl_line   : 156
    <1ee>   DW_AT_decl_column : 17
    <1ef>   DW_AT_type        : <0x194>
    <1f3>   DW_AT_data_member_location: 12
 <2><1f4>: Abbrev Number: 1 (DW_TAG_member)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x3554d): SMPR2
    <1f9>   DW_AT_decl_file   : 4
    <1fa>   DW_AT_decl_line   : 157
    <1fb>   DW_AT_decl_column : 17
    <1fc>   DW_AT_type        : <0x194>
    <200>   DW_AT_data_member_location: 16
 <2><201>: Abbrev Number: 1 (DW_TAG_member)
    <202>   DW_AT_name        : (indirect string, offset: 0x33c4e): JOFR1
    <206>   DW_AT_decl_file   : 4
    <207>   DW_AT_decl_line   : 158
    <208>   DW_AT_decl_column : 17
    <209>   DW_AT_type        : <0x194>
    <20d>   DW_AT_data_member_location: 20
 <2><20e>: Abbrev Number: 1 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x33c54): JOFR2
    <213>   DW_AT_decl_file   : 4
    <214>   DW_AT_decl_line   : 159
    <215>   DW_AT_decl_column : 17
    <216>   DW_AT_type        : <0x194>
    <21a>   DW_AT_data_member_location: 24
 <2><21b>: Abbrev Number: 1 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0x33c5a): JOFR3
    <220>   DW_AT_decl_file   : 4
    <221>   DW_AT_decl_line   : 160
    <222>   DW_AT_decl_column : 17
    <223>   DW_AT_type        : <0x194>
    <227>   DW_AT_data_member_location: 28
 <2><228>: Abbrev Number: 1 (DW_TAG_member)
    <229>   DW_AT_name        : (indirect string, offset: 0x33c60): JOFR4
    <22d>   DW_AT_decl_file   : 4
    <22e>   DW_AT_decl_line   : 161
    <22f>   DW_AT_decl_column : 17
    <230>   DW_AT_type        : <0x194>
    <234>   DW_AT_data_member_location: 32
 <2><235>: Abbrev Number: 6 (DW_TAG_member)
    <236>   DW_AT_name        : HTR
    <23a>   DW_AT_decl_file   : 4
    <23b>   DW_AT_decl_line   : 162
    <23c>   DW_AT_decl_column : 17
    <23d>   DW_AT_type        : <0x194>
    <241>   DW_AT_data_member_location: 36
 <2><242>: Abbrev Number: 6 (DW_TAG_member)
    <243>   DW_AT_name        : LTR
    <247>   DW_AT_decl_file   : 4
    <248>   DW_AT_decl_line   : 163
    <249>   DW_AT_decl_column : 17
    <24a>   DW_AT_type        : <0x194>
    <24e>   DW_AT_data_member_location: 40
 <2><24f>: Abbrev Number: 1 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0xed88): SQR1
    <254>   DW_AT_decl_file   : 4
    <255>   DW_AT_decl_line   : 164
    <256>   DW_AT_decl_column : 17
    <257>   DW_AT_type        : <0x194>
    <25b>   DW_AT_data_member_location: 44
 <2><25c>: Abbrev Number: 1 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0xda02): SQR2
    <261>   DW_AT_decl_file   : 4
    <262>   DW_AT_decl_line   : 165
    <263>   DW_AT_decl_column : 17
    <264>   DW_AT_type        : <0x194>
    <268>   DW_AT_data_member_location: 48
 <2><269>: Abbrev Number: 1 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xda07): SQR3
    <26e>   DW_AT_decl_file   : 4
    <26f>   DW_AT_decl_line   : 166
    <270>   DW_AT_decl_column : 17
    <271>   DW_AT_type        : <0x194>
    <275>   DW_AT_data_member_location: 52
 <2><276>: Abbrev Number: 1 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x71983): JSQR
    <27b>   DW_AT_decl_file   : 4
    <27c>   DW_AT_decl_line   : 167
    <27d>   DW_AT_decl_column : 17
    <27e>   DW_AT_type        : <0x194>
    <282>   DW_AT_data_member_location: 56
 <2><283>: Abbrev Number: 1 (DW_TAG_member)
    <284>   DW_AT_name        : (indirect string, offset: 0x5e5d6): JDR1
    <288>   DW_AT_decl_file   : 4
    <289>   DW_AT_decl_line   : 168
    <28a>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0x194>
    <28f>   DW_AT_data_member_location: 60
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0x5e5db): JDR2
    <295>   DW_AT_decl_file   : 4
    <296>   DW_AT_decl_line   : 169
    <297>   DW_AT_decl_column : 17
    <298>   DW_AT_type        : <0x194>
    <29c>   DW_AT_data_member_location: 64
 <2><29d>: Abbrev Number: 1 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0x5e5e0): JDR3
    <2a2>   DW_AT_decl_file   : 4
    <2a3>   DW_AT_decl_line   : 170
    <2a4>   DW_AT_decl_column : 17
    <2a5>   DW_AT_type        : <0x194>
    <2a9>   DW_AT_data_member_location: 68
 <2><2aa>: Abbrev Number: 1 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x286ca): JDR4
    <2af>   DW_AT_decl_file   : 4
    <2b0>   DW_AT_decl_line   : 171
    <2b1>   DW_AT_decl_column : 17
    <2b2>   DW_AT_type        : <0x194>
    <2b6>   DW_AT_data_member_location: 72
 <2><2b7>: Abbrev Number: 6 (DW_TAG_member)
    <2b8>   DW_AT_name        : DR
    <2bb>   DW_AT_decl_file   : 4
    <2bc>   DW_AT_decl_line   : 172
    <2bd>   DW_AT_decl_column : 17
    <2be>   DW_AT_type        : <0x194>
    <2c2>   DW_AT_data_member_location: 76
 <2><2c3>: Abbrev Number: 0
 <1><2c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x718a0): ADC_TypeDef
    <2c9>   DW_AT_decl_file   : 4
    <2ca>   DW_AT_decl_line   : 173
    <2cb>   DW_AT_decl_column : 3
    <2cc>   DW_AT_type        : <0x1b9>
 <1><2d0>: Abbrev Number: 9 (DW_TAG_structure_type)
    <2d1>   DW_AT_byte_size   : 24
    <2d2>   DW_AT_decl_file   : 4
    <2d3>   DW_AT_decl_line   : 213
    <2d4>   DW_AT_decl_column : 9
    <2d4>   DW_AT_sibling     : <0x326>
 <2><2d8>: Abbrev Number: 6 (DW_TAG_member)
    <2d9>   DW_AT_name        : CR
    <2dc>   DW_AT_decl_file   : 4
    <2dd>   DW_AT_decl_line   : 215
    <2de>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0x194>
    <2e3>   DW_AT_data_member_location: 0
 <2><2e4>: Abbrev Number: 1 (DW_TAG_member)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x489ba): NDTR
    <2e9>   DW_AT_decl_file   : 4
    <2ea>   DW_AT_decl_line   : 216
    <2eb>   DW_AT_decl_column : 17
    <2ec>   DW_AT_type        : <0x194>
    <2f0>   DW_AT_data_member_location: 4
 <2><2f1>: Abbrev Number: 6 (DW_TAG_member)
    <2f2>   DW_AT_name        : PAR
    <2f6>   DW_AT_decl_file   : 4
    <2f7>   DW_AT_decl_line   : 217
    <2f8>   DW_AT_decl_column : 17
    <2f9>   DW_AT_type        : <0x194>
    <2fd>   DW_AT_data_member_location: 8
 <2><2fe>: Abbrev Number: 1 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x3d6f0): M0AR
    <303>   DW_AT_decl_file   : 4
    <304>   DW_AT_decl_line   : 218
    <305>   DW_AT_decl_column : 17
    <306>   DW_AT_type        : <0x194>
    <30a>   DW_AT_data_member_location: 12
 <2><30b>: Abbrev Number: 1 (DW_TAG_member)
    <30c>   DW_AT_name        : (indirect string, offset: 0x1006d): M1AR
    <310>   DW_AT_decl_file   : 4
    <311>   DW_AT_decl_line   : 219
    <312>   DW_AT_decl_column : 17
    <313>   DW_AT_type        : <0x194>
    <317>   DW_AT_data_member_location: 16
 <2><318>: Abbrev Number: 6 (DW_TAG_member)
    <319>   DW_AT_name        : FCR
    <31d>   DW_AT_decl_file   : 4
    <31e>   DW_AT_decl_line   : 220
    <31f>   DW_AT_decl_column : 17
    <320>   DW_AT_type        : <0x194>
    <324>   DW_AT_data_member_location: 20
 <2><325>: Abbrev Number: 0
 <1><326>: Abbrev Number: 3 (DW_TAG_typedef)
    <327>   DW_AT_name        : (indirect string, offset: 0x8621c): DMA_Stream_TypeDef
    <32b>   DW_AT_decl_file   : 4
    <32c>   DW_AT_decl_line   : 221
    <32d>   DW_AT_decl_column : 3
    <32e>   DW_AT_type        : <0x2d0>
 <1><332>: Abbrev Number: 17 (DW_TAG_structure_type)
    <333>   DW_AT_byte_size   : 40
    <334>   DW_AT_decl_file   : 4
    <334>   DW_AT_decl_line   : 264
    <336>   DW_AT_decl_column : 9
    <336>   DW_AT_sibling     : <0x3a7>
 <2><33a>: Abbrev Number: 2 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x40c7): MODER
    <33f>   DW_AT_decl_file   : 4
    <33f>   DW_AT_decl_line   : 266
    <341>   DW_AT_decl_column : 17
    <341>   DW_AT_type        : <0x194>
    <345>   DW_AT_data_member_location: 0
 <2><346>: Abbrev Number: 2 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x727fc): OTYPER
    <34b>   DW_AT_decl_file   : 4
    <34b>   DW_AT_decl_line   : 267
    <34d>   DW_AT_decl_column : 17
    <34d>   DW_AT_type        : <0x194>
    <351>   DW_AT_data_member_location: 4
 <2><352>: Abbrev Number: 2 (DW_TAG_member)
    <353>   DW_AT_name        : (indirect string, offset: 0x8097f): OSPEEDR
    <357>   DW_AT_decl_file   : 4
    <357>   DW_AT_decl_line   : 268
    <359>   DW_AT_decl_column : 17
    <359>   DW_AT_type        : <0x194>
    <35d>   DW_AT_data_member_location: 8
 <2><35e>: Abbrev Number: 2 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x698f3): PUPDR
    <363>   DW_AT_decl_file   : 4
    <363>   DW_AT_decl_line   : 269
    <365>   DW_AT_decl_column : 17
    <365>   DW_AT_type        : <0x194>
    <369>   DW_AT_data_member_location: 12
 <2><36a>: Abbrev Number: 10 (DW_TAG_member)
    <36b>   DW_AT_name        : IDR
    <36f>   DW_AT_decl_file   : 4
    <36f>   DW_AT_decl_line   : 270
    <371>   DW_AT_decl_column : 17
    <371>   DW_AT_type        : <0x194>
    <375>   DW_AT_data_member_location: 16
 <2><376>: Abbrev Number: 10 (DW_TAG_member)
    <377>   DW_AT_name        : ODR
    <37b>   DW_AT_decl_file   : 4
    <37b>   DW_AT_decl_line   : 271
    <37d>   DW_AT_decl_column : 17
    <37d>   DW_AT_type        : <0x194>
    <381>   DW_AT_data_member_location: 20
 <2><382>: Abbrev Number: 2 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x229c7): BSRR
    <387>   DW_AT_decl_file   : 4
    <387>   DW_AT_decl_line   : 272
    <389>   DW_AT_decl_column : 17
    <389>   DW_AT_type        : <0x194>
    <38d>   DW_AT_data_member_location: 24
 <2><38e>: Abbrev Number: 2 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0x7eb7e): LCKR
    <393>   DW_AT_decl_file   : 4
    <393>   DW_AT_decl_line   : 273
    <395>   DW_AT_decl_column : 17
    <395>   DW_AT_type        : <0x194>
    <399>   DW_AT_data_member_location: 28
 <2><39a>: Abbrev Number: 10 (DW_TAG_member)
    <39b>   DW_AT_name        : AFR
    <39f>   DW_AT_decl_file   : 4
    <39f>   DW_AT_decl_line   : 274
    <3a1>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0x3b7>
    <3a5>   DW_AT_data_member_location: 32
 <2><3a6>: Abbrev Number: 0
 <1><3a7>: Abbrev Number: 15 (DW_TAG_array_type)
    <3a8>   DW_AT_type        : <0x194>
    <3ac>   DW_AT_sibling     : <0x3b7>
 <2><3b0>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3b1>   DW_AT_type        : <0x175>
    <3b5>   DW_AT_upper_bound : 1
 <2><3b6>: Abbrev Number: 0
 <1><3b7>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <3b8>   DW_AT_type        : <0x3a7>
 <1><3bc>: Abbrev Number: 18 (DW_TAG_typedef)
    <3bd>   DW_AT_name        : (indirect string, offset: 0x8f265): GPIO_TypeDef
    <3c1>   DW_AT_decl_file   : 4
    <3c1>   DW_AT_decl_line   : 275
    <3c3>   DW_AT_decl_column : 3
    <3c3>   DW_AT_type        : <0x332>
 <1><3c7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3c8>   DW_AT_byte_size   : 144
    <3c9>   DW_AT_decl_file   : 4
    <3c9>   DW_AT_decl_line   : 335
    <3cb>   DW_AT_decl_column : 9
    <3cb>   DW_AT_sibling     : <0x54f>
 <2><3cf>: Abbrev Number: 10 (DW_TAG_member)
    <3d0>   DW_AT_name        : CR
    <3d3>   DW_AT_decl_file   : 4
    <3d3>   DW_AT_decl_line   : 337
    <3d5>   DW_AT_decl_column : 17
    <3d5>   DW_AT_type        : <0x194>
    <3d9>   DW_AT_data_member_location: 0
 <2><3da>: Abbrev Number: 2 (DW_TAG_member)
    <3db>   DW_AT_name        : (indirect string, offset: 0x6724a): PLLCFGR
    <3df>   DW_AT_decl_file   : 4
    <3df>   DW_AT_decl_line   : 338
    <3e1>   DW_AT_decl_column : 17
    <3e1>   DW_AT_type        : <0x194>
    <3e5>   DW_AT_data_member_location: 4
 <2><3e6>: Abbrev Number: 2 (DW_TAG_member)
    <3e7>   DW_AT_name        : (indirect string, offset: 0x403fd): CFGR
    <3eb>   DW_AT_decl_file   : 4
    <3eb>   DW_AT_decl_line   : 339
    <3ed>   DW_AT_decl_column : 17
    <3ed>   DW_AT_type        : <0x194>
    <3f1>   DW_AT_data_member_location: 8
 <2><3f2>: Abbrev Number: 10 (DW_TAG_member)
    <3f3>   DW_AT_name        : CIR
    <3f7>   DW_AT_decl_file   : 4
    <3f7>   DW_AT_decl_line   : 340
    <3f9>   DW_AT_decl_column : 17
    <3f9>   DW_AT_type        : <0x194>
    <3fd>   DW_AT_data_member_location: 12
 <2><3fe>: Abbrev Number: 2 (DW_TAG_member)
    <3ff>   DW_AT_name        : (indirect string, offset: 0x760e6): AHB1RSTR
    <403>   DW_AT_decl_file   : 4
    <403>   DW_AT_decl_line   : 341
    <405>   DW_AT_decl_column : 17
    <405>   DW_AT_type        : <0x194>
    <409>   DW_AT_data_member_location: 16
 <2><40a>: Abbrev Number: 2 (DW_TAG_member)
    <40b>   DW_AT_name        : (indirect string, offset: 0x12e48): AHB2RSTR
    <40f>   DW_AT_decl_file   : 4
    <40f>   DW_AT_decl_line   : 342
    <411>   DW_AT_decl_column : 17
    <411>   DW_AT_type        : <0x194>
    <415>   DW_AT_data_member_location: 20
 <2><416>: Abbrev Number: 2 (DW_TAG_member)
    <417>   DW_AT_name        : (indirect string, offset: 0x402a0): AHB3RSTR
    <41b>   DW_AT_decl_file   : 4
    <41b>   DW_AT_decl_line   : 343
    <41d>   DW_AT_decl_column : 17
    <41d>   DW_AT_type        : <0x194>
    <421>   DW_AT_data_member_location: 24
 <2><422>: Abbrev Number: 2 (DW_TAG_member)
    <423>   DW_AT_name        : (indirect string, offset: 0x8b0a3): RESERVED0
    <427>   DW_AT_decl_file   : 4
    <427>   DW_AT_decl_line   : 344
    <429>   DW_AT_decl_column : 17
    <429>   DW_AT_type        : <0x188>
    <42d>   DW_AT_data_member_location: 28
 <2><42e>: Abbrev Number: 2 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x12a53): APB1RSTR
    <433>   DW_AT_decl_file   : 4
    <433>   DW_AT_decl_line   : 345
    <435>   DW_AT_decl_column : 17
    <435>   DW_AT_type        : <0x194>
    <439>   DW_AT_data_member_location: 32
 <2><43a>: Abbrev Number: 2 (DW_TAG_member)
    <43b>   DW_AT_name        : (indirect string, offset: 0x3fee2): APB2RSTR
    <43f>   DW_AT_decl_file   : 4
    <43f>   DW_AT_decl_line   : 346
    <441>   DW_AT_decl_column : 17
    <441>   DW_AT_type        : <0x194>
    <445>   DW_AT_data_member_location: 36
 <2><446>: Abbrev Number: 2 (DW_TAG_member)
    <447>   DW_AT_name        : (indirect string, offset: 0x8b0ad): RESERVED1
    <44b>   DW_AT_decl_file   : 4
    <44b>   DW_AT_decl_line   : 347
    <44d>   DW_AT_decl_column : 17
    <44d>   DW_AT_type        : <0x1a9>
    <451>   DW_AT_data_member_location: 40
 <2><452>: Abbrev Number: 2 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0xe707): AHB1ENR
    <457>   DW_AT_decl_file   : 4
    <457>   DW_AT_decl_line   : 348
    <459>   DW_AT_decl_column : 17
    <459>   DW_AT_type        : <0x194>
    <45d>   DW_AT_data_member_location: 48
 <2><45e>: Abbrev Number: 2 (DW_TAG_member)
    <45f>   DW_AT_name        : (indirect string, offset: 0x285e2): AHB2ENR
    <463>   DW_AT_decl_file   : 4
    <463>   DW_AT_decl_line   : 349
    <465>   DW_AT_decl_column : 17
    <465>   DW_AT_type        : <0x194>
    <469>   DW_AT_data_member_location: 52
 <2><46a>: Abbrev Number: 2 (DW_TAG_member)
    <46b>   DW_AT_name        : (indirect string, offset: 0x422c0): AHB3ENR
    <46f>   DW_AT_decl_file   : 4
    <46f>   DW_AT_decl_line   : 350
    <471>   DW_AT_decl_column : 17
    <471>   DW_AT_type        : <0x194>
    <475>   DW_AT_data_member_location: 56
 <2><476>: Abbrev Number: 2 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0x8b0b7): RESERVED2
    <47b>   DW_AT_decl_file   : 4
    <47b>   DW_AT_decl_line   : 351
    <47d>   DW_AT_decl_column : 17
    <47d>   DW_AT_type        : <0x188>
    <481>   DW_AT_data_member_location: 60
 <2><482>: Abbrev Number: 2 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x6f880): APB1ENR
    <487>   DW_AT_decl_file   : 4
    <487>   DW_AT_decl_line   : 352
    <489>   DW_AT_decl_column : 17
    <489>   DW_AT_type        : <0x194>
    <48d>   DW_AT_data_member_location: 64
 <2><48e>: Abbrev Number: 2 (DW_TAG_member)
    <48f>   DW_AT_name        : (indirect string, offset: 0x135d5): APB2ENR
    <493>   DW_AT_decl_file   : 4
    <493>   DW_AT_decl_line   : 353
    <495>   DW_AT_decl_column : 17
    <495>   DW_AT_type        : <0x194>
    <499>   DW_AT_data_member_location: 68
 <2><49a>: Abbrev Number: 2 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0x8b0c1): RESERVED3
    <49f>   DW_AT_decl_file   : 4
    <49f>   DW_AT_decl_line   : 354
    <4a1>   DW_AT_decl_column : 17
    <4a1>   DW_AT_type        : <0x1a9>
    <4a5>   DW_AT_data_member_location: 72
 <2><4a6>: Abbrev Number: 2 (DW_TAG_member)
    <4a7>   DW_AT_name        : (indirect string, offset: 0x498a3): AHB1LPENR
    <4ab>   DW_AT_decl_file   : 4
    <4ab>   DW_AT_decl_line   : 355
    <4ad>   DW_AT_decl_column : 17
    <4ad>   DW_AT_type        : <0x194>
    <4b1>   DW_AT_data_member_location: 80
 <2><4b2>: Abbrev Number: 2 (DW_TAG_member)
    <4b3>   DW_AT_name        : (indirect string, offset: 0x2260e): AHB2LPENR
    <4b7>   DW_AT_decl_file   : 4
    <4b7>   DW_AT_decl_line   : 356
    <4b9>   DW_AT_decl_column : 17
    <4b9>   DW_AT_type        : <0x194>
    <4bd>   DW_AT_data_member_location: 84
 <2><4be>: Abbrev Number: 2 (DW_TAG_member)
    <4bf>   DW_AT_name        : (indirect string, offset: 0x636e4): AHB3LPENR
    <4c3>   DW_AT_decl_file   : 4
    <4c3>   DW_AT_decl_line   : 357
    <4c5>   DW_AT_decl_column : 17
    <4c5>   DW_AT_type        : <0x194>
    <4c9>   DW_AT_data_member_location: 88
 <2><4ca>: Abbrev Number: 2 (DW_TAG_member)
    <4cb>   DW_AT_name        : (indirect string, offset: 0x8b0cb): RESERVED4
    <4cf>   DW_AT_decl_file   : 4
    <4cf>   DW_AT_decl_line   : 358
    <4d1>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0x188>
    <4d5>   DW_AT_data_member_location: 92
 <2><4d6>: Abbrev Number: 2 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x61f1b): APB1LPENR
    <4db>   DW_AT_decl_file   : 4
    <4db>   DW_AT_decl_line   : 359
    <4dd>   DW_AT_decl_column : 17
    <4dd>   DW_AT_type        : <0x194>
    <4e1>   DW_AT_data_member_location: 96
 <2><4e2>: Abbrev Number: 2 (DW_TAG_member)
    <4e3>   DW_AT_name        : (indirect string, offset: 0xd933): APB2LPENR
    <4e7>   DW_AT_decl_file   : 4
    <4e7>   DW_AT_decl_line   : 360
    <4e9>   DW_AT_decl_column : 17
    <4e9>   DW_AT_type        : <0x194>
    <4ed>   DW_AT_data_member_location: 100
 <2><4ee>: Abbrev Number: 2 (DW_TAG_member)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x8b0d5): RESERVED5
    <4f3>   DW_AT_decl_file   : 4
    <4f3>   DW_AT_decl_line   : 361
    <4f5>   DW_AT_decl_column : 17
    <4f5>   DW_AT_type        : <0x1a9>
    <4f9>   DW_AT_data_member_location: 104
 <2><4fa>: Abbrev Number: 2 (DW_TAG_member)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x168e6): BDCR
    <4ff>   DW_AT_decl_file   : 4
    <4ff>   DW_AT_decl_line   : 362
    <501>   DW_AT_decl_column : 17
    <501>   DW_AT_type        : <0x194>
    <505>   DW_AT_data_member_location: 112
 <2><506>: Abbrev Number: 10 (DW_TAG_member)
    <507>   DW_AT_name        : CSR
    <50b>   DW_AT_decl_file   : 4
    <50b>   DW_AT_decl_line   : 363
    <50d>   DW_AT_decl_column : 17
    <50d>   DW_AT_type        : <0x194>
    <511>   DW_AT_data_member_location: 116
 <2><512>: Abbrev Number: 2 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x8b0df): RESERVED6
    <517>   DW_AT_decl_file   : 4
    <517>   DW_AT_decl_line   : 364
    <519>   DW_AT_decl_column : 17
    <519>   DW_AT_type        : <0x1a9>
    <51d>   DW_AT_data_member_location: 120
 <2><51e>: Abbrev Number: 2 (DW_TAG_member)
    <51f>   DW_AT_name        : (indirect string, offset: 0x4e5c6): SSCGR
    <523>   DW_AT_decl_file   : 4
    <523>   DW_AT_decl_line   : 365
    <525>   DW_AT_decl_column : 17
    <525>   DW_AT_type        : <0x194>
    <529>   DW_AT_data_member_location: 128
 <2><52a>: Abbrev Number: 2 (DW_TAG_member)
    <52b>   DW_AT_name        : (indirect string, offset: 0x318c5): PLLI2SCFGR
    <52f>   DW_AT_decl_file   : 4
    <52f>   DW_AT_decl_line   : 366
    <531>   DW_AT_decl_column : 17
    <531>   DW_AT_type        : <0x194>
    <535>   DW_AT_data_member_location: 132
 <2><536>: Abbrev Number: 2 (DW_TAG_member)
    <537>   DW_AT_name        : (indirect string, offset: 0x8b0e9): RESERVED7
    <53b>   DW_AT_decl_file   : 4
    <53b>   DW_AT_decl_line   : 367
    <53d>   DW_AT_decl_column : 17
    <53d>   DW_AT_type        : <0x199>
    <541>   DW_AT_data_member_location: 136
 <2><542>: Abbrev Number: 2 (DW_TAG_member)
    <543>   DW_AT_name        : (indirect string, offset: 0x403fa): DCKCFGR
    <547>   DW_AT_decl_file   : 4
    <547>   DW_AT_decl_line   : 368
    <549>   DW_AT_decl_column : 17
    <549>   DW_AT_type        : <0x194>
    <54d>   DW_AT_data_member_location: 140
 <2><54e>: Abbrev Number: 0
 <1><54f>: Abbrev Number: 18 (DW_TAG_typedef)
    <550>   DW_AT_name        : (indirect string, offset: 0x447c2): RCC_TypeDef
    <554>   DW_AT_decl_file   : 4
    <554>   DW_AT_decl_line   : 369
    <556>   DW_AT_decl_column : 3
    <556>   DW_AT_type        : <0x3c7>
 <1><55a>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <55b>   DW_AT_encoding    : 7	(unsigned)
    <55b>   DW_AT_byte_size   : 1
    <55b>   DW_AT_type        : <0x125>
    <55f>   DW_AT_decl_file   : 5
    <560>   DW_AT_decl_line   : 191
    <561>   DW_AT_decl_column : 1
    <561>   DW_AT_sibling     : <0x572>
 <2><565>: Abbrev Number: 4 (DW_TAG_enumerator)
    <566>   DW_AT_name        : (indirect string, offset: 0x46454): DISABLE
    <56a>   DW_AT_const_value : 0
 <2><56b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <56c>   DW_AT_name        : (indirect string, offset: 0x866d7): ENABLE
    <570>   DW_AT_const_value : 1
 <2><571>: Abbrev Number: 0
 <1><572>: Abbrev Number: 3 (DW_TAG_typedef)
    <573>   DW_AT_name        : (indirect string, offset: 0x92663): FunctionalState
    <577>   DW_AT_decl_file   : 5
    <578>   DW_AT_decl_line   : 194
    <579>   DW_AT_decl_column : 3
    <57a>   DW_AT_type        : <0x55a>
 <1><57e>: Abbrev Number: 5 (DW_TAG_base_type)
    <57f>   DW_AT_byte_size   : 8
    <580>   DW_AT_encoding    : 4	(float)
    <581>   DW_AT_name        : (indirect string, offset: 0x996f6): long double
 <1><585>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <586>   DW_AT_encoding    : 7	(unsigned)
    <586>   DW_AT_byte_size   : 1
    <586>   DW_AT_type        : <0x125>
    <58a>   DW_AT_decl_file   : 6
    <58b>   DW_AT_decl_line   : 39
    <58c>   DW_AT_decl_column : 1
    <58c>   DW_AT_sibling     : <0x5a9>
 <2><590>: Abbrev Number: 4 (DW_TAG_enumerator)
    <591>   DW_AT_name        : (indirect string, offset: 0x328a0): HAL_OK
    <595>   DW_AT_const_value : 0
 <2><596>: Abbrev Number: 4 (DW_TAG_enumerator)
    <597>   DW_AT_name        : (indirect string, offset: 0x5c237): HAL_ERROR
    <59b>   DW_AT_const_value : 1
 <2><59c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <59d>   DW_AT_name        : (indirect string, offset: 0x7bb26): HAL_BUSY
    <5a1>   DW_AT_const_value : 2
 <2><5a2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <5a3>   DW_AT_name        : (indirect string, offset: 0x2c291): HAL_TIMEOUT
    <5a7>   DW_AT_const_value : 3
 <2><5a8>: Abbrev Number: 0
 <1><5a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <5aa>   DW_AT_name        : (indirect string, offset: 0x84a0b): HAL_StatusTypeDef
    <5ae>   DW_AT_decl_file   : 6
    <5af>   DW_AT_decl_line   : 44
    <5b0>   DW_AT_decl_column : 3
    <5b1>   DW_AT_type        : <0x585>
 <1><5b5>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <5b6>   DW_AT_encoding    : 7	(unsigned)
    <5b6>   DW_AT_byte_size   : 1
    <5b6>   DW_AT_type        : <0x125>
    <5ba>   DW_AT_decl_file   : 6
    <5bb>   DW_AT_decl_line   : 50
    <5bc>   DW_AT_decl_column : 1
    <5bc>   DW_AT_sibling     : <0x5cd>
 <2><5c0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <5c1>   DW_AT_name        : (indirect string, offset: 0x6d95c): HAL_UNLOCKED
    <5c5>   DW_AT_const_value : 0
 <2><5c6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x92f50): HAL_LOCKED
    <5cb>   DW_AT_const_value : 1
 <2><5cc>: Abbrev Number: 0
 <1><5cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x59d11): HAL_LockTypeDef
    <5d2>   DW_AT_decl_file   : 6
    <5d3>   DW_AT_decl_line   : 53
    <5d4>   DW_AT_decl_column : 3
    <5d5>   DW_AT_type        : <0x5b5>
 <1><5d9>: Abbrev Number: 9 (DW_TAG_structure_type)
    <5da>   DW_AT_byte_size   : 20
    <5db>   DW_AT_decl_file   : 7
    <5dc>   DW_AT_decl_line   : 46
    <5dd>   DW_AT_decl_column : 9
    <5dd>   DW_AT_sibling     : <0x623>
 <2><5e1>: Abbrev Number: 6 (DW_TAG_member)
    <5e2>   DW_AT_name        : Pin
    <5e6>   DW_AT_decl_file   : 7
    <5e7>   DW_AT_decl_line   : 48
    <5e8>   DW_AT_decl_column : 12
    <5e9>   DW_AT_type        : <0x188>
    <5ed>   DW_AT_data_member_location: 0
 <2><5ee>: Abbrev Number: 1 (DW_TAG_member)
    <5ef>   DW_AT_name        : (indirect string, offset: 0x9b7a7): Mode
    <5f3>   DW_AT_decl_file   : 7
    <5f4>   DW_AT_decl_line   : 51
    <5f5>   DW_AT_decl_column : 12
    <5f6>   DW_AT_type        : <0x188>
    <5fa>   DW_AT_data_member_location: 4
 <2><5fb>: Abbrev Number: 1 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x4c563): Pull
    <600>   DW_AT_decl_file   : 7
    <601>   DW_AT_decl_line   : 54
    <602>   DW_AT_decl_column : 12
    <603>   DW_AT_type        : <0x188>
    <607>   DW_AT_data_member_location: 8
 <2><608>: Abbrev Number: 1 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x9b153): Speed
    <60d>   DW_AT_decl_file   : 7
    <60e>   DW_AT_decl_line   : 57
    <60f>   DW_AT_decl_column : 12
    <610>   DW_AT_type        : <0x188>
    <614>   DW_AT_data_member_location: 12
 <2><615>: Abbrev Number: 1 (DW_TAG_member)
    <616>   DW_AT_name        : (indirect string, offset: 0x43a5b): Alternate
    <61a>   DW_AT_decl_file   : 7
    <61b>   DW_AT_decl_line   : 60
    <61c>   DW_AT_decl_column : 12
    <61d>   DW_AT_type        : <0x188>
    <621>   DW_AT_data_member_location: 16
 <2><622>: Abbrev Number: 0
 <1><623>: Abbrev Number: 3 (DW_TAG_typedef)
    <624>   DW_AT_name        : (indirect string, offset: 0x73c48): GPIO_InitTypeDef
    <628>   DW_AT_decl_file   : 7
    <629>   DW_AT_decl_line   : 62
    <62a>   DW_AT_decl_column : 2
    <62b>   DW_AT_type        : <0x5d9>
 <1><62f>: Abbrev Number: 9 (DW_TAG_structure_type)
    <630>   DW_AT_byte_size   : 48
    <631>   DW_AT_decl_file   : 8
    <632>   DW_AT_decl_line   : 48
    <633>   DW_AT_decl_column : 9
    <633>   DW_AT_sibling     : <0x6d4>
 <2><637>: Abbrev Number: 1 (DW_TAG_member)
    <638>   DW_AT_name        : (indirect string, offset: 0x973be): Channel
    <63c>   DW_AT_decl_file   : 8
    <63d>   DW_AT_decl_line   : 50
    <63e>   DW_AT_decl_column : 12
    <63f>   DW_AT_type        : <0x188>
    <643>   DW_AT_data_member_location: 0
 <2><644>: Abbrev Number: 1 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x9d30a): Direction
    <649>   DW_AT_decl_file   : 8
    <64a>   DW_AT_decl_line   : 53
    <64b>   DW_AT_decl_column : 12
    <64c>   DW_AT_type        : <0x188>
    <650>   DW_AT_data_member_location: 4
 <2><651>: Abbrev Number: 1 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0xc659): PeriphInc
    <656>   DW_AT_decl_file   : 8
    <657>   DW_AT_decl_line   : 57
    <658>   DW_AT_decl_column : 12
    <659>   DW_AT_type        : <0x188>
    <65d>   DW_AT_data_member_location: 8
 <2><65e>: Abbrev Number: 1 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x18f24): MemInc
    <663>   DW_AT_decl_file   : 8
    <664>   DW_AT_decl_line   : 60
    <665>   DW_AT_decl_column : 12
    <666>   DW_AT_type        : <0x188>
    <66a>   DW_AT_data_member_location: 12
 <2><66b>: Abbrev Number: 1 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x49cd8): PeriphDataAlignment
    <670>   DW_AT_decl_file   : 8
    <671>   DW_AT_decl_line   : 63
    <672>   DW_AT_decl_column : 12
    <673>   DW_AT_type        : <0x188>
    <677>   DW_AT_data_member_location: 16
 <2><678>: Abbrev Number: 1 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0x859bc): MemDataAlignment
    <67d>   DW_AT_decl_file   : 8
    <67e>   DW_AT_decl_line   : 66
    <67f>   DW_AT_decl_column : 12
    <680>   DW_AT_type        : <0x188>
    <684>   DW_AT_data_member_location: 20
 <2><685>: Abbrev Number: 1 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0x9b7a7): Mode
    <68a>   DW_AT_decl_file   : 8
    <68b>   DW_AT_decl_line   : 69
    <68c>   DW_AT_decl_column : 12
    <68d>   DW_AT_type        : <0x188>
    <691>   DW_AT_data_member_location: 24
 <2><692>: Abbrev Number: 1 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x9c5c2): Priority
    <697>   DW_AT_decl_file   : 8
    <698>   DW_AT_decl_line   : 74
    <699>   DW_AT_decl_column : 12
    <69a>   DW_AT_type        : <0x188>
    <69e>   DW_AT_data_member_location: 28
 <2><69f>: Abbrev Number: 1 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0x3f9ff): FIFOMode
    <6a4>   DW_AT_decl_file   : 8
    <6a5>   DW_AT_decl_line   : 77
    <6a6>   DW_AT_decl_column : 12
    <6a7>   DW_AT_type        : <0x188>
    <6ab>   DW_AT_data_member_location: 32
 <2><6ac>: Abbrev Number: 1 (DW_TAG_member)
    <6ad>   DW_AT_name        : (indirect string, offset: 0x709ea): FIFOThreshold
    <6b1>   DW_AT_decl_file   : 8
    <6b2>   DW_AT_decl_line   : 82
    <6b3>   DW_AT_decl_column : 12
    <6b4>   DW_AT_type        : <0x188>
    <6b8>   DW_AT_data_member_location: 36
 <2><6b9>: Abbrev Number: 1 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x3ac30): MemBurst
    <6be>   DW_AT_decl_file   : 8
    <6bf>   DW_AT_decl_line   : 85
    <6c0>   DW_AT_decl_column : 12
    <6c1>   DW_AT_type        : <0x188>
    <6c5>   DW_AT_data_member_location: 40
 <2><6c6>: Abbrev Number: 1 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0x334e7): PeriphBurst
    <6cb>   DW_AT_decl_file   : 8
    <6cc>   DW_AT_decl_line   : 91
    <6cd>   DW_AT_decl_column : 12
    <6ce>   DW_AT_type        : <0x188>
    <6d2>   DW_AT_data_member_location: 44
 <2><6d3>: Abbrev Number: 0
 <1><6d4>: Abbrev Number: 3 (DW_TAG_typedef)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x28d20): DMA_InitTypeDef
    <6d9>   DW_AT_decl_file   : 8
    <6da>   DW_AT_decl_line   : 96
    <6db>   DW_AT_decl_column : 2
    <6dc>   DW_AT_type        : <0x62f>
 <1><6e0>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <6e1>   DW_AT_encoding    : 7	(unsigned)
    <6e1>   DW_AT_byte_size   : 1
    <6e1>   DW_AT_type        : <0x125>
    <6e5>   DW_AT_decl_file   : 8
    <6e6>   DW_AT_decl_line   : 103
    <6e7>   DW_AT_decl_column : 1
    <6e7>   DW_AT_sibling     : <0x710>
 <2><6eb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x6e9a9): HAL_DMA_STATE_RESET
    <6f0>   DW_AT_const_value : 0
 <2><6f1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x29c16): HAL_DMA_STATE_READY
    <6f6>   DW_AT_const_value : 1
 <2><6f7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6f8>   DW_AT_name        : (indirect string, offset: 0x660e7): HAL_DMA_STATE_BUSY
    <6fc>   DW_AT_const_value : 2
 <2><6fd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6fe>   DW_AT_name        : (indirect string, offset: 0x90ee9): HAL_DMA_STATE_TIMEOUT
    <702>   DW_AT_const_value : 3
 <2><703>: Abbrev Number: 4 (DW_TAG_enumerator)
    <704>   DW_AT_name        : (indirect string, offset: 0x7e8ba): HAL_DMA_STATE_ERROR
    <708>   DW_AT_const_value : 4
 <2><709>: Abbrev Number: 4 (DW_TAG_enumerator)
    <70a>   DW_AT_name        : (indirect string, offset: 0x22fc6): HAL_DMA_STATE_ABORT
    <70e>   DW_AT_const_value : 5
 <2><70f>: Abbrev Number: 0
 <1><710>: Abbrev Number: 3 (DW_TAG_typedef)
    <711>   DW_AT_name        : (indirect string, offset: 0x51d24): HAL_DMA_StateTypeDef
    <715>   DW_AT_decl_file   : 8
    <716>   DW_AT_decl_line   : 110
    <717>   DW_AT_decl_column : 2
    <718>   DW_AT_type        : <0x6e0>
 <1><71c>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <71d>   DW_AT_type        : <0x710>
 <1><721>: Abbrev Number: 24 (DW_TAG_structure_type)
    <722>   DW_AT_name        : (indirect string, offset: 0x7dcf8): __DMA_HandleTypeDef
    <726>   DW_AT_byte_size   : 96
    <727>   DW_AT_decl_file   : 8
    <728>   DW_AT_decl_line   : 138
    <729>   DW_AT_decl_column : 16
    <72a>   DW_AT_sibling     : <0x7e5>
 <2><72e>: Abbrev Number: 1 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x39c9c): Instance
    <733>   DW_AT_decl_file   : 8
    <734>   DW_AT_decl_line   : 140
    <735>   DW_AT_decl_column : 31
    <736>   DW_AT_type        : <0x7e5>
    <73a>   DW_AT_data_member_location: 0
 <2><73b>: Abbrev Number: 1 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0x9b1a5): Init
    <740>   DW_AT_decl_file   : 8
    <741>   DW_AT_decl_line   : 142
    <742>   DW_AT_decl_column : 30
    <743>   DW_AT_type        : <0x6d4>
    <747>   DW_AT_data_member_location: 4
 <2><748>: Abbrev Number: 1 (DW_TAG_member)
    <749>   DW_AT_name        : (indirect string, offset: 0x69496): Lock
    <74d>   DW_AT_decl_file   : 8
    <74e>   DW_AT_decl_line   : 144
    <74f>   DW_AT_decl_column : 30
    <750>   DW_AT_type        : <0x5cd>
    <754>   DW_AT_data_member_location: 52
 <2><755>: Abbrev Number: 1 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x9b28a): State
    <75a>   DW_AT_decl_file   : 8
    <75b>   DW_AT_decl_line   : 146
    <75c>   DW_AT_decl_column : 30
    <75d>   DW_AT_type        : <0x71c>
    <761>   DW_AT_data_member_location: 53
 <2><762>: Abbrev Number: 1 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x8c357): Parent
    <767>   DW_AT_decl_file   : 8
    <768>   DW_AT_decl_line   : 148
    <769>   DW_AT_decl_column : 31
    <76a>   DW_AT_type        : <0x7ea>
    <76e>   DW_AT_data_member_location: 56
 <2><76f>: Abbrev Number: 1 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x92858): XferCpltCallback
    <774>   DW_AT_decl_file   : 8
    <775>   DW_AT_decl_line   : 150
    <776>   DW_AT_decl_column : 33
    <777>   DW_AT_type        : <0x7fc>
    <77b>   DW_AT_data_member_location: 60
 <2><77c>: Abbrev Number: 1 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x72f86): XferHalfCpltCallback
    <781>   DW_AT_decl_file   : 8
    <782>   DW_AT_decl_line   : 152
    <783>   DW_AT_decl_column : 33
    <784>   DW_AT_type        : <0x7fc>
    <788>   DW_AT_data_member_location: 64
 <2><789>: Abbrev Number: 1 (DW_TAG_member)
    <78a>   DW_AT_name        : (indirect string, offset: 0x2476f): XferM1CpltCallback
    <78e>   DW_AT_decl_file   : 8
    <78f>   DW_AT_decl_line   : 154
    <790>   DW_AT_decl_column : 33
    <791>   DW_AT_type        : <0x7fc>
    <795>   DW_AT_data_member_location: 68
 <2><796>: Abbrev Number: 1 (DW_TAG_member)
    <797>   DW_AT_name        : (indirect string, offset: 0x51f05): XferM1HalfCpltCallback
    <79b>   DW_AT_decl_file   : 8
    <79c>   DW_AT_decl_line   : 156
    <79d>   DW_AT_decl_column : 33
    <79e>   DW_AT_type        : <0x7fc>
    <7a2>   DW_AT_data_member_location: 72
 <2><7a3>: Abbrev Number: 1 (DW_TAG_member)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x174e7): XferErrorCallback
    <7a8>   DW_AT_decl_file   : 8
    <7a9>   DW_AT_decl_line   : 158
    <7aa>   DW_AT_decl_column : 33
    <7ab>   DW_AT_type        : <0x7fc>
    <7af>   DW_AT_data_member_location: 76
 <2><7b0>: Abbrev Number: 1 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x89b9b): XferAbortCallback
    <7b5>   DW_AT_decl_file   : 8
    <7b6>   DW_AT_decl_line   : 160
    <7b7>   DW_AT_decl_column : 33
    <7b8>   DW_AT_type        : <0x7fc>
    <7bc>   DW_AT_data_member_location: 80
 <2><7bd>: Abbrev Number: 1 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0x901fb): ErrorCode
    <7c2>   DW_AT_decl_file   : 8
    <7c3>   DW_AT_decl_line   : 162
    <7c4>   DW_AT_decl_column : 30
    <7c5>   DW_AT_type        : <0x194>
    <7c9>   DW_AT_data_member_location: 84
 <2><7ca>: Abbrev Number: 1 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x6fe6c): StreamBaseAddress
    <7cf>   DW_AT_decl_file   : 8
    <7d0>   DW_AT_decl_line   : 164
    <7d1>   DW_AT_decl_column : 30
    <7d2>   DW_AT_type        : <0x188>
    <7d6>   DW_AT_data_member_location: 88
 <2><7d7>: Abbrev Number: 1 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x7c785): StreamIndex
    <7dc>   DW_AT_decl_file   : 8
    <7dd>   DW_AT_decl_line   : 166
    <7de>   DW_AT_decl_column : 30
    <7df>   DW_AT_type        : <0x188>
    <7e3>   DW_AT_data_member_location: 92
 <2><7e4>: Abbrev Number: 0
 <1><7e5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7e6>   DW_AT_byte_size   : 4
    <7e6>   DW_AT_type        : <0x326>
 <1><7ea>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <7eb>   DW_AT_byte_size   : 4
 <1><7ec>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <7ed>   DW_AT_prototyped  : 1
    <7ed>   DW_AT_sibling     : <0x7f7>
 <2><7f1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <7f2>   DW_AT_type        : <0x7f7>
 <2><7f6>: Abbrev Number: 0
 <1><7f7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7f8>   DW_AT_byte_size   : 4
    <7f8>   DW_AT_type        : <0x721>
 <1><7fc>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7fd>   DW_AT_byte_size   : 4
    <7fd>   DW_AT_type        : <0x7ec>
 <1><801>: Abbrev Number: 3 (DW_TAG_typedef)
    <802>   DW_AT_name        : (indirect string, offset: 0x7dcfa): DMA_HandleTypeDef
    <806>   DW_AT_decl_file   : 8
    <807>   DW_AT_decl_line   : 168
    <808>   DW_AT_decl_column : 2
    <809>   DW_AT_type        : <0x721>
 <1><80d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <80e>   DW_AT_byte_size   : 48
    <80f>   DW_AT_decl_file   : 9
    <810>   DW_AT_decl_line   : 59
    <811>   DW_AT_decl_column : 9
    <811>   DW_AT_sibling     : <0x8b2>
 <2><815>: Abbrev Number: 1 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x82914): ClockPrescaler
    <81a>   DW_AT_decl_file   : 9
    <81b>   DW_AT_decl_line   : 61
    <81c>   DW_AT_decl_column : 12
    <81d>   DW_AT_type        : <0x188>
    <821>   DW_AT_data_member_location: 0
 <2><822>: Abbrev Number: 1 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0xe463): Resolution
    <827>   DW_AT_decl_file   : 9
    <828>   DW_AT_decl_line   : 64
    <829>   DW_AT_decl_column : 12
    <82a>   DW_AT_type        : <0x188>
    <82e>   DW_AT_data_member_location: 4
 <2><82f>: Abbrev Number: 1 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x2188a): DataAlign
    <834>   DW_AT_decl_file   : 9
    <835>   DW_AT_decl_line   : 66
    <836>   DW_AT_decl_column : 12
    <837>   DW_AT_type        : <0x188>
    <83b>   DW_AT_data_member_location: 8
 <2><83c>: Abbrev Number: 1 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0x58c8b): ScanConvMode
    <841>   DW_AT_decl_file   : 9
    <842>   DW_AT_decl_line   : 69
    <843>   DW_AT_decl_column : 12
    <844>   DW_AT_type        : <0x188>
    <848>   DW_AT_data_member_location: 12
 <2><849>: Abbrev Number: 1 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x62226): EOCSelection
    <84e>   DW_AT_decl_file   : 9
    <84f>   DW_AT_decl_line   : 76
    <850>   DW_AT_decl_column : 12
    <851>   DW_AT_type        : <0x188>
    <855>   DW_AT_data_member_location: 16
 <2><856>: Abbrev Number: 1 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x3dea3): ContinuousConvMode
    <85b>   DW_AT_decl_file   : 9
    <85c>   DW_AT_decl_line   : 83
    <85d>   DW_AT_decl_column : 19
    <85e>   DW_AT_type        : <0x572>
    <862>   DW_AT_data_member_location: 20
 <2><863>: Abbrev Number: 1 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x58590): NbrOfConversion
    <868>   DW_AT_decl_file   : 9
    <869>   DW_AT_decl_line   : 86
    <86a>   DW_AT_decl_column : 12
    <86b>   DW_AT_type        : <0x188>
    <86f>   DW_AT_data_member_location: 24
 <2><870>: Abbrev Number: 1 (DW_TAG_member)
    <871>   DW_AT_name        : (indirect string, offset: 0x38eeb): DiscontinuousConvMode
    <875>   DW_AT_decl_file   : 9
    <876>   DW_AT_decl_line   : 89
    <877>   DW_AT_decl_column : 19
    <878>   DW_AT_type        : <0x572>
    <87c>   DW_AT_data_member_location: 28
 <2><87d>: Abbrev Number: 1 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x1739b): NbrOfDiscConversion
    <882>   DW_AT_decl_file   : 9
    <883>   DW_AT_decl_line   : 93
    <884>   DW_AT_decl_column : 12
    <885>   DW_AT_type        : <0x188>
    <889>   DW_AT_data_member_location: 32
 <2><88a>: Abbrev Number: 1 (DW_TAG_member)
    <88b>   DW_AT_name        : (indirect string, offset: 0x6a96a): ExternalTrigConv
    <88f>   DW_AT_decl_file   : 9
    <890>   DW_AT_decl_line   : 96
    <891>   DW_AT_decl_column : 12
    <892>   DW_AT_type        : <0x188>
    <896>   DW_AT_data_member_location: 36
 <2><897>: Abbrev Number: 1 (DW_TAG_member)
    <898>   DW_AT_name        : (indirect string, offset: 0x298c0): ExternalTrigConvEdge
    <89c>   DW_AT_decl_file   : 9
    <89d>   DW_AT_decl_line   : 100
    <89e>   DW_AT_decl_column : 12
    <89f>   DW_AT_type        : <0x188>
    <8a3>   DW_AT_data_member_location: 40
 <2><8a4>: Abbrev Number: 1 (DW_TAG_member)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x3aefe): DMAContinuousRequests
    <8a9>   DW_AT_decl_file   : 9
    <8aa>   DW_AT_decl_line   : 103
    <8ab>   DW_AT_decl_column : 19
    <8ac>   DW_AT_type        : <0x572>
    <8b0>   DW_AT_data_member_location: 44
 <2><8b1>: Abbrev Number: 0
 <1><8b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x23dde): ADC_InitTypeDef
    <8b7>   DW_AT_decl_file   : 9
    <8b8>   DW_AT_decl_line   : 108
    <8b9>   DW_AT_decl_column : 3
    <8ba>   DW_AT_type        : <0x80d>
 <1><8be>: Abbrev Number: 9 (DW_TAG_structure_type)
    <8bf>   DW_AT_byte_size   : 16
    <8c0>   DW_AT_decl_file   : 9
    <8c1>   DW_AT_decl_line   : 117
    <8c2>   DW_AT_decl_column : 9
    <8c2>   DW_AT_sibling     : <0x8fb>
 <2><8c6>: Abbrev Number: 1 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x973be): Channel
    <8cb>   DW_AT_decl_file   : 9
    <8cc>   DW_AT_decl_line   : 119
    <8cd>   DW_AT_decl_column : 12
    <8ce>   DW_AT_type        : <0x188>
    <8d2>   DW_AT_data_member_location: 0
 <2><8d3>: Abbrev Number: 1 (DW_TAG_member)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x2759c): Rank
    <8d8>   DW_AT_decl_file   : 9
    <8d9>   DW_AT_decl_line   : 121
    <8da>   DW_AT_decl_column : 12
    <8db>   DW_AT_type        : <0x188>
    <8df>   DW_AT_data_member_location: 4
 <2><8e0>: Abbrev Number: 1 (DW_TAG_member)
    <8e1>   DW_AT_name        : (indirect string, offset: 0x6060): SamplingTime
    <8e5>   DW_AT_decl_file   : 9
    <8e6>   DW_AT_decl_line   : 123
    <8e7>   DW_AT_decl_column : 12
    <8e8>   DW_AT_type        : <0x188>
    <8ec>   DW_AT_data_member_location: 8
 <2><8ed>: Abbrev Number: 1 (DW_TAG_member)
    <8ee>   DW_AT_name        : (indirect string, offset: 0x9c997): Offset
    <8f2>   DW_AT_decl_file   : 9
    <8f3>   DW_AT_decl_line   : 132
    <8f4>   DW_AT_decl_column : 12
    <8f5>   DW_AT_type        : <0x188>
    <8f9>   DW_AT_data_member_location: 12
 <2><8fa>: Abbrev Number: 0
 <1><8fb>: Abbrev Number: 3 (DW_TAG_typedef)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x92a8d): ADC_ChannelConfTypeDef
    <900>   DW_AT_decl_file   : 9
    <901>   DW_AT_decl_line   : 133
    <902>   DW_AT_decl_column : 3
    <903>   DW_AT_type        : <0x8be>
 <1><907>: Abbrev Number: 9 (DW_TAG_structure_type)
    <908>   DW_AT_byte_size   : 72
    <909>   DW_AT_decl_file   : 9
    <90a>   DW_AT_decl_line   : 195
    <90b>   DW_AT_decl_column : 9
    <90b>   DW_AT_sibling     : <0x96b>
 <2><90f>: Abbrev Number: 1 (DW_TAG_member)
    <910>   DW_AT_name        : (indirect string, offset: 0x39c9c): Instance
    <914>   DW_AT_decl_file   : 9
    <915>   DW_AT_decl_line   : 198
    <916>   DW_AT_decl_column : 34
    <917>   DW_AT_type        : <0x96b>
    <91b>   DW_AT_data_member_location: 0
 <2><91c>: Abbrev Number: 1 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0x9b1a5): Init
    <921>   DW_AT_decl_file   : 9
    <922>   DW_AT_decl_line   : 200
    <923>   DW_AT_decl_column : 33
    <924>   DW_AT_type        : <0x8b2>
    <928>   DW_AT_data_member_location: 4
 <2><929>: Abbrev Number: 1 (DW_TAG_member)
    <92a>   DW_AT_name        : (indirect string, offset: 0x27586): NbrOfCurrentConversionRank
    <92e>   DW_AT_decl_file   : 9
    <92f>   DW_AT_decl_line   : 202
    <930>   DW_AT_decl_column : 33
    <931>   DW_AT_type        : <0x194>
    <935>   DW_AT_data_member_location: 52
 <2><936>: Abbrev Number: 1 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x473d): DMA_Handle
    <93b>   DW_AT_decl_file   : 9
    <93c>   DW_AT_decl_line   : 204
    <93d>   DW_AT_decl_column : 34
    <93e>   DW_AT_type        : <0x970>
    <942>   DW_AT_data_member_location: 56
 <2><943>: Abbrev Number: 1 (DW_TAG_member)
    <944>   DW_AT_name        : (indirect string, offset: 0x69496): Lock
    <948>   DW_AT_decl_file   : 9
    <949>   DW_AT_decl_line   : 206
    <94a>   DW_AT_decl_column : 33
    <94b>   DW_AT_type        : <0x5cd>
    <94f>   DW_AT_data_member_location: 60
 <2><950>: Abbrev Number: 1 (DW_TAG_member)
    <951>   DW_AT_name        : (indirect string, offset: 0x9b28a): State
    <955>   DW_AT_decl_file   : 9
    <956>   DW_AT_decl_line   : 208
    <957>   DW_AT_decl_column : 33
    <958>   DW_AT_type        : <0x194>
    <95c>   DW_AT_data_member_location: 64
 <2><95d>: Abbrev Number: 1 (DW_TAG_member)
    <95e>   DW_AT_name        : (indirect string, offset: 0x901fb): ErrorCode
    <962>   DW_AT_decl_file   : 9
    <963>   DW_AT_decl_line   : 210
    <964>   DW_AT_decl_column : 33
    <965>   DW_AT_type        : <0x194>
    <969>   DW_AT_data_member_location: 68
 <2><96a>: Abbrev Number: 0
 <1><96b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <96c>   DW_AT_byte_size   : 4
    <96c>   DW_AT_type        : <0x2c4>
 <1><970>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <971>   DW_AT_byte_size   : 4
    <971>   DW_AT_type        : <0x801>
 <1><975>: Abbrev Number: 3 (DW_TAG_typedef)
    <976>   DW_AT_name        : (indirect string, offset: 0x1f068): ADC_HandleTypeDef
    <97a>   DW_AT_decl_file   : 9
    <97b>   DW_AT_decl_line   : 220
    <97c>   DW_AT_decl_column : 3
    <97d>   DW_AT_type        : <0x907>
 <1><981>: Abbrev Number: 27 (DW_TAG_variable)
    <982>   DW_AT_name        : (indirect string, offset: 0x3c60b): hadc1
    <986>   DW_AT_decl_file   : 10
    <987>   DW_AT_decl_line   : 35
    <988>   DW_AT_decl_column : 26
    <989>   DW_AT_type        : <0x975>
    <98d>   DW_AT_external    : 1
    <98d>   DW_AT_declaration : 1
 <1><98d>: Abbrev Number: 28 (DW_TAG_variable)
    <98e>   DW_AT_specification: <0x981>
    <992>   DW_AT_decl_file   : 1
    <993>   DW_AT_decl_line   : 27
    <994>   DW_AT_decl_column : 19
    <995>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><99b>: Abbrev Number: 29 (DW_TAG_variable)
    <99c>   DW_AT_name        : (indirect string, offset: 0xa2ab): hdma_adc1
    <9a0>   DW_AT_decl_file   : 1
    <9a1>   DW_AT_decl_line   : 28
    <9a2>   DW_AT_decl_column : 19
    <9a3>   DW_AT_type        : <0x801>
    <9a7>   DW_AT_external    : 1
    <9a7>   DW_AT_location    : 5 byte block: 3 c4 0 0 20 	(DW_OP_addr: 200000c4)
 <1><9ad>: Abbrev Number: 12 (DW_TAG_subprogram)
    <9ae>   DW_AT_external    : 1
    <9ae>   DW_AT_name        : (indirect string, offset: 0x1b55d): HAL_DMA_DeInit
    <9b2>   DW_AT_decl_file   : 8
    <9b3>   DW_AT_decl_line   : 653
    <9b5>   DW_AT_decl_column : 19
    <9b5>   DW_AT_prototyped  : 1
    <9b5>   DW_AT_type        : <0x5a9>
    <9b9>   DW_AT_declaration : 1
    <9b9>   DW_AT_sibling     : <0x9c3>
 <2><9bd>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <9be>   DW_AT_type        : <0x970>
 <2><9c2>: Abbrev Number: 0
 <1><9c3>: Abbrev Number: 19 (DW_TAG_subprogram)
    <9c4>   DW_AT_external    : 1
    <9c4>   DW_AT_name        : (indirect string, offset: 0x80735): HAL_GPIO_DeInit
    <9c8>   DW_AT_decl_file   : 7
    <9c8>   DW_AT_decl_line   : 225
    <9c9>   DW_AT_decl_column : 7
    <9c9>   DW_AT_prototyped  : 1
    <9c9>   DW_AT_declaration : 1
    <9c9>   DW_AT_sibling     : <0x9d8>
 <2><9cd>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <9ce>   DW_AT_type        : <0x9d8>
 <2><9d2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <9d3>   DW_AT_type        : <0x188>
 <2><9d7>: Abbrev Number: 0
 <1><9d8>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <9d9>   DW_AT_byte_size   : 4
    <9d9>   DW_AT_type        : <0x3bc>
 <1><9dd>: Abbrev Number: 12 (DW_TAG_subprogram)
    <9de>   DW_AT_external    : 1
    <9de>   DW_AT_name        : (indirect string, offset: 0x883f9): HAL_DMA_Init
    <9e2>   DW_AT_decl_file   : 8
    <9e3>   DW_AT_decl_line   : 652
    <9e5>   DW_AT_decl_column : 19
    <9e5>   DW_AT_prototyped  : 1
    <9e5>   DW_AT_type        : <0x5a9>
    <9e9>   DW_AT_declaration : 1
    <9e9>   DW_AT_sibling     : <0x9f3>
 <2><9ed>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <9ee>   DW_AT_type        : <0x970>
 <2><9f2>: Abbrev Number: 0
 <1><9f3>: Abbrev Number: 19 (DW_TAG_subprogram)
    <9f4>   DW_AT_external    : 1
    <9f4>   DW_AT_name        : (indirect string, offset: 0x5a85f): HAL_GPIO_Init
    <9f8>   DW_AT_decl_file   : 7
    <9f8>   DW_AT_decl_line   : 224
    <9f9>   DW_AT_decl_column : 7
    <9f9>   DW_AT_prototyped  : 1
    <9f9>   DW_AT_declaration : 1
    <9f9>   DW_AT_sibling     : <0xa08>
 <2><9fd>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <9fe>   DW_AT_type        : <0x9d8>
 <2><a02>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <a03>   DW_AT_type        : <0xa08>
 <2><a07>: Abbrev Number: 0
 <1><a08>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a09>   DW_AT_byte_size   : 4
    <a09>   DW_AT_type        : <0x623>
 <1><a0d>: Abbrev Number: 12 (DW_TAG_subprogram)
    <a0e>   DW_AT_external    : 1
    <a0e>   DW_AT_name        : (indirect string, offset: 0x2bef4): HAL_ADC_ConfigChannel
    <a12>   DW_AT_decl_file   : 9
    <a13>   DW_AT_decl_line   : 611
    <a15>   DW_AT_decl_column : 19
    <a15>   DW_AT_prototyped  : 1
    <a15>   DW_AT_type        : <0x5a9>
    <a19>   DW_AT_declaration : 1
    <a19>   DW_AT_sibling     : <0xa28>
 <2><a1d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <a1e>   DW_AT_type        : <0xa28>
 <2><a22>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <a23>   DW_AT_type        : <0xa2d>
 <2><a27>: Abbrev Number: 0
 <1><a28>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a29>   DW_AT_byte_size   : 4
    <a29>   DW_AT_type        : <0x975>
 <1><a2d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a2e>   DW_AT_byte_size   : 4
    <a2e>   DW_AT_type        : <0x8fb>
 <1><a32>: Abbrev Number: 30 (DW_TAG_subprogram)
    <a33>   DW_AT_external    : 1
    <a33>   DW_AT_name        : (indirect string, offset: 0x41431): Error_Handler
    <a37>   DW_AT_decl_file   : 11
    <a38>   DW_AT_decl_line   : 53
    <a39>   DW_AT_decl_column : 6
    <a3a>   DW_AT_prototyped  : 1
    <a3a>   DW_AT_declaration : 1
 <1><a3a>: Abbrev Number: 12 (DW_TAG_subprogram)
    <a3b>   DW_AT_external    : 1
    <a3b>   DW_AT_name        : (indirect string, offset: 0xe7c1): HAL_ADC_Init
    <a3f>   DW_AT_decl_file   : 9
    <a40>   DW_AT_decl_line   : 565
    <a42>   DW_AT_decl_column : 19
    <a42>   DW_AT_prototyped  : 1
    <a42>   DW_AT_type        : <0x5a9>
    <a46>   DW_AT_declaration : 1
    <a46>   DW_AT_sibling     : <0xa50>
 <2><a4a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <a4b>   DW_AT_type        : <0xa28>
 <2><a4f>: Abbrev Number: 0
 <1><a50>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a51>   DW_AT_external    : 1
    <a51>   DW_AT_name        : (indirect string, offset: 0xa743): HAL_ADC_MspDeInit
    <a55>   DW_AT_decl_file   : 1
    <a55>   DW_AT_decl_line   : 154
    <a56>   DW_AT_decl_column : 6
    <a56>   DW_AT_prototyped  : 1
    <a56>   DW_AT_low_pc      : 0
    <a5a>   DW_AT_high_pc     : 0x44
    <a5e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a60>   DW_AT_call_all_tail_calls: 1
    <a60>   DW_AT_sibling     : <0xa73>
 <2><a64>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <a65>   DW_AT_name        : (indirect string, offset: 0x501cf): adcHandle
    <a69>   DW_AT_decl_file   : 1
    <a69>   DW_AT_decl_line   : 154
    <a6a>   DW_AT_decl_column : 43
    <a6b>   DW_AT_type        : <0xa28>
    <a6f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a72>: Abbrev Number: 0
 <1><a73>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a74>   DW_AT_external    : 1
    <a74>   DW_AT_name        : (indirect string, offset: 0x14365): HAL_ADC_MspInit
    <a78>   DW_AT_decl_file   : 1
    <a78>   DW_AT_decl_line   : 105
    <a79>   DW_AT_decl_column : 6
    <a79>   DW_AT_prototyped  : 1
    <a79>   DW_AT_low_pc      : 0x8000600
    <a7d>   DW_AT_high_pc     : 0xf0
    <a81>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a83>   DW_AT_call_all_tail_calls: 1
    <a83>   DW_AT_sibling     : <0xad8>
 <2><a87>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <a88>   DW_AT_name        : (indirect string, offset: 0x501cf): adcHandle
    <a8c>   DW_AT_decl_file   : 1
    <a8c>   DW_AT_decl_line   : 105
    <a8d>   DW_AT_decl_column : 41
    <a8e>   DW_AT_type        : <0xa28>
    <a92>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><a95>: Abbrev Number: 13 (DW_TAG_variable)
    <a96>   DW_AT_name        : (indirect string, offset: 0x103ac): GPIO_InitStruct
    <a9a>   DW_AT_decl_file   : 1
    <a9a>   DW_AT_decl_line   : 108
    <a9b>   DW_AT_decl_column : 20
    <a9c>   DW_AT_type        : <0x623>
    <aa0>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><aa3>: Abbrev Number: 31 (DW_TAG_lexical_block)
    <aa4>   DW_AT_low_pc      : 0x8000622
    <aa8>   DW_AT_high_pc     : 0x1c
    <aac>   DW_AT_sibling     : <0xabf>
 <3><ab0>: Abbrev Number: 13 (DW_TAG_variable)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x425f): tmpreg
    <ab5>   DW_AT_decl_file   : 1
    <ab5>   DW_AT_decl_line   : 115
    <ab6>   DW_AT_decl_column : 5
    <ab7>   DW_AT_type        : <0x194>
    <abb>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><abe>: Abbrev Number: 0
 <2><abf>: Abbrev Number: 32 (DW_TAG_lexical_block)
    <ac0>   DW_AT_low_pc      : 0x800063e
    <ac4>   DW_AT_high_pc     : 0x1c
 <3><ac8>: Abbrev Number: 13 (DW_TAG_variable)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x425f): tmpreg
    <acd>   DW_AT_decl_file   : 1
    <acd>   DW_AT_decl_line   : 117
    <ace>   DW_AT_decl_column : 5
    <acf>   DW_AT_type        : <0x194>
    <ad3>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><ad6>: Abbrev Number: 0
 <2><ad7>: Abbrev Number: 0
 <1><ad8>: Abbrev Number: 33 (DW_TAG_subprogram)
    <ad9>   DW_AT_external    : 1
    <ad9>   DW_AT_name        : (indirect string, offset: 0x5b07d): MX_ADC1_Init
    <add>   DW_AT_decl_file   : 1
    <ade>   DW_AT_decl_line   : 31
    <adf>   DW_AT_decl_column : 6
    <ae0>   DW_AT_prototyped  : 1
    <ae0>   DW_AT_low_pc      : 0x8000508
    <ae4>   DW_AT_high_pc     : 0xf8
    <ae8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aea>   DW_AT_call_all_tail_calls: 1
 <2><aea>: Abbrev Number: 13 (DW_TAG_variable)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x8c7e3): sConfig
    <aef>   DW_AT_decl_file   : 1
    <aef>   DW_AT_decl_line   : 38
    <af0>   DW_AT_decl_column : 26
    <af1>   DW_AT_type        : <0x8fb>
    <af5>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><af8>: Abbrev Number: 0
 <1><af9>: Abbrev Number: 0
  Compilation Unit @ offset 0xafa:
   Length:        0x43b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2c0
   Pointer Size:  4
 <0><b06>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <b07>   DW_AT_producer    : (indirect string, offset: 0x116): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b0b>   DW_AT_language    : 29	(C11)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x93b70): ../Core/Src/dma.c
    <b10>   DW_AT_comp_dir    : (indirect string, offset: 0x2c24): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <b14>   DW_AT_ranges      : 0x79
    <b18>   DW_AT_low_pc      : 0
    <b1c>   DW_AT_stmt_list   : 0x95d
    <b20>   DW_AT_macros      : 0x1559e
 <1><b24>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <b25>   DW_AT_encoding    : 5	(signed)
    <b26>   DW_AT_byte_size   : 1
    <b27>   DW_AT_type        : <0xcb3>
    <b2b>   DW_AT_decl_file   : 2
    <b2c>   DW_AT_decl_line   : 66
    <b2d>   DW_AT_decl_column : 1
    <b2e>   DW_AT_sibling     : <0xcb3>
 <2><b32>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b33>   DW_AT_name        : (indirect string, offset: 0x93eb7): NonMaskableInt_IRQn
    <b37>   DW_AT_const_value : -14
 <2><b38>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b39>   DW_AT_name        : (indirect string, offset: 0x93da5): MemoryManagement_IRQn
    <b3d>   DW_AT_const_value : -12
 <2><b3e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x93e26): BusFault_IRQn
    <b43>   DW_AT_const_value : -11
 <2><b44>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b45>   DW_AT_name        : (indirect string, offset: 0x93ea7): UsageFault_IRQn
    <b49>   DW_AT_const_value : -10
 <2><b4a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x93b4e): SVCall_IRQn
    <b4f>   DW_AT_const_value : -5
 <2><b50>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b51>   DW_AT_name        : (indirect string, offset: 0x93d09): DebugMonitor_IRQn
    <b55>   DW_AT_const_value : -4
 <2><b56>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b57>   DW_AT_name        : (indirect string, offset: 0x93d41): PendSV_IRQn
    <b5b>   DW_AT_const_value : -2
 <2><b5c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x93e40): SysTick_IRQn
    <b61>   DW_AT_const_value : -1
 <2><b62>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b63>   DW_AT_name        : (indirect string, offset: 0x93dd7): WWDG_IRQn
    <b67>   DW_AT_const_value : 0
 <2><b68>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b69>   DW_AT_name        : (indirect string, offset: 0x93be5): PVD_IRQn
    <b6d>   DW_AT_const_value : 1
 <2><b6e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x93eed): TAMP_STAMP_IRQn
    <b73>   DW_AT_const_value : 2
 <2><b74>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b75>   DW_AT_name        : (indirect string, offset: 0x93d78): RTC_WKUP_IRQn
    <b79>   DW_AT_const_value : 3
 <2><b7a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x93c1e): FLASH_IRQn
    <b7f>   DW_AT_const_value : 4
 <2><b80>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b81>   DW_AT_name        : (indirect string, offset: 0x93e1d): RCC_IRQn
    <b85>   DW_AT_const_value : 5
 <2><b86>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b87>   DW_AT_name        : (indirect string, offset: 0x93d1b): EXTI0_IRQn
    <b8b>   DW_AT_const_value : 6
 <2><b8c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x93ee2): EXTI1_IRQn
    <b91>   DW_AT_const_value : 7
 <2><b92>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b93>   DW_AT_name        : (indirect string, offset: 0x93cfe): EXTI2_IRQn
    <b97>   DW_AT_const_value : 8
 <2><b98>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b99>   DW_AT_name        : (indirect string, offset: 0x93e4d): EXTI3_IRQn
    <b9d>   DW_AT_const_value : 9
 <2><b9e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x93c35): EXTI4_IRQn
    <ba3>   DW_AT_const_value : 10
 <2><ba4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x93bc0): DMA1_Stream0_IRQn
    <ba9>   DW_AT_const_value : 11
 <2><baa>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bab>   DW_AT_name        : (indirect string, offset: 0x93efd): DMA1_Stream1_IRQn
    <baf>   DW_AT_const_value : 12
 <2><bb0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x93cc6): DMA1_Stream2_IRQn
    <bb5>   DW_AT_const_value : 13
 <2><bb6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x93c64): DMA1_Stream3_IRQn
    <bbb>   DW_AT_const_value : 14
 <2><bbc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x93c40): DMA1_Stream4_IRQn
    <bc1>   DW_AT_const_value : 15
 <2><bc2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x93df9): DMA1_Stream5_IRQn
    <bc7>   DW_AT_const_value : 16
 <2><bc8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x93bfb): DMA1_Stream6_IRQn
    <bcd>   DW_AT_const_value : 17
 <2><bce>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x93d26): ADC_IRQn
    <bd3>   DW_AT_const_value : 18
 <2><bd4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x93b5a): EXTI9_5_IRQn
    <bd9>   DW_AT_const_value : 23
 <2><bda>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x93cb3): TIM1_BRK_TIM9_IRQn
    <bdf>   DW_AT_const_value : 24
 <2><be0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <be1>   DW_AT_name        : (indirect string, offset: 0x93d59): TIM1_UP_TIM10_IRQn
    <be5>   DW_AT_const_value : 25
 <2><be6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <be7>   DW_AT_name        : (indirect string, offset: 0x93de1): TIM1_TRG_COM_TIM11_IRQn
    <beb>   DW_AT_const_value : 26
 <2><bec>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bed>   DW_AT_name        : (indirect string, offset: 0x93c76): TIM1_CC_IRQn
    <bf1>   DW_AT_const_value : 27
 <2><bf2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x93ba4): TIM2_IRQn
    <bf7>   DW_AT_const_value : 28
 <2><bf8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x93ed8): TIM3_IRQn
    <bfd>   DW_AT_const_value : 29
 <2><bfe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bff>   DW_AT_name        : (indirect string, offset: 0x93c83): TIM4_IRQn
    <c03>   DW_AT_const_value : 30
 <2><c04>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c05>   DW_AT_name        : (indirect string, offset: 0x93c8d): I2C1_EV_IRQn
    <c09>   DW_AT_const_value : 31
 <2><c0a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x93d98): I2C1_ER_IRQn
    <c0f>   DW_AT_const_value : 32
 <2><c10>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c11>   DW_AT_name        : (indirect string, offset: 0x93b8d): I2C2_EV_IRQn
    <c15>   DW_AT_const_value : 33
 <2><c16>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c17>   DW_AT_name        : (indirect string, offset: 0x93c9a): I2C2_ER_IRQn
    <c1b>   DW_AT_const_value : 34
 <2><c1c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c1d>   DW_AT_name        : (indirect string, offset: 0x93b9a): SPI1_IRQn
    <c21>   DW_AT_const_value : 35
 <2><c22>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c23>   DW_AT_name        : (indirect string, offset: 0x93dcd): SPI2_IRQn
    <c27>   DW_AT_const_value : 36
 <2><c28>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c29>   DW_AT_name        : (indirect string, offset: 0x93e34): USART1_IRQn
    <c2d>   DW_AT_const_value : 37
 <2><c2e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x93c29): USART2_IRQn
    <c33>   DW_AT_const_value : 38
 <2><c34>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c35>   DW_AT_name        : (indirect string, offset: 0x93e6d): EXTI15_10_IRQn
    <c39>   DW_AT_const_value : 40
 <2><c3a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c3b>   DW_AT_name        : (indirect string, offset: 0x93e7c): RTC_Alarm_IRQn
    <c3f>   DW_AT_const_value : 41
 <2><c40>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c41>   DW_AT_name        : (indirect string, offset: 0x93c0d): OTG_FS_WKUP_IRQn
    <c45>   DW_AT_const_value : 42
 <2><c46>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c47>   DW_AT_name        : (indirect string, offset: 0x93d86): DMA1_Stream7_IRQn
    <c4b>   DW_AT_const_value : 47
 <2><c4c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x331d6): SDIO_IRQn
    <c51>   DW_AT_const_value : 49
 <2><c52>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c53>   DW_AT_name        : (indirect string, offset: 0x93ce2): TIM5_IRQn
    <c57>   DW_AT_const_value : 50
 <2><c58>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c59>   DW_AT_name        : (indirect string, offset: 0x93f0f): SPI3_IRQn
    <c5d>   DW_AT_const_value : 51
 <2><c5e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x93dbb): DMA2_Stream0_IRQn
    <c63>   DW_AT_const_value : 56
 <2><c64>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c65>   DW_AT_name        : (indirect string, offset: 0x93bae): DMA2_Stream1_IRQn
    <c69>   DW_AT_const_value : 57
 <2><c6a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c6b>   DW_AT_name        : (indirect string, offset: 0x93d2f): DMA2_Stream2_IRQn
    <c6f>   DW_AT_const_value : 58
 <2><c70>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c71>   DW_AT_name        : (indirect string, offset: 0x93f19): DMA2_Stream3_IRQn
    <c75>   DW_AT_const_value : 59
 <2><c76>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c77>   DW_AT_name        : (indirect string, offset: 0x93cec): DMA2_Stream4_IRQn
    <c7b>   DW_AT_const_value : 60
 <2><c7c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x93d4d): OTG_FS_IRQn
    <c81>   DW_AT_const_value : 67
 <2><c82>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c83>   DW_AT_name        : (indirect string, offset: 0x93e8b): DMA2_Stream5_IRQn
    <c87>   DW_AT_const_value : 68
 <2><c88>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c89>   DW_AT_name        : (indirect string, offset: 0x93c52): DMA2_Stream6_IRQn
    <c8d>   DW_AT_const_value : 69
 <2><c8e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x93e0b): DMA2_Stream7_IRQn
    <c93>   DW_AT_const_value : 70
 <2><c94>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c95>   DW_AT_name        : (indirect string, offset: 0x93ca7): USART6_IRQn
    <c99>   DW_AT_const_value : 71
 <2><c9a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x93ecb): I2C3_EV_IRQn
    <c9f>   DW_AT_const_value : 72
 <2><ca0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x93bee): I2C3_ER_IRQn
    <ca5>   DW_AT_const_value : 73
 <2><ca6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x93b67): FPU_IRQn
    <cab>   DW_AT_const_value : 81
 <2><cac>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cad>   DW_AT_name        : (indirect string, offset: 0x93cd8): SPI4_IRQn
    <cb1>   DW_AT_const_value : 84
 <2><cb2>: Abbrev Number: 0
 <1><cb3>: Abbrev Number: 3 (DW_TAG_base_type)
    <cb4>   DW_AT_byte_size   : 1
    <cb5>   DW_AT_encoding    : 6	(signed char)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x2107): signed char
 <1><cba>: Abbrev Number: 6 (DW_TAG_typedef)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x93e9d): IRQn_Type
    <cbf>   DW_AT_decl_file   : 2
    <cc0>   DW_AT_decl_line   : 133
    <cc1>   DW_AT_decl_column : 3
    <cc2>   DW_AT_type        : <0xb24>
 <1><cc6>: Abbrev Number: 3 (DW_TAG_base_type)
    <cc7>   DW_AT_byte_size   : 1
    <cc8>   DW_AT_encoding    : 8	(unsigned char)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x223c): unsigned char
 <1><ccd>: Abbrev Number: 3 (DW_TAG_base_type)
    <cce>   DW_AT_byte_size   : 2
    <ccf>   DW_AT_encoding    : 5	(signed)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x599): short int
 <1><cd4>: Abbrev Number: 3 (DW_TAG_base_type)
    <cd5>   DW_AT_byte_size   : 2
    <cd6>   DW_AT_encoding    : 7	(unsigned)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x2595): short unsigned int
 <1><cdb>: Abbrev Number: 3 (DW_TAG_base_type)
    <cdc>   DW_AT_byte_size   : 4
    <cdd>   DW_AT_encoding    : 5	(signed)
    <cde>   DW_AT_name        : (indirect string, offset: 0x1f99): long int
 <1><ce2>: Abbrev Number: 6 (DW_TAG_typedef)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x5dd5b): __uint32_t
    <ce7>   DW_AT_decl_file   : 3
    <ce8>   DW_AT_decl_line   : 79
    <ce9>   DW_AT_decl_column : 25
    <cea>   DW_AT_type        : <0xcee>
 <1><cee>: Abbrev Number: 3 (DW_TAG_base_type)
    <cef>   DW_AT_byte_size   : 4
    <cf0>   DW_AT_encoding    : 7	(unsigned)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x1d66): long unsigned int
 <1><cf5>: Abbrev Number: 3 (DW_TAG_base_type)
    <cf6>   DW_AT_byte_size   : 8
    <cf7>   DW_AT_encoding    : 5	(signed)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x126b): long long int
 <1><cfc>: Abbrev Number: 3 (DW_TAG_base_type)
    <cfd>   DW_AT_byte_size   : 8
    <cfe>   DW_AT_encoding    : 7	(unsigned)
    <cff>   DW_AT_name        : (indirect string, offset: 0x29a6): long long unsigned int
 <1><d03>: Abbrev Number: 13 (DW_TAG_base_type)
    <d04>   DW_AT_byte_size   : 4
    <d05>   DW_AT_encoding    : 5	(signed)
    <d06>   DW_AT_name        : int
 <1><d0a>: Abbrev Number: 3 (DW_TAG_base_type)
    <d0b>   DW_AT_byte_size   : 4
    <d0c>   DW_AT_encoding    : 7	(unsigned)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x1ff9): unsigned int
 <1><d11>: Abbrev Number: 6 (DW_TAG_typedef)
    <d12>   DW_AT_name        : (indirect string, offset: 0x98c5f): uint32_t
    <d16>   DW_AT_decl_file   : 4
    <d17>   DW_AT_decl_line   : 48
    <d18>   DW_AT_decl_column : 20
    <d19>   DW_AT_type        : <0xce2>
 <1><d1d>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <d1e>   DW_AT_type        : <0xd11>
 <1><d22>: Abbrev Number: 8 (DW_TAG_array_type)
    <d23>   DW_AT_type        : <0xd11>
    <d27>   DW_AT_sibling     : <0xd32>
 <2><d2b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <d2c>   DW_AT_type        : <0xd0a>
    <d30>   DW_AT_upper_bound : 0
 <2><d31>: Abbrev Number: 0
 <1><d32>: Abbrev Number: 8 (DW_TAG_array_type)
    <d33>   DW_AT_type        : <0xd11>
    <d37>   DW_AT_sibling     : <0xd42>
 <2><d3b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <d3c>   DW_AT_type        : <0xd0a>
    <d40>   DW_AT_upper_bound : 1
 <2><d41>: Abbrev Number: 0
 <1><d42>: Abbrev Number: 15 (DW_TAG_structure_type)
    <d43>   DW_AT_byte_size   : 144
    <d44>   DW_AT_decl_file   : 2
    <d45>   DW_AT_decl_line   : 335
    <d47>   DW_AT_decl_column : 9
    <d48>   DW_AT_sibling     : <0xecc>
 <2><d4c>: Abbrev Number: 7 (DW_TAG_member)
    <d4d>   DW_AT_name        : CR
    <d50>   DW_AT_decl_file   : 2
    <d50>   DW_AT_decl_line   : 337
    <d52>   DW_AT_decl_column : 17
    <d52>   DW_AT_type        : <0xd1d>
    <d56>   DW_AT_data_member_location: 0
 <2><d57>: Abbrev Number: 2 (DW_TAG_member)
    <d58>   DW_AT_name        : (indirect string, offset: 0x6724a): PLLCFGR
    <d5c>   DW_AT_decl_file   : 2
    <d5c>   DW_AT_decl_line   : 338
    <d5e>   DW_AT_decl_column : 17
    <d5e>   DW_AT_type        : <0xd1d>
    <d62>   DW_AT_data_member_location: 4
 <2><d63>: Abbrev Number: 2 (DW_TAG_member)
    <d64>   DW_AT_name        : (indirect string, offset: 0x403fd): CFGR
    <d68>   DW_AT_decl_file   : 2
    <d68>   DW_AT_decl_line   : 339
    <d6a>   DW_AT_decl_column : 17
    <d6a>   DW_AT_type        : <0xd1d>
    <d6e>   DW_AT_data_member_location: 8
 <2><d6f>: Abbrev Number: 7 (DW_TAG_member)
    <d70>   DW_AT_name        : CIR
    <d74>   DW_AT_decl_file   : 2
    <d74>   DW_AT_decl_line   : 340
    <d76>   DW_AT_decl_column : 17
    <d76>   DW_AT_type        : <0xd1d>
    <d7a>   DW_AT_data_member_location: 12
 <2><d7b>: Abbrev Number: 2 (DW_TAG_member)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x760e6): AHB1RSTR
    <d80>   DW_AT_decl_file   : 2
    <d80>   DW_AT_decl_line   : 341
    <d82>   DW_AT_decl_column : 17
    <d82>   DW_AT_type        : <0xd1d>
    <d86>   DW_AT_data_member_location: 16
 <2><d87>: Abbrev Number: 2 (DW_TAG_member)
    <d88>   DW_AT_name        : (indirect string, offset: 0x12e48): AHB2RSTR
    <d8c>   DW_AT_decl_file   : 2
    <d8c>   DW_AT_decl_line   : 342
    <d8e>   DW_AT_decl_column : 17
    <d8e>   DW_AT_type        : <0xd1d>
    <d92>   DW_AT_data_member_location: 20
 <2><d93>: Abbrev Number: 2 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0x402a0): AHB3RSTR
    <d98>   DW_AT_decl_file   : 2
    <d98>   DW_AT_decl_line   : 343
    <d9a>   DW_AT_decl_column : 17
    <d9a>   DW_AT_type        : <0xd1d>
    <d9e>   DW_AT_data_member_location: 24
 <2><d9f>: Abbrev Number: 2 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x8b0a3): RESERVED0
    <da4>   DW_AT_decl_file   : 2
    <da4>   DW_AT_decl_line   : 344
    <da6>   DW_AT_decl_column : 17
    <da6>   DW_AT_type        : <0xd11>
    <daa>   DW_AT_data_member_location: 28
 <2><dab>: Abbrev Number: 2 (DW_TAG_member)
    <dac>   DW_AT_name        : (indirect string, offset: 0x12a53): APB1RSTR
    <db0>   DW_AT_decl_file   : 2
    <db0>   DW_AT_decl_line   : 345
    <db2>   DW_AT_decl_column : 17
    <db2>   DW_AT_type        : <0xd1d>
    <db6>   DW_AT_data_member_location: 32
 <2><db7>: Abbrev Number: 2 (DW_TAG_member)
    <db8>   DW_AT_name        : (indirect string, offset: 0x3fee2): APB2RSTR
    <dbc>   DW_AT_decl_file   : 2
    <dbc>   DW_AT_decl_line   : 346
    <dbe>   DW_AT_decl_column : 17
    <dbe>   DW_AT_type        : <0xd1d>
    <dc2>   DW_AT_data_member_location: 36
 <2><dc3>: Abbrev Number: 2 (DW_TAG_member)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x8b0ad): RESERVED1
    <dc8>   DW_AT_decl_file   : 2
    <dc8>   DW_AT_decl_line   : 347
    <dca>   DW_AT_decl_column : 17
    <dca>   DW_AT_type        : <0xd32>
    <dce>   DW_AT_data_member_location: 40
 <2><dcf>: Abbrev Number: 2 (DW_TAG_member)
    <dd0>   DW_AT_name        : (indirect string, offset: 0xe707): AHB1ENR
    <dd4>   DW_AT_decl_file   : 2
    <dd4>   DW_AT_decl_line   : 348
    <dd6>   DW_AT_decl_column : 17
    <dd6>   DW_AT_type        : <0xd1d>
    <dda>   DW_AT_data_member_location: 48
 <2><ddb>: Abbrev Number: 2 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x285e2): AHB2ENR
    <de0>   DW_AT_decl_file   : 2
    <de0>   DW_AT_decl_line   : 349
    <de2>   DW_AT_decl_column : 17
    <de2>   DW_AT_type        : <0xd1d>
    <de6>   DW_AT_data_member_location: 52
 <2><de7>: Abbrev Number: 2 (DW_TAG_member)
    <de8>   DW_AT_name        : (indirect string, offset: 0x422c0): AHB3ENR
    <dec>   DW_AT_decl_file   : 2
    <dec>   DW_AT_decl_line   : 350
    <dee>   DW_AT_decl_column : 17
    <dee>   DW_AT_type        : <0xd1d>
    <df2>   DW_AT_data_member_location: 56
 <2><df3>: Abbrev Number: 2 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0x8b0b7): RESERVED2
    <df8>   DW_AT_decl_file   : 2
    <df8>   DW_AT_decl_line   : 351
    <dfa>   DW_AT_decl_column : 17
    <dfa>   DW_AT_type        : <0xd11>
    <dfe>   DW_AT_data_member_location: 60
 <2><dff>: Abbrev Number: 2 (DW_TAG_member)
    <e00>   DW_AT_name        : (indirect string, offset: 0x6f880): APB1ENR
    <e04>   DW_AT_decl_file   : 2
    <e04>   DW_AT_decl_line   : 352
    <e06>   DW_AT_decl_column : 17
    <e06>   DW_AT_type        : <0xd1d>
    <e0a>   DW_AT_data_member_location: 64
 <2><e0b>: Abbrev Number: 2 (DW_TAG_member)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x135d5): APB2ENR
    <e10>   DW_AT_decl_file   : 2
    <e10>   DW_AT_decl_line   : 353
    <e12>   DW_AT_decl_column : 17
    <e12>   DW_AT_type        : <0xd1d>
    <e16>   DW_AT_data_member_location: 68
 <2><e17>: Abbrev Number: 2 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0x8b0c1): RESERVED3
    <e1c>   DW_AT_decl_file   : 2
    <e1c>   DW_AT_decl_line   : 354
    <e1e>   DW_AT_decl_column : 17
    <e1e>   DW_AT_type        : <0xd32>
    <e22>   DW_AT_data_member_location: 72
 <2><e23>: Abbrev Number: 2 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0x498a3): AHB1LPENR
    <e28>   DW_AT_decl_file   : 2
    <e28>   DW_AT_decl_line   : 355
    <e2a>   DW_AT_decl_column : 17
    <e2a>   DW_AT_type        : <0xd1d>
    <e2e>   DW_AT_data_member_location: 80
 <2><e2f>: Abbrev Number: 2 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0x2260e): AHB2LPENR
    <e34>   DW_AT_decl_file   : 2
    <e34>   DW_AT_decl_line   : 356
    <e36>   DW_AT_decl_column : 17
    <e36>   DW_AT_type        : <0xd1d>
    <e3a>   DW_AT_data_member_location: 84
 <2><e3b>: Abbrev Number: 2 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x636e4): AHB3LPENR
    <e40>   DW_AT_decl_file   : 2
    <e40>   DW_AT_decl_line   : 357
    <e42>   DW_AT_decl_column : 17
    <e42>   DW_AT_type        : <0xd1d>
    <e46>   DW_AT_data_member_location: 88
 <2><e47>: Abbrev Number: 2 (DW_TAG_member)
    <e48>   DW_AT_name        : (indirect string, offset: 0x8b0cb): RESERVED4
    <e4c>   DW_AT_decl_file   : 2
    <e4c>   DW_AT_decl_line   : 358
    <e4e>   DW_AT_decl_column : 17
    <e4e>   DW_AT_type        : <0xd11>
    <e52>   DW_AT_data_member_location: 92
 <2><e53>: Abbrev Number: 2 (DW_TAG_member)
    <e54>   DW_AT_name        : (indirect string, offset: 0x61f1b): APB1LPENR
    <e58>   DW_AT_decl_file   : 2
    <e58>   DW_AT_decl_line   : 359
    <e5a>   DW_AT_decl_column : 17
    <e5a>   DW_AT_type        : <0xd1d>
    <e5e>   DW_AT_data_member_location: 96
 <2><e5f>: Abbrev Number: 2 (DW_TAG_member)
    <e60>   DW_AT_name        : (indirect string, offset: 0xd933): APB2LPENR
    <e64>   DW_AT_decl_file   : 2
    <e64>   DW_AT_decl_line   : 360
    <e66>   DW_AT_decl_column : 17
    <e66>   DW_AT_type        : <0xd1d>
    <e6a>   DW_AT_data_member_location: 100
 <2><e6b>: Abbrev Number: 2 (DW_TAG_member)
    <e6c>   DW_AT_name        : (indirect string, offset: 0x8b0d5): RESERVED5
    <e70>   DW_AT_decl_file   : 2
    <e70>   DW_AT_decl_line   : 361
    <e72>   DW_AT_decl_column : 17
    <e72>   DW_AT_type        : <0xd32>
    <e76>   DW_AT_data_member_location: 104
 <2><e77>: Abbrev Number: 2 (DW_TAG_member)
    <e78>   DW_AT_name        : (indirect string, offset: 0x168e6): BDCR
    <e7c>   DW_AT_decl_file   : 2
    <e7c>   DW_AT_decl_line   : 362
    <e7e>   DW_AT_decl_column : 17
    <e7e>   DW_AT_type        : <0xd1d>
    <e82>   DW_AT_data_member_location: 112
 <2><e83>: Abbrev Number: 7 (DW_TAG_member)
    <e84>   DW_AT_name        : CSR
    <e88>   DW_AT_decl_file   : 2
    <e88>   DW_AT_decl_line   : 363
    <e8a>   DW_AT_decl_column : 17
    <e8a>   DW_AT_type        : <0xd1d>
    <e8e>   DW_AT_data_member_location: 116
 <2><e8f>: Abbrev Number: 2 (DW_TAG_member)
    <e90>   DW_AT_name        : (indirect string, offset: 0x8b0df): RESERVED6
    <e94>   DW_AT_decl_file   : 2
    <e94>   DW_AT_decl_line   : 364
    <e96>   DW_AT_decl_column : 17
    <e96>   DW_AT_type        : <0xd32>
    <e9a>   DW_AT_data_member_location: 120
 <2><e9b>: Abbrev Number: 2 (DW_TAG_member)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x4e5c6): SSCGR
    <ea0>   DW_AT_decl_file   : 2
    <ea0>   DW_AT_decl_line   : 365
    <ea2>   DW_AT_decl_column : 17
    <ea2>   DW_AT_type        : <0xd1d>
    <ea6>   DW_AT_data_member_location: 128
 <2><ea7>: Abbrev Number: 2 (DW_TAG_member)
    <ea8>   DW_AT_name        : (indirect string, offset: 0x318c5): PLLI2SCFGR
    <eac>   DW_AT_decl_file   : 2
    <eac>   DW_AT_decl_line   : 366
    <eae>   DW_AT_decl_column : 17
    <eae>   DW_AT_type        : <0xd1d>
    <eb2>   DW_AT_data_member_location: 132
 <2><eb3>: Abbrev Number: 2 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x8b0e9): RESERVED7
    <eb8>   DW_AT_decl_file   : 2
    <eb8>   DW_AT_decl_line   : 367
    <eba>   DW_AT_decl_column : 17
    <eba>   DW_AT_type        : <0xd22>
    <ebe>   DW_AT_data_member_location: 136
 <2><ebf>: Abbrev Number: 2 (DW_TAG_member)
    <ec0>   DW_AT_name        : (indirect string, offset: 0x403fa): DCKCFGR
    <ec4>   DW_AT_decl_file   : 2
    <ec4>   DW_AT_decl_line   : 368
    <ec6>   DW_AT_decl_column : 17
    <ec6>   DW_AT_type        : <0xd1d>
    <eca>   DW_AT_data_member_location: 140
 <2><ecb>: Abbrev Number: 0
 <1><ecc>: Abbrev Number: 16 (DW_TAG_typedef)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x447c2): RCC_TypeDef
    <ed1>   DW_AT_decl_file   : 2
    <ed2>   DW_AT_decl_line   : 369
    <ed4>   DW_AT_decl_column : 3
    <ed5>   DW_AT_type        : <0xd42>
 <1><ed9>: Abbrev Number: 3 (DW_TAG_base_type)
    <eda>   DW_AT_byte_size   : 8
    <edb>   DW_AT_encoding    : 4	(float)
    <edc>   DW_AT_name        : (indirect string, offset: 0x996f6): long double
 <1><ee0>: Abbrev Number: 10 (DW_TAG_subprogram)
    <ee1>   DW_AT_external    : 1
    <ee1>   DW_AT_name        : (indirect string, offset: 0x93bd2): HAL_NVIC_EnableIRQ
    <ee5>   DW_AT_decl_file   : 5
    <ee5>   DW_AT_decl_line   : 262
    <ee7>   DW_AT_decl_column : 6
    <ee7>   DW_AT_prototyped  : 1
    <ee7>   DW_AT_declaration : 1
    <ee7>   DW_AT_sibling     : <0xef1>
 <2><eeb>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <eec>   DW_AT_type        : <0xcba>
 <2><ef0>: Abbrev Number: 0
 <1><ef1>: Abbrev Number: 10 (DW_TAG_subprogram)
    <ef2>   DW_AT_external    : 1
    <ef2>   DW_AT_name        : (indirect string, offset: 0x93e58): HAL_NVIC_SetPriority
    <ef6>   DW_AT_decl_file   : 5
    <ef6>   DW_AT_decl_line   : 261
    <ef8>   DW_AT_decl_column : 6
    <ef8>   DW_AT_prototyped  : 1
    <ef8>   DW_AT_declaration : 1
    <ef8>   DW_AT_sibling     : <0xf0c>
 <2><efc>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <efd>   DW_AT_type        : <0xcba>
 <2><f01>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <f02>   DW_AT_type        : <0xd11>
 <2><f06>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <f07>   DW_AT_type        : <0xd11>
 <2><f0b>: Abbrev Number: 0
 <1><f0c>: Abbrev Number: 17 (DW_TAG_subprogram)
    <f0d>   DW_AT_external    : 1
    <f0d>   DW_AT_name        : (indirect string, offset: 0x93d6c): MX_DMA_Init
    <f11>   DW_AT_decl_file   : 1
    <f12>   DW_AT_decl_line   : 39
    <f13>   DW_AT_decl_column : 6
    <f14>   DW_AT_prototyped  : 1
    <f14>   DW_AT_low_pc      : 0x80006f0
    <f18>   DW_AT_high_pc     : 0x40
    <f1c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f1e>   DW_AT_call_all_tail_calls: 1
 <2><f1e>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <f1f>   DW_AT_low_pc      : 0x80006f6
    <f23>   DW_AT_high_pc     : 0x1c
 <3><f27>: Abbrev Number: 19 (DW_TAG_variable)
    <f28>   DW_AT_name        : (indirect string, offset: 0x425f): tmpreg
    <f2c>   DW_AT_decl_file   : 1
    <f2d>   DW_AT_decl_line   : 43
    <f2e>   DW_AT_decl_column : 3
    <f2f>   DW_AT_type        : <0xd1d>
    <f33>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><f36>: Abbrev Number: 0
 <2><f37>: Abbrev Number: 0
 <1><f38>: Abbrev Number: 0
  Compilation Unit @ offset 0xf39:
   Length:        0xc5c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3ce
   Pointer Size:  4
 <0><f45>: Abbrev Number: 31 (DW_TAG_compile_unit)
    <f46>   DW_AT_producer    : (indirect string, offset: 0x116): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f4a>   DW_AT_language    : 29	(C11)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x9abf8): ../Core/Src/freertos.c
    <f4f>   DW_AT_comp_dir    : (indirect string, offset: 0x2c24): /home/dweggg/Repos/RCSailingEEBE/RCSailingEEBE_STM32/Debug
    <f53>   DW_AT_ranges      : 0x8c
    <f57>   DW_AT_low_pc      : 0
    <f5b>   DW_AT_stmt_list   : 0x105c
    <f5f>   DW_AT_macros      : 0x157c6
 <1><f63>: Abbrev Number: 32 (DW_TAG_base_type)
    <f64>   DW_AT_byte_size   : 4
    <f65>   DW_AT_encoding    : 5	(signed)
    <f66>   DW_AT_name        : int
 <1><f6a>: Abbrev Number: 6 (DW_TAG_base_type)
    <f6b>   DW_AT_byte_size   : 4
    <f6c>   DW_AT_encoding    : 7	(unsigned)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x1ff9): unsigned int
 <1><f71>: Abbrev Number: 6 (DW_TAG_base_type)
    <f72>   DW_AT_byte_size   : 8
    <f73>   DW_AT_encoding    : 5	(signed)
    <f74>   DW_AT_name        : (indirect string, offset: 0x126b): long long int
 <1><f78>: Abbrev Number: 6 (DW_TAG_base_type)
    <f79>   DW_AT_byte_size   : 8
    <f7a>   DW_AT_encoding    : 4	(float)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x996f6): long double
 <1><f7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <f80>   DW_AT_byte_size   : 1
    <f81>   DW_AT_encoding    : 6	(signed char)
    <f82>   DW_AT_name        : (indirect string, offset: 0x2107): signed char
 <1><f86>: Abbrev Number: 6 (DW_TAG_base_type)
    <f87>   DW_AT_byte_size   : 1
    <f88>   DW_AT_encoding    : 8	(unsigned char)
    <f89>   DW_AT_name        : (indirect string, offset: 0x223c): unsigned char
 <1><f8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <f8e>   DW_AT_byte_size   : 2
    <f8f>   DW_AT_encoding    : 5	(signed)
    <f90>   DW_AT_name        : (indirect string, offset: 0x599): short int
 <1><f94>: Abbrev Number: 6 (DW_TAG_base_type)
    <f95>   DW_AT_byte_size   : 2
    <f96>   DW_AT_encoding    : 7	(unsigned)
    <f97>   DW_AT_name        : (indirect string, offset: 0x2595): short unsigned int
 <1><f9b>: Abbrev Number: 6 (DW_TAG_base_type)
    <f9c>   DW_AT_byte_size   : 4
    <f9d>   DW_AT_encoding    : 5	(signed)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x1f99): long int
 <1><fa2>: Abbrev Number: 5 (DW_TAG_typedef)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x5dd5b): __uint32_t
    <fa7>   DW_AT_decl_file   : 2
    <fa8>   DW_AT_decl_line   : 79
    <fa9>   DW_AT_decl_column : 25
    <faa>   DW_AT_type        : <0xfae>
 <1><fae>: Abbrev Number: 6 (DW_TAG_base_type)
    <faf>   DW_AT_byte_size   : 4
    <fb0>   DW_AT_encoding    : 7	(unsigned)
    <fb1>   DW_AT_name        : (indirect string, offset: 0x1d66): long unsigned int
 <1><fb5>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <fb6>   DW_AT_type        : <0xfae>
 <1><fba>: Abbrev Number: 6 (DW_TAG_base_type)
    <fbb>   DW_AT_byte_size   : 8
    <fbc>   DW_AT_encoding    : 7	(unsigned)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x29a6): long long unsigned int
 <1><fc1>: Abbrev Number: 5 (DW_TAG_typedef)
    <fc2>   DW_AT_name        : (indirect string, offset: 0x98c5f): uint32_t
    <fc6>   DW_AT_decl_file   : 3
    <fc7>   DW_AT_decl_line   : 48
    <fc8>   DW_AT_decl_column : 20
    <fc9>   DW_AT_type        : <0xfa2>
 <1><fcd>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <fce>   DW_AT_type        : <0xfc1>
 <1><fd2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fd3>   DW_AT_byte_size   : 4
    <fd3>   DW_AT_type        : <0xfd7>
 <1><fd7>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <fd8>   DW_AT_prototyped  : 1
    <fd8>   DW_AT_sibling     : <0xfe2>
 <2><fdc>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <fdd>   DW_AT_type        : <0xfe2>
 <2><fe1>: Abbrev Number: 0
 <1><fe2>: Abbrev Number: 33 (DW_TAG_pointer_type)
    <fe3>   DW_AT_byte_size   : 4
 <1><fe4>: Abbrev Number: 6 (DW_TAG_base_type)
    <fe5>   DW_AT_byte_size   : 1
    <fe6>   DW_AT_encoding    : 8	(unsigned char)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x96120): char
 <1><feb>: Abbrev Number: 18 (DW_TAG_const_type)
    <fec>   DW_AT_type        : <0xfe4>
 <1><ff0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ff1>   DW_AT_byte_size   : 4
    <ff1>   DW_AT_type        : <0xfeb>
 <1><ff5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <ff6>   DW_AT_byte_size   : 24
    <ff7>   DW_AT_decl_file   : 4
    <ff8>   DW_AT_decl_line   : 213
    <ff9>   DW_AT_decl_column : 9
    <ff9>   DW_AT_sibling     : <0x1045>
 <2><ffd>: Abbrev Number: 19 (DW_TAG_member)
    <ffe>   DW_AT_name        : CR
    <1001>   DW_AT_decl_file   : 4
    <1001>   DW_AT_decl_line   : 215
    <1002>   DW_AT_decl_column : 17
    <1002>   DW_AT_type        : <0xfcd>
    <1006>   DW_AT_data_member_location: 0
 <2><1007>: Abbrev Number: 2 (DW_TAG_member)
    <1008>   DW_AT_name        : (indirect string, offset: 0x489ba): NDTR
    <100c>   DW_AT_decl_file   : 4
    <100d>   DW_AT_decl_line   : 216
    <100e>   DW_AT_decl_column : 17
    <100f>   DW_AT_type        : <0xfcd>
    <1013>   DW_AT_data_member_location: 4
 <2><1014>: Abbrev Number: 19 (DW_TAG_member)
    <1015>   DW_AT_name        : PAR
    <1019>   DW_AT_decl_file   : 4
    <1019>   DW_AT_decl_line   : 217
    <101a>   DW_AT_decl_column : 17
    <101a>   DW_AT_type        : <0xfcd>
    <101e>   DW_AT_data_member_location: 8
 <2><101f>: Abbrev Number: 2 (DW_TAG_member)
    <1020>   DW_AT_name        : (indirect string, offset: 0x3d6f0): M0AR
    <1024>   DW_AT_decl_file   : 4
    <1025>   DW_AT_decl_line   : 218
    <1026>   DW_AT_decl_column : 17
    <1027>   DW_AT_type        : <0xfcd>
    <102b>   DW_AT_data_member_location: 12
 <2><102c>: Abbrev Number: 2 (DW_TAG_member)
    <102d>   DW_AT_name        : (indirect string, offset: 0x1006d): M1AR
    <1031>   DW_AT_decl_file   : 4
    <1032>   DW_AT_decl_line   : 219
    <1033>   DW_AT_decl_column : 17
    <1034>   DW_AT_type        : <0xfcd>
    <1038>   DW_AT_data_member_location: 16
 <2><1039>: Abbrev Number: 19 (DW_TAG_member)
    <103a>   DW_AT_name        : FCR
    <103e>   DW_AT_decl_file   : 4
    <103e>   DW_AT_decl_line   : 220
    <103f>   DW_AT_decl_column : 17
    <103f>   DW_AT_type        : <0xfcd>
    <1043>   DW_AT_data_member_location: 20
 <2><1044>: Abbrev Number: 0
